{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}/Users/scottmiller/Dropbox (UFL)/LSIL/Pre-Analysis Plan/PAP Master Replication/Stata Files/lsilPAP1.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res} 9 Jun 2019, 10:28:52
{txt}
{com}. 
. 
. ** Load merged baseline dataset
. use "$d3/Baseline_Merged.dta", clear
{txt}
{com}. 
. 
. ** Add true and randomized treatment status to this dataset
. * Merge treatment status from original randomization
. 
. * Original dataset
. clear
{txt}
{com}. use "$d4/Merged/r_Baseline_Merged_Str.dta"
{txt}( )

{com}. recast str99 idx // idx is str99 in Baseline_Merged
{txt}
{com}. 
. keep idx treat r_treat strata
{txt}
{com}. 
. save "$d3/treat.dta", replace
{txt}file /Users/scottmiller/Dropbox (UFL)/LSIL/Pre-Analysis Plan/PAP Master Replication/Data/Clean Data/treat.dta saved

{com}. 
. merge 1:1 idx using "$d3/Baseline_Merged.dta"
{res}
{txt}{col 5}Result{col 38}# of obs.
{col 5}{hline 41}
{col 5}not matched{col 30}{res}               2
{txt}{col 9}from master{col 30}{res}               0{txt}  (_merge==1)
{col 9}from using{col 30}{res}               2{txt}  (_merge==2)

{col 5}matched{col 30}{res}             106{txt}  (_merge==3)
{col 5}{hline 41}

{com}. drop if _merge == 2 // co-ops dropped in original treatment status
{txt}(2 observations deleted)

{com}. drop if district == "Banke"
{txt}(14 observations deleted)

{com}. 
. save "$d3/r_Baseline_Merged_Str.dta", replace
{txt}file /Users/scottmiller/Dropbox (UFL)/LSIL/Pre-Analysis Plan/PAP Master Replication/Data/Clean Data/r_Baseline_Merged_Str.dta saved

{com}. 
.  
. 
{txt}end of do-file

{com}. 
. /*******************************************************************************
> lsilPAP2.d0             
>                                         
> - Generates a merged dataset at the HH level
>         Collapses HH data from ind. level to HH level
>         Saves respective datasets as r_CO_Merged_PAP.dta
>         and r_HH_Merged_PAP.dta
>         
> *******************************************************************************/
. 
. 
. clear all
{res}{txt}
{com}. set more off, perm
{txt}({cmd:set more} preference recorded)

{com}. 
. *log
. cap log close
{smcl}
{com}{sf}{ul off}