{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}/Users/scottmiller/Documents/GitHub/LSIL_PAP/lsilPAP4_test.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res}18 Oct 2018, 17:11:24
{txt}
{com}. 
. cd "$d3" 
{res}/Users/scottmiller/Dropbox (UFL)/LSIL/Pre-Analysis Plan/Stata Files/PAP Data/LSIL-DATA_scott/VCC baseline aug 20 2018
{txt}
{com}. 
. 
. ** co-op dataset **
. clear
{txt}
{com}. use "r_CO_Merged_PAP.dta"
{txt}
{com}. 
. * Drop Banke District & Pilot Co-op
. drop if district == "Banke"
{txt}(14 observations deleted)

{com}. drop if r_treat ==.
{txt}(0 observations deleted)

{com}. drop if idx == "" 
{txt}(0 observations deleted)

{com}. 
. * Weights = 1 & control group
. generate wgt = 1
{txt}
{com}. generate stdgroup = r_treat
{txt}
{com}. 
. encode region, gen(n_region) // create numerical region variable for regression
{txt}
{com}. 
. ** Winsorize LS9
. * treatment
. sum LS9 if r_treat == 1, d

     {txt}LS9 How much did you earn in total from this sale?
{hline 61}
      Percentiles      Smallest
 1%    {res} 9594.595       9594.595
{txt} 5%    {res} 10083.33        9975.61
{txt}10%    {res} 10318.27       10083.33       {txt}Obs         {res}         46
{txt}25%    {res} 12773.68       10208.41       {txt}Sum of Wgt. {res}         46

{txt}50%    {res} 16727.13                      {txt}Mean          {res} 17912.88
                        {txt}Largest       Std. Dev.     {res} 7183.817
{txt}75%    {res} 22508.85       26539.14
{txt}90%    {res}    26300       27211.86       {txt}Variance      {res} 5.16e+07
{txt}95%    {res} 27211.86          40040       {txt}Skewness      {res} 1.644055
{txt}99%    {res} 44044.44       44044.44       {txt}Kurtosis      {res} 6.502127
{txt}
{com}. scalar t_99 = r(p99)
{txt}
{com}. 
. replace LS9 = t_99 if LS9 > t_99 & !missing(LS9) & r_treat == 1
{txt}(0 real changes made)

{com}. 
. *control
. sum LS9 if r_treat == 0, d

     {txt}LS9 How much did you earn in total from this sale?
{hline 61}
      Percentiles      Smallest
 1%    {res} 4865.857       4865.857
{txt} 5%    {res} 8730.769           5885
{txt}10%    {res} 9857.143       8730.769       {txt}Obs         {res}         46
{txt}25%    {res} 11906.25       9808.333       {txt}Sum of Wgt. {res}         46

{txt}50%    {res} 14718.45                      {txt}Mean          {res} 17002.02
                        {txt}Largest       Std. Dev.     {res} 8848.293
{txt}75%    {res} 19731.91          26250
{txt}90%    {res}  25806.8       27681.82       {txt}Variance      {res} 7.83e+07
{txt}95%    {res} 27681.82          35955       {txt}Skewness      {res} 2.727105
{txt}99%    {res} 60121.95       60121.95       {txt}Kurtosis      {res} 13.62087
{txt}
{com}. scalar c_99 = r(p99)
{txt}
{com}. 
. replace LS9 = c_99 if LS9 > c_99 & !missing(LS9) & r_treat == 0
{txt}(0 real changes made)

{com}. 
. 
. ** Replace Missing values with zero 
. * LS9 , 
. replace LS9 = 0 if LS9 ==.
{txt}(0 real changes made)

{com}. replace co_opsalevalue = 0 if co_opsalevalue ==.
{txt}(0 real changes made)

{com}. 
. 
. 
. 
. ** Communication **
. 
. /* Variables 
> # of times initiated contact with SHG : comm1
> # of times SHG initiated contact : comm2
> Factors that limit communication : (not in index - used as control vars)
> */
. 
.         * # of times initiated contact with SHG : comm1
.         gen comm1 = COMM1a + COMM1b ///
>         + COMM1c + COMM1d
{txt}(2 missing values generated)

{com}.         * # of times SHG initiated contact : comm2
.         gen comm2 = COMM2a + COMM2b ///
>         + COMM2c + COMM2d
{txt}(2 missing values generated)

{com}.         ** Total # of times initiated contact
.         gen contact = comm1 + comm2
{txt}(2 missing values generated)

{com}.         
.         * Total # of times HH is contacted
.         gen HHcontact = COM3 + COM8
{txt}(14 missing values generated)

{com}.         
. 
. * co-op comm index
. local local_CO_comm_full contact COM3 COM8
{txt}
{com}. make_index_gr CO_comm_full wgt stdgroup `local_CO_comm_full' 
{res}  938
{txt}
{com}. 
. * factors that limit communication
.         * principal components index
. 
. 
. ** Transparency **
. 
. /* Variables
> Mandate : Co_opTransparencyTRN1
> Annual Report : Co_opTransparencyTRN2
> Annual Budget : Co_opTransparencyTRN3
> Financial Report: Co_opTransparencyTRN4 
> Meeting minutes : Co_opTransparencyTRN5
> Election Results : Co_opTransparencyTRN6
> Sale Records : Co_opTransparencyTRN7
> Evaluations : Co_opTransparencyTRN8
> */
.         
. ** Co-op Transparency   
. local local_CO_TRN CO_TRN1 CO_TRN2 ///
>         CO_TRN3 CO_TRN4 CO_TRN5 ///
>         CO_TRN6 CO_TRN7
{txt}
{com}. make_index_gr CO_TRN wgt stdgroup `local_CO_TRN' 
{res}  939
{txt}
{com}. 
. 
. ** Household Awareness
. local local_HH_TRN HH_TRN1 HH_TRN2 ///
>         HH_TRN3 HH_TRN4 HH_TRN5 ///
>         HH_TRN6 HH_TRN7
{txt}
{com}. make_index_gr HH_TRN wgt stdgroup `local_HH_TRN' 
{res}  940
{txt}
{com}. 
. 
. ** Discrepancy
.         forvalues i=1/7 {c -(} 
{txt}  2{com}.                 gen dTRN`i' = -(CO_TRN`i' - HH_TRN`i')^2
{txt}  3{com}.                 {c )-}
{txt}(2 missing values generated)
(2 missing values generated)
(2 missing values generated)
(2 missing values generated)
(2 missing values generated)
(2 missing values generated)
(2 missing values generated)

{com}.                 
. local local_dTRN dTRN1 dTRN2 dTRN3 dTRN4 dTRN5 dTRN6 dTRN7
{txt}
{com}. make_index_gr dTRN wgt stdgroup `local_dTRN' 
{res}  948
{txt}
{com}. 
. * average discrepancy
. egen avg_dTRN = rowmean(dTRN1 dTRN2 dTRN3 dTRN4 dTRN5 dTRN6 dTRN7)
{txt}(2 missing values generated)

{com}. 
. 
. ** Cooperative Finances **
. 
. /* Variables 
> Revenue from all activities : role_GMrevenuandcostREV4
> Costs from all activities : role_GMrevenuandcostcalc_REC7
> Assets : role_GMFinLiabiliteisFAL1
> Liabilities : role_GMFinLiabiliteisFAL2
> Goat Rev : role_GMrevenuandcostREC4_1
> Members : role_CPMgt_and_membershi1
> */
. 
. * Convert to USD as of 1/1/18
. 
. gen revenue = REV4*(0.0099) // names too long for macros
{txt}(2 missing values generated)

{com}. gen costs = REC7*(0.0099)
{txt}(2 missing values generated)

{com}. gen assets = FAL1*(0.0099)
{txt}(2 missing values generated)

{com}. gen liabilities = FAL2*(0.0099)
{txt}(2 missing values generated)

{com}. gen goatrev = REC4_1*(0.0099)
{txt}(2 missing values generated)

{com}. 
. gen net_rev = revenue - costs
{txt}(2 missing values generated)

{com}. gen net_finances = (revenue - costs) ///
>                                         + (assets - liabilities)
{txt}(2 missing values generated)

{com}. 
. * per member
. gen rev_member = revenue / MAN3
{txt}(2 missing values generated)

{com}. gen cost_member =  costs / MAN3
{txt}(2 missing values generated)

{com}. gen assets_member = assets / MAN3
{txt}(2 missing values generated)

{com}. gen liab_member = liabilities / MAN3
{txt}(2 missing values generated)

{com}. gen net_rev_member = net_rev / MAN3
{txt}(2 missing values generated)

{com}. gen net_finances_member = net_finances / MAN3
{txt}(2 missing values generated)

{com}. gen goatrev_member = goatrev / MAN3
{txt}(2 missing values generated)

{com}. 
. ** Replace Missing values with zero 
. *  , 
. replace revenue = 0 if revenue ==.
{txt}(2 real changes made)

{com}. replace rev_member = 0 if rev_member ==.
{txt}(2 real changes made)

{com}. replace costs = 0 if costs ==.
{txt}(2 real changes made)

{com}. replace cost_mem = 0 if cost_mem ==.            
{txt}(2 real changes made)

{com}. 
. 
. ** Goat Sales ** 
. 
. /* Variables 
> # of goats sold : REC1
> goat revenue : REC4_1
> # of organized sales at collection points : GTT1
> Members : MAN3
> Goat revenue per member : goatrev_member
> Trader visits per sale
> Time passed
> Transportation costs
> */
. 
. ** co-op level vars
. gen goats_sold = REC1
{txt}(2 missing values generated)

{com}. gen goats_sold_member = REC1 / MAN3
{txt}(2 missing values generated)

{com}. * goatrev
. * revenue per goat sold
. gen goatrev_sold = goatrev / REC1
{txt}(22 missing values generated)

{com}. gen col_points = GTT1
{txt}
{com}. 
. local local_CO_goatsales goats_sold goatrev col_points
{txt}
{com}. make_index_gr CO_goatsales wgt stdgroup `local_CO_goatsales' 
{res}  968
{txt}
{com}. 
. 
. ** household level vars
. gen co_opshare = 0
{txt}
{com}. replace co_opshare = co_opgoatno / LS8 if LS8 != 0
{txt}(59 real changes made)

{com}. gen visits_sale = -1*(LS40 / LS_n_sales)
{txt}
{com}. gen time_passed = -1*(LS41)
{txt}
{com}. gen transp_cost = -1*(LS42*(0.0099))
{txt}
{com}. 
. local local_HH_goatsales LS8 LS9 co_opgoatno co_opsalevalue
{txt}
{com}. make_index_gr HH_goatsales wgt stdgroup `local_HH_goatsales' 
{res}  973
{txt}
{com}. 
. local local_salecost visits_sale time_passed transp_cost
{txt}
{com}. make_index_gr salecost wgt stdgroup `local_salecost' 
{res}  974
{txt}
{com}. 
. 
. * Gross margin -- Net rev. per goat
. 
. /* Costs
> Amount spent purchasing goats: LSE12
> Amount spent on feed/fodder : LSE15
> Amount spent on vet care : LSE16
> Amount spent on breeding fees : LSE17a * LSE17b
> Amount spent on shelters : LSE18
> */
. 
. gen goat_costs = LSE12*(0.0099) + LSE15*(0.0099) + LSE16*(0.0099) + (LSE17a*LSE17b)*(0.0099) + LSE18*(0.0099)
{txt}(16 missing values generated)

{com}. gen net_goat_income = LS9*(0.0099) - goat_costs
{txt}(16 missing values generated)

{com}. gen netincome_goat = net_goat_income / LS8
{txt}(16 missing values generated)

{com}. 
. 
. 
. ** Decision-Making **
. 
. /* Variables 
> Setting interest rate (loans) : MAN18a 
> Setting interest rate (savings) : MAN18b
> Setting prices (traders) : MAN18c
> Buying equipment : MAN18d
> General assembly dates: MAN18e
> */
. 
. * destring
. foreach v of varlist MAN18a MAN18b ///
> MAN18c MAN18d MAN18e {c -(}
{txt}  2{com}.         destring `v', replace
{txt}  3{com}. {c )-}       
{txt}MAN18a: all characters numeric; {res}replaced {txt}as {res}byte
{txt}(65 missing values generated)
{res}{txt}MAN18b: all characters numeric; {res}replaced {txt}as {res}byte
{txt}(65 missing values generated)
{res}{txt}MAN18c: all characters numeric; {res}replaced {txt}as {res}byte
{txt}(68 missing values generated)
{res}{txt}MAN18d: all characters numeric; {res}replaced {txt}as {res}byte
{txt}(65 missing values generated)
{res}{txt}MAN18e: all characters numeric; {res}replaced {txt}as {res}byte
{txt}(65 missing values generated)
{res}{txt}
{com}. 
. local local_decision MAN18a MAN18b MAN18c MAN18d MAN18e 
{txt}
{com}. make_index_gr decision wgt stdgroup `local_decision'
{res}  978
{txt}
{com}. 
. 
. 
. ** Evaluation & Assessment **
. 
. /* Variables 
> External Evaluation : EAA1
> Available to Co-op : EAA3
> */
. 
. egen avg_EAA = rowmean(EAA1 EAA3)
{txt}(2 missing values generated)

{com}. 
. 
. ** Planning and Goals **
. 
. /* Variables 
> Business Plan : PNG1
> Time Horizon : PNG2
> Expected Goats Sold : PNG3
> Expected Rev. : PNG4
> */
. 
. gen expected_rev = PNG4*(0.0099)
{txt}(2 missing values generated)

{com}. 
. local local_PNG PNG1 PNG2 PNG3 expected_rev
{txt}
{com}. make_index_gr PNG wgt stdgroup `local_PNG'
{res}  981
{txt}
{com}. 
. save "$d3/r_CO_Merged_Ind.dta", replace
{txt}file /Users/scottmiller/Dropbox (UFL)/LSIL/Pre-Analysis Plan/Stata Files/PAP Data/LSIL-DATA_scott/VCC baseline aug 20 2018/r_CO_Merged_Ind.dta saved

{com}. 
. 
. 
. ****************
. ** HH dataset **
. clear
{txt}
{com}. use "$d3/r_HH_Merged_PAP.dta"
{txt}
{com}. 
. * Drop Banke District & Pilot Co-op
. drop if district == "Banke"
{txt}(360 observations deleted)

{com}. drop if r_treat == .
{txt}(48 observations deleted)

{com}. drop if idx == "" 
{txt}(0 observations deleted)

{com}. 
. * Weights = 1 & control group
. generate wgt = 1
{txt}
{com}. generate stdgroup = r_treat
{txt}
{com}. 
. encode region, gen(n_region) // create numerical region variable for regression
{txt}
{com}. 
. 
. ** Winsorize LS9
. * treatment
. sum LS9 if r_treat == 1, d

     {txt}LS9 How much did you earn in total from this sale?
{hline 61}
      Percentiles      Smallest
 1%    {res}        0              0
{txt} 5%    {res}     2000              0
{txt}10%    {res}     4100              0       {txt}Obs         {res}        670
{txt}25%    {res}     8000              0       {txt}Sum of Wgt. {res}        670

{txt}50%    {res}    14000                      {txt}Mean          {res} 19408.81
                        {txt}Largest       Std. Dev.     {res} 21055.66
{txt}75%    {res}    24000         135000
{txt}90%    {res}    38000         145000       {txt}Variance      {res} 4.43e+08
{txt}95%    {res}    50000         235000       {txt}Skewness      {res} 5.149765
{txt}99%    {res}    90000         260000       {txt}Kurtosis      {res} 47.77864
{txt}
{com}. scalar t_99 = r(p99)
{txt}
{com}. 
. replace LS9 = t_99 if LS9 > t_99 & !missing(LS9) & r_treat == 1
{txt}(6 real changes made)

{com}. 
. *control
. sum LS9 if r_treat == 0, d

     {txt}LS9 How much did you earn in total from this sale?
{hline 61}
      Percentiles      Smallest
 1%    {res}        0              0
{txt} 5%    {res}        0              0
{txt}10%    {res}     4000              0       {txt}Obs         {res}        606
{txt}25%    {res}     7000              0       {txt}Sum of Wgt. {res}        606

{txt}50%    {res}    12500                      {txt}Mean          {res} 18580.66
                        {txt}Largest       Std. Dev.     {res} 26927.11
{txt}75%    {res}    22500         155600
{txt}90%    {res}    35000         195000       {txt}Variance      {res} 7.25e+08
{txt}95%    {res}    50000         220500       {txt}Skewness      {res} 8.796708
{txt}99%    {res}   113300         450000       {txt}Kurtosis      {res} 120.7191
{txt}
{com}. scalar c_99 = r(p99)
{txt}
{com}. 
. replace LS9 = c_99 if LS9 > c_99 & !missing(LS9) & r_treat == 0
{txt}(6 real changes made)

{com}. 
. 
. ** Replace Missing values with zero 
. * LS9 , 
. replace LS9 = 0 if LS9 ==.
{txt}(1,172 real changes made)

{com}. replace co_opsalevalue = 0 if co_opsalevalue ==.
{txt}(1,172 real changes made)

{com}. 
. 
. ** Communication **
. 
. * Variables 
. 
.         * Total # of times HH is contacted
.         gen HHcontact = COM3 + COM8
{txt}(1,241 missing values generated)

{com}. 
. 
. * HH comm index
. local local_HH_comm COM3 COM8
{txt}
{com}. make_index_gr HH_comm wgt stdgroup `local_HH_comm' 
{res}  936
{txt}
{com}. 
. * factors that limit communication
.         * principal components index
. 
. 
. 
. ** Transparency **
. 
. /* Variables
> Mandate : Co_opTransparencyTRN1
> Annual Report : Co_opTransparencyTRN2
> Annual Budget : Co_opTransparencyTRN3
> Financial Report: Co_opTransparencyTRN4 
> Meeting minutes : Co_opTransparencyTRN5
> Election Results : Co_opTransparencyTRN6
> Sale Records : Co_opTransparencyTRN7
> Evaluations : Co_opTransparencyTRN8
> */
. 
.         /*
>         forvalues i=1/7 {c -(} 
>                 destring role_GMtransTRN`i', replace
>                 replace role_GMtransTRN`i' = 0 if role_GMtransTRN`i' == 2
>                 replace role_GMtransTRN`i' = . if role_GMtransTRN`i' == 97
>                 {c )-}
>         */
.         
. ** Co-op Transparency   
. local local_CO_TRN CO_TRN1 CO_TRN2 ///
>         CO_TRN3 CO_TRN4 CO_TRN5 ///
>         CO_TRN6 CO_TRN7
{txt}
{com}. make_index_gr CO_TRN wgt stdgroup `local_CO_TRN'                
{res}  937
{txt}
{com}. 
. ** Household Awareness
. local local_HH_TRN HH_TRN1 HH_TRN2 ///
>         HH_TRN3 HH_TRN4 HH_TRN5 ///
>         HH_TRN6 HH_TRN7
{txt}
{com}. make_index_gr HH_TRN wgt stdgroup `local_HH_TRN' 
{res}  938
{txt}
{com}. 
.         
. ** Transparency Discrepancy index
.         forvalues i=1/7 {c -(} 
{txt}  2{com}.                 gen dTRN`i' = 1 if CO_TRN`i' == HH_TRN`i' ///
>                         &  !missing(CO_TRN`i') & !missing(HH_TRN`i')
{txt}  3{com}.                 replace dTRN`i' = 0 if CO_TRN`i' != HH_TRN`i' ///
>                         &  !missing(CO_TRN`i') & !missing(HH_TRN`i')
{txt}  4{com}.                 {c )-}
{txt}(1,608 missing values generated)
(1,061 real changes made)
(1,624 missing values generated)
(1,083 real changes made)
(1,619 missing values generated)
(1,091 real changes made)
(1,584 missing values generated)
(1,041 real changes made)
(1,535 missing values generated)
(1,045 real changes made)
(1,678 missing values generated)
(1,026 real changes made)
(1,483 missing values generated)
(915 real changes made)

{com}.                 
. local local_dTRN dTRN1 dTRN2 dTRN3 dTRN4 dTRN5 dTRN6 dTRN7
{txt}
{com}. make_index_gr dTRN wgt stdgroup `local_dTRN' 
{res}  946
{txt}
{com}. 
. * average discrepancy
. egen avg_dTRN = rowmean(dTRN1 dTRN2 dTRN3 dTRN4 dTRN5 dTRN6 dTRN7)
{txt}(356 missing values generated)

{com}. 
. 
. ** Goat Sales ** 
. 
. /* Variables 
> # of goats sold : Livestock_SalesLS8
> goat revenue : Livestock_SalesLS9
> goats sold through co-op : co_opgoatno
> goat revenue through co-op : co_opsalevalue
> share through co-op : co_opshare
> trader visits home : Livestock_SalesLS40
> time passed before sale : Livestock_SalesLS41
> transportation cost : Livestock_SalesLS42
> */
. 
. 
. ** household level vars
. gen co_opshare = 0
{txt}
{com}. replace co_opshare = co_opgoatno / LS8 if LS8 != 0
{txt}(1,433 real changes made, 1,172 to missing)

{com}. gen visits_sale = -1*(LS40 / LS_n_sales)
{txt}(1,172 missing values generated)

{com}. gen time_passed = -1*(LS41)
{txt}(1,172 missing values generated)

{com}. gen transp_cost = -1*(LS42*(0.0099))
{txt}(1,172 missing values generated)

{com}. 
. 
. /* Costs
> Amount spent purchasing goats: LSE12
> Amount spent on feed/fodder : LSE15
> Amount spent on vet care : LSE16
> Amount spent on breeding fees : LSE17a * LSE17b
> Amount spent on shelters : LSE18
> */
. 
. gen goat_costs = LSE12*(0.0099) + LSE15*(0.0099) + LSE16*(0.0099) + (LSE17a*LSE17b)*(0.0099) + LSE18*(0.0099)
{txt}(2,273 missing values generated)

{com}. gen net_goat_income = LS9*(0.0099) - goat_costs
{txt}(2,273 missing values generated)

{com}. gen netincome_goat = net_goat_income / LS8
{txt}(2,361 missing values generated)

{com}. 
. 
. local local_HH_goatsales LS8 LS9 co_opgoatno co_opsalevalue net_goat_income
{txt}
{com}. make_index_gr HH_goatsales wgt stdgroup `local_HH_goatsales' 
{res}  955
{txt}
{com}. 
. local local_salecost visits_sale time_passed transp_cost
{txt}
{com}. make_index_gr salecost wgt stdgroup `local_salecost' 
{res}  956
{txt}
{com}. 
. 
. save "$d3/r_HH_Merged_Ind.dta", replace
{txt}file /Users/scottmiller/Dropbox (UFL)/LSIL/Pre-Analysis Plan/Stata Files/PAP Data/LSIL-DATA_scott/VCC baseline aug 20 2018/r_HH_Merged_Ind.dta saved

{com}. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
{txt}end of do-file

{com}. do "/Users/scottmiller/Documents/GitHub/LSIL_PAP/lsilPAP5_test_other.do"
{txt}
{com}. clear
{txt}
{com}. set more off, perm
{txt}({cmd:set more} preference recorded)

{com}. 
. *log
. cap log close
{smcl}
{com}{sf}{ul off}