{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}/Users/scottmiller/Documents/GitHub/LSIL_PAP/lsilPAP5.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res}15 Jan 2019, 13:56:40
{txt}
{com}. 
. cd "$d2"
{res}/Users/scottmiller/Dropbox (UFL)/LSIL/Pre-Analysis Plan/Stata Files/PAP Data
{txt}
{com}. 
. ** HH level dataset
. ********************************************* 
. clear
{txt}
{com}. use "$d3/r_HH_Merged_Ind.dta"
{txt}
{com}. encode idx, gen(idx_n)
{txt}
{com}. 
. 
. * generate strata variable that excludes 4th strata (due to data error)
. * ------------------------------------------------------
. gen str = . 
{txt}(2,448 missing values generated)

{com}. 
. foreach i in 11 12 21 22 31 32 41 42 51 52 61 62 {c -(}
{txt}  2{com}.         replace str = `i' if strata == `i'1 | strata ==`i'2
{txt}  3{com}. {c )-}
{txt}(144 real changes made)
(168 real changes made)
(216 real changes made)
(192 real changes made)
(168 real changes made)
(288 real changes made)
(192 real changes made)
(216 real changes made)
(192 real changes made)
(240 real changes made)
(192 real changes made)
(240 real changes made)

{com}. * ------------------------------------------------------
. 
. * Communication
. 
. *** Strata dummies - No interaction
. local varlist COM3 COM8 index_HH_comm
{txt}
{com}. foreach v in `varlist' {c -(}
{txt}  2{com}.         
.         reg `v' r_treat i.str, cluster(idx_n)
{txt}  3{com}.         
.         quietly {c -(} 
{txt}  4{com}.                 ereturn list
{txt}  5{com}.                 scalar t_a = invttail(`e(df_r)',0.025) // alpha t-value
{txt}  6{com}.                 scalar t_b = invttail(`e(df_r)',0.2) // beta t-value
{txt}  7{com}.  
.                 scalar mde_`v' = (t_a + t_b)*_se[r_treat]
{txt}  8{com}.                 {c )-} 
{txt}  9{com}. 
.         * Calculate MDE as % of mean & # of standard deviations
.         quietly {c -(}       
{txt} 10{com}.                 sum `v'
{txt} 11{com}.                 scalar mean_`v' = mde_`v' / r(mean) // % of treatment mean
{txt} 12{com}.                 scalar sd_`v' = mde_`v' / r(sd)  // # of treatment sd's
{txt} 13{com}.                 {c )-}
{txt} 14{com}. {c )-} 

{txt}Linear regression                               Number of obs     = {res}     1,261
                                                {txt}F(12, 77)         =  {res}    25.16
                                                {txt}Prob > F          = {res}    0.0000
                                                {txt}R-squared         = {res}    0.0507
                                                {txt}Root MSE          =    {res} 1.7131

{txt}{ralign 78:(Std. Err. adjusted for {res:78} clusters in idx_n)}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}        COM3{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}r_treat {c |}{col 14}{res}{space 2} .2770927{col 26}{space 2}  .147382{col 37}{space 1}    1.88{col 46}{space 3}0.064{col 54}{space 4}-.0163824{col 67}{space 3} .5705679
{txt}{space 12} {c |}
{space 9}str {c |}
{space 9}12  {c |}{col 14}{res}{space 2} 1.157468{col 26}{space 2} .2360771{col 37}{space 1}    4.90{col 46}{space 3}0.000{col 54}{space 4}  .687378{col 67}{space 3} 1.627557
{txt}{space 9}21  {c |}{col 14}{res}{space 2} .5850097{col 26}{space 2} .1858425{col 37}{space 1}    3.15{col 46}{space 3}0.002{col 54}{space 4}   .21495{col 67}{space 3} .9550695
{txt}{space 9}22  {c |}{col 14}{res}{space 2} 1.134671{col 26}{space 2} .3400928{col 37}{space 1}    3.34{col 46}{space 3}0.001{col 54}{space 4} .4574596{col 67}{space 3} 1.811882
{txt}{space 9}31  {c |}{col 14}{res}{space 2}  .970349{col 26}{space 2} .3034255{col 37}{space 1}    3.20{col 46}{space 3}0.002{col 54}{space 4} .3661515{col 67}{space 3} 1.574546
{txt}{space 9}32  {c |}{col 14}{res}{space 2} 1.290046{col 26}{space 2}  .161907{col 37}{space 1}    7.97{col 46}{space 3}0.000{col 54}{space 4} .9676483{col 67}{space 3} 1.612444
{txt}{space 9}41  {c |}{col 14}{res}{space 2} 2.044077{col 26}{space 2} .2490229{col 37}{space 1}    8.21{col 46}{space 3}0.000{col 54}{space 4} 1.548209{col 67}{space 3} 2.539945
{txt}{space 9}42  {c |}{col 14}{res}{space 2} 1.490881{col 26}{space 2} .2358815{col 37}{space 1}    6.32{col 46}{space 3}0.000{col 54}{space 4} 1.021181{col 67}{space 3} 1.960581
{txt}{space 9}51  {c |}{col 14}{res}{space 2} 2.037555{col 26}{space 2}  .315466{col 37}{space 1}    6.46{col 46}{space 3}0.000{col 54}{space 4} 1.409382{col 67}{space 3} 2.665728
{txt}{space 9}52  {c |}{col 14}{res}{space 2} 1.346487{col 26}{space 2}  .175824{col 37}{space 1}    7.66{col 46}{space 3}0.000{col 54}{space 4}  .996377{col 67}{space 3} 1.696598
{txt}{space 9}61  {c |}{col 14}{res}{space 2} 1.587461{col 26}{space 2} .1983318{col 37}{space 1}    8.00{col 46}{space 3}0.000{col 54}{space 4} 1.192531{col 67}{space 3}  1.98239
{txt}{space 9}62  {c |}{col 14}{res}{space 2} .8921369{col 26}{space 2} .3305316{col 37}{space 1}    2.70{col 46}{space 3}0.009{col 54}{space 4} .2339643{col 67}{space 3}  1.55031
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2}-.0692732{col 26}{space 2} .0730379{col 37}{space 1}   -0.95{col 46}{space 3}0.346{col 54}{space 4}-.2147103{col 67}{space 3} .0761639
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}Linear regression                               Number of obs     = {res}     2,149
                                                {txt}F(12, 91)         =  {res}     3.14
                                                {txt}Prob > F          = {res}    0.0009
                                                {txt}R-squared         = {res}    0.0125
                                                {txt}Root MSE          =    {res} 3.4881

{txt}{ralign 78:(Std. Err. adjusted for {res:92} clusters in idx_n)}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}        COM8{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}r_treat {c |}{col 14}{res}{space 2}-.1609313{col 26}{space 2} .2345756{col 37}{space 1}   -0.69{col 46}{space 3}0.494{col 54}{space 4}-.6268869{col 67}{space 3} .3050244
{txt}{space 12} {c |}
{space 9}str {c |}
{space 9}12  {c |}{col 14}{res}{space 2} .4387809{col 26}{space 2} .2482115{col 37}{space 1}    1.77{col 46}{space 3}0.080{col 54}{space 4}-.0542608{col 67}{space 3} .9318226
{txt}{space 9}21  {c |}{col 14}{res}{space 2} .4387687{col 26}{space 2} .5499354{col 37}{space 1}    0.80{col 46}{space 3}0.427{col 54}{space 4}-.6536104{col 67}{space 3} 1.531148
{txt}{space 9}22  {c |}{col 14}{res}{space 2} .1331888{col 26}{space 2} .3546881{col 37}{space 1}    0.38{col 46}{space 3}0.708{col 54}{space 4}-.5713555{col 67}{space 3}  .837733
{txt}{space 9}31  {c |}{col 14}{res}{space 2} .7803366{col 26}{space 2} .8139992{col 37}{space 1}    0.96{col 46}{space 3}0.340{col 54}{space 4}-.8365728{col 67}{space 3} 2.397246
{txt}{space 9}32  {c |}{col 14}{res}{space 2} .6114783{col 26}{space 2} .3539788{col 37}{space 1}    1.73{col 46}{space 3}0.087{col 54}{space 4}-.0916571{col 67}{space 3} 1.314614
{txt}{space 9}41  {c |}{col 14}{res}{space 2} .2699854{col 26}{space 2} .3288003{col 37}{space 1}    0.82{col 46}{space 3}0.414{col 54}{space 4}-.3831359{col 67}{space 3} .9231068
{txt}{space 9}42  {c |}{col 14}{res}{space 2}-.3673299{col 26}{space 2} .1628299{col 37}{space 1}   -2.26{col 46}{space 3}0.026{col 54}{space 4}-.6907716{col 67}{space 3}-.0438882
{txt}{space 9}51  {c |}{col 14}{res}{space 2} .2382009{col 26}{space 2} .3272574{col 37}{space 1}    0.73{col 46}{space 3}0.469{col 54}{space 4}-.4118559{col 67}{space 3} .8882576
{txt}{space 9}52  {c |}{col 14}{res}{space 2}-.5536958{col 26}{space 2} .1784507{col 37}{space 1}   -3.10{col 46}{space 3}0.003{col 54}{space 4}-.9081661{col 67}{space 3}-.1992255
{txt}{space 9}61  {c |}{col 14}{res}{space 2} -.030669{col 26}{space 2}  .267157{col 37}{space 1}   -0.11{col 46}{space 3}0.909{col 54}{space 4}-.5613435{col 67}{space 3} .5000055
{txt}{space 9}62  {c |}{col 14}{res}{space 2}-.1683497{col 26}{space 2} .3456354{col 37}{space 1}   -0.49{col 46}{space 3}0.627{col 54}{space 4}-.8549119{col 67}{space 3} .5182125
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2}  1.02976{col 26}{space 2} .1537855{col 37}{space 1}    6.70{col 46}{space 3}0.000{col 54}{space 4} .7242843{col 67}{space 3} 1.335236
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}Linear regression                               Number of obs     = {res}     1,207
                                                {txt}F(12, 77)         =  {res}    33.61
                                                {txt}Prob > F          = {res}    0.0000
                                                {txt}R-squared         = {res}    0.0385
                                                {txt}Root MSE          =    {res} .99394

{txt}{ralign 78:(Std. Err. adjusted for {res:78} clusters in idx_n)}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}index_HH_c~m{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}r_treat {c |}{col 14}{res}{space 2} .1061608{col 26}{space 2} .1162674{col 37}{space 1}    0.91{col 46}{space 3}0.364{col 54}{space 4}-.1253572{col 67}{space 3} .3376789
{txt}{space 12} {c |}
{space 9}str {c |}
{space 9}12  {c |}{col 14}{res}{space 2} .9227945{col 26}{space 2} .1582646{col 37}{space 1}    5.83{col 46}{space 3}0.000{col 54}{space 4} .6076495{col 67}{space 3} 1.237939
{txt}{space 9}21  {c |}{col 14}{res}{space 2} .4673579{col 26}{space 2}  .166958{col 37}{space 1}    2.80{col 46}{space 3}0.006{col 54}{space 4}  .134902{col 67}{space 3} .7998138
{txt}{space 9}22  {c |}{col 14}{res}{space 2}   .78501{col 26}{space 2}  .221686{col 37}{space 1}    3.54{col 46}{space 3}0.001{col 54}{space 4} .3435767{col 67}{space 3} 1.226443
{txt}{space 9}31  {c |}{col 14}{res}{space 2} .6916676{col 26}{space 2} .2008829{col 37}{space 1}    3.44{col 46}{space 3}0.001{col 54}{space 4} .2916587{col 67}{space 3} 1.091677
{txt}{space 9}32  {c |}{col 14}{res}{space 2} .9539559{col 26}{space 2} .1852865{col 37}{space 1}    5.15{col 46}{space 3}0.000{col 54}{space 4} .5850033{col 67}{space 3} 1.322908
{txt}{space 9}41  {c |}{col 14}{res}{space 2} 1.146864{col 26}{space 2} .1410965{col 37}{space 1}    8.13{col 46}{space 3}0.000{col 54}{space 4} .8659049{col 67}{space 3} 1.427823
{txt}{space 9}42  {c |}{col 14}{res}{space 2} .7533741{col 26}{space 2} .0834641{col 37}{space 1}    9.03{col 46}{space 3}0.000{col 54}{space 4} .5871759{col 67}{space 3} .9195724
{txt}{space 9}51  {c |}{col 14}{res}{space 2} 1.036912{col 26}{space 2}  .216969{col 37}{space 1}    4.78{col 46}{space 3}0.000{col 54}{space 4} .6048717{col 67}{space 3} 1.468952
{txt}{space 9}52  {c |}{col 14}{res}{space 2} .6369251{col 26}{space 2} .0875454{col 37}{space 1}    7.28{col 46}{space 3}0.000{col 54}{space 4} .4625999{col 67}{space 3} .8112503
{txt}{space 9}61  {c |}{col 14}{res}{space 2} .9021231{col 26}{space 2} .1179785{col 37}{space 1}    7.65{col 46}{space 3}0.000{col 54}{space 4} .6671979{col 67}{space 3} 1.137048
{txt}{space 9}62  {c |}{col 14}{res}{space 2} .7947824{col 26}{space 2}  .240342{col 37}{space 1}    3.31{col 46}{space 3}0.001{col 54}{space 4} .3162004{col 67}{space 3} 1.273364
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2}-.5882903{col 26}{space 2} .0377963{col 37}{space 1}  -15.56{col 46}{space 3}0.000{col 54}{space 4}-.6635523{col 67}{space 3}-.5130283
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. quietly {c -(}
{txt}
{com}. 
. * Strata table
. frmttable using MDE_3.doc, statmat(A) sdec(4) title("Communication") ///
> ctitle("","MDE","% of mean","# of sd's.") ///
> rtitle("HH info sales"\"HH info activities"\"HH level index") replace
{res}
{txt}{center:Communication}
{txt}{center:{hline 53}}
{center:{txt}{lalign 20:}{txt}{center 8:MDE}{txt}{center 11:% of mean}{txt}{center 12:# of sd's.}}
{txt}{center:{hline 53}}
{center:{txt}{lalign 20:HH info sales}{res}{center 8:0.4182}{res}{center 11:0.3054}{res}{center 12:0.2390}}
{center:{txt}{lalign 20:HH info activities}{res}{center 8:0.6643}{res}{center 11:0.6049}{res}{center 12:0.1898}}
{center:{txt}{lalign 20:HH level index}{res}{center 8:0.3299}{res}{center 11:}{res}{center 12:0.3271}}
{txt}{center:{hline 53}}


{com}. 
. 
. * Goat Sales
. 
. ** HH vars
. gl hh_goatsales LS8 LS9_w co_opgoatno co_opsalevalue ///
>                                 net_goat_income index_HH_goatsales ///
>                                 visits_sale time_passed transp_cost index_salecost ///
> 
{txt}
{com}. 
. 
. ** HH vars
. local listsize : list sizeof global(hh_goatsales)
{txt}
{com}. tokenize $hh_goatsales
{txt}
{com}. 
. forv i = 1/`listsize' {c -(}
{txt}  2{com}. 
.         reg ``i'' r_treat i.str, cluster(idx)
{txt}  3{com}.         
.         quietly {c -(}
{txt}  4{com}.                 ereturn list
{txt}  5{com}.                 scalar t_a = invttail(`e(df_r)',0.025) // alpha t-value
{txt}  6{com}.                 scalar t_b = invttail(`e(df_r)',0.2) // beta t-value
{txt}  7{com}.                 scalar mde_``i'' = (t_a + t_b)*_se[r_treat]
{txt}  8{com}.                 
.         * Calculate MDE as % of mean & # of standard deviations
.                 sum ``i''
{txt}  9{com}.                 scalar mean_``i'' = mde_``i'' / r(mean) // % of treatment mean
{txt} 10{com}.                 scalar sd_``i'' = mde_``i'' / r(sd)  // # of treatment sd's
{txt} 11{com}. 
.         * matrix for table
.                 matrix mat_`i' = (mde_``i'',mean_``i'',sd_``i'')
{txt} 12{com}.                 {c )-}
{txt} 13{com}. {c )-}

{txt}Linear regression                               Number of obs     = {res}     2,448
                                                {txt}F(12, 91)         =  {res}     3.24
                                                {txt}Prob > F          = {res}    0.0007
                                                {txt}R-squared         = {res}    0.0308
                                                {txt}Root MSE          =    {res} 1.8496

{txt}{ralign 78:(Std. Err. adjusted for {res:92} clusters in idx)}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}         LS8{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}r_treat {c |}{col 14}{res}{space 2}-.0490054{col 26}{space 2} .1110643{col 37}{space 1}   -0.44{col 46}{space 3}0.660{col 54}{space 4} -.269621{col 67}{space 3} .1716101
{txt}{space 12} {c |}
{space 9}str {c |}
{space 9}12  {c |}{col 14}{res}{space 2} .0402067{col 26}{space 2} .1346077{col 37}{space 1}    0.30{col 46}{space 3}0.766{col 54}{space 4} -.227175{col 67}{space 3} .3075884
{txt}{space 9}21  {c |}{col 14}{res}{space 2} .3043324{col 26}{space 2} .1379493{col 37}{space 1}    2.21{col 46}{space 3}0.030{col 54}{space 4} .0303132{col 67}{space 3} .5783517
{txt}{space 9}22  {c |}{col 14}{res}{space 2} .1579861{col 26}{space 2} .1293936{col 37}{space 1}    1.22{col 46}{space 3}0.225{col 54}{space 4}-.0990385{col 67}{space 3} .4150107
{txt}{space 9}31  {c |}{col 14}{res}{space 2} .6424456{col 26}{space 2} .3286583{col 37}{space 1}    1.95{col 46}{space 3}0.054{col 54}{space 4}-.0103937{col 67}{space 3} 1.295285
{txt}{space 9}32  {c |}{col 14}{res}{space 2} 1.147056{col 26}{space 2} .3421057{col 37}{space 1}    3.35{col 46}{space 3}0.001{col 54}{space 4} .4675055{col 67}{space 3} 1.826607
{txt}{space 9}41  {c |}{col 14}{res}{space 2} .2725694{col 26}{space 2} .1279319{col 37}{space 1}    2.13{col 46}{space 3}0.036{col 54}{space 4} .0184484{col 67}{space 3} .5266905
{txt}{space 9}42  {c |}{col 14}{res}{space 2} .3005182{col 26}{space 2} .1660517{col 37}{space 1}    1.81{col 46}{space 3}0.074{col 54}{space 4}-.0293231{col 67}{space 3} .6303595
{txt}{space 9}51  {c |}{col 14}{res}{space 2} .6111111{col 26}{space 2} .2362754{col 37}{space 1}    2.59{col 46}{space 3}0.011{col 54}{space 4} .1417791{col 67}{space 3} 1.080443
{txt}{space 9}52  {c |}{col 14}{res}{space 2} .3986111{col 26}{space 2}  .166924{col 37}{space 1}    2.39{col 46}{space 3}0.019{col 54}{space 4} .0670371{col 67}{space 3} .7301851
{txt}{space 9}61  {c |}{col 14}{res}{space 2} .7361111{col 26}{space 2}  .210707{col 37}{space 1}    3.49{col 46}{space 3}0.001{col 54}{space 4} .3175675{col 67}{space 3} 1.154655
{txt}{space 9}62  {c |}{col 14}{res}{space 2} .6826783{col 26}{space 2} .2135672{col 37}{space 1}    3.20{col 46}{space 3}0.002{col 54}{space 4} .2584532{col 67}{space 3} 1.106903
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} .6842249{col 26}{space 2} .1116484{col 37}{space 1}    6.13{col 46}{space 3}0.000{col 54}{space 4} .4624491{col 67}{space 3} .9060008
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}Linear regression                               Number of obs     = {res}     2,448
                                                {txt}F(12, 91)         =  {res}     3.63
                                                {txt}Prob > F          = {res}    0.0002
                                                {txt}R-squared         = {res}    0.0402
                                                {txt}Root MSE          =    {res} 149.57

{txt}{ralign 78:(Std. Err. adjusted for {res:92} clusters in idx)}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}       LS9_w{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}r_treat {c |}{col 14}{res}{space 2}-2.654285{col 26}{space 2} 8.941689{col 37}{space 1}   -0.30{col 46}{space 3}0.767{col 54}{space 4}-20.41585{col 67}{space 3} 15.10728
{txt}{space 12} {c |}
{space 9}str {c |}
{space 9}12  {c |}{col 14}{res}{space 2}-2.551648{col 26}{space 2} 13.19479{col 37}{space 1}   -0.19{col 46}{space 3}0.847{col 54}{space 4}-28.76147{col 67}{space 3} 23.65818
{txt}{space 9}21  {c |}{col 14}{res}{space 2} 40.29085{col 26}{space 2}  16.0052{col 37}{space 1}    2.52{col 46}{space 3}0.014{col 54}{space 4} 8.498492{col 67}{space 3} 72.08321
{txt}{space 9}22  {c |}{col 14}{res}{space 2} 14.22071{col 26}{space 2} 12.34515{col 37}{space 1}    1.15{col 46}{space 3}0.252{col 54}{space 4}-10.30142{col 67}{space 3} 38.74283
{txt}{space 9}31  {c |}{col 14}{res}{space 2} 53.75004{col 26}{space 2} 20.80635{col 37}{space 1}    2.58{col 46}{space 3}0.011{col 54}{space 4} 12.42079{col 67}{space 3}  95.0793
{txt}{space 9}32  {c |}{col 14}{res}{space 2} 102.7589{col 26}{space 2} 28.53731{col 37}{space 1}    3.60{col 46}{space 3}0.001{col 54}{space 4} 46.07302{col 67}{space 3} 159.4447
{txt}{space 9}41  {c |}{col 14}{res}{space 2} 11.71583{col 26}{space 2} 12.29419{col 37}{space 1}    0.95{col 46}{space 3}0.343{col 54}{space 4}-12.70508{col 67}{space 3} 36.13673
{txt}{space 9}42  {c |}{col 14}{res}{space 2}  10.2623{col 26}{space 2} 13.08468{col 37}{space 1}    0.78{col 46}{space 3}0.435{col 54}{space 4}-15.72882{col 67}{space 3} 36.25341
{txt}{space 9}51  {c |}{col 14}{res}{space 2}  44.7333{col 26}{space 2}  19.9219{col 37}{space 1}    2.25{col 46}{space 3}0.027{col 54}{space 4} 5.160899{col 67}{space 3} 84.30571
{txt}{space 9}52  {c |}{col 14}{res}{space 2} 31.53686{col 26}{space 2} 13.97217{col 37}{space 1}    2.26{col 46}{space 3}0.026{col 54}{space 4} 3.782861{col 67}{space 3} 59.29086
{txt}{space 9}61  {c |}{col 14}{res}{space 2} 51.07781{col 26}{space 2} 18.81376{col 37}{space 1}    2.71{col 46}{space 3}0.008{col 54}{space 4}  13.7066{col 67}{space 3} 88.44903
{txt}{space 9}62  {c |}{col 14}{res}{space 2} 58.67563{col 26}{space 2} 19.61304{col 37}{space 1}    2.99{col 46}{space 3}0.004{col 54}{space 4} 19.71673{col 67}{space 3} 97.63454
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} 56.71558{col 26}{space 2} 11.37897{col 37}{space 1}    4.98{col 46}{space 3}0.000{col 54}{space 4} 34.11266{col 67}{space 3}  79.3185
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}Linear regression                               Number of obs     = {res}     2,448
                                                {txt}F(12, 91)         =  {res}     5.97
                                                {txt}Prob > F          = {res}    0.0000
                                                {txt}R-squared         = {res}    0.0248
                                                {txt}Root MSE          =    {res} .92033

{txt}{ralign 78:(Std. Err. adjusted for {res:92} clusters in idx)}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1} co_opgoatno{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}r_treat {c |}{col 14}{res}{space 2} .0324546{col 26}{space 2} .0701285{col 37}{space 1}    0.46{col 46}{space 3}0.645{col 54}{space 4}-.1068471{col 67}{space 3} .1717563
{txt}{space 12} {c |}
{space 9}str {c |}
{space 9}12  {c |}{col 14}{res}{space 2} .1048247{col 26}{space 2} .0479658{col 37}{space 1}    2.19{col 46}{space 3}0.031{col 54}{space 4} .0095464{col 67}{space 3} .2001029
{txt}{space 9}21  {c |}{col 14}{res}{space 2} .0609647{col 26}{space 2} .0256261{col 37}{space 1}    2.38{col 46}{space 3}0.019{col 54}{space 4} .0100616{col 67}{space 3} .1118677
{txt}{space 9}22  {c |}{col 14}{res}{space 2} .1354167{col 26}{space 2} .0594222{col 37}{space 1}    2.28{col 46}{space 3}0.025{col 54}{space 4} .0173818{col 67}{space 3} .2534515
{txt}{space 9}31  {c |}{col 14}{res}{space 2} .2966169{col 26}{space 2} .1232259{col 37}{space 1}    2.41{col 46}{space 3}0.018{col 54}{space 4} .0518437{col 67}{space 3}   .54139
{txt}{space 9}32  {c |}{col 14}{res}{space 2} .3383409{col 26}{space 2} .1217446{col 37}{space 1}    2.78{col 46}{space 3}0.007{col 54}{space 4} .0965102{col 67}{space 3} .5801716
{txt}{space 9}41  {c |}{col 14}{res}{space 2}  .296875{col 26}{space 2} .1050865{col 37}{space 1}    2.83{col 46}{space 3}0.006{col 54}{space 4} .0881335{col 67}{space 3} .5056165
{txt}{space 9}42  {c |}{col 14}{res}{space 2} .1638401{col 26}{space 2} .0489674{col 37}{space 1}    3.35{col 46}{space 3}0.001{col 54}{space 4} .0665723{col 67}{space 3} .2611078
{txt}{space 9}51  {c |}{col 14}{res}{space 2} .3802083{col 26}{space 2} .2206779{col 37}{space 1}    1.72{col 46}{space 3}0.088{col 54}{space 4}-.0581412{col 67}{space 3} .8185579
{txt}{space 9}52  {c |}{col 14}{res}{space 2} .1416667{col 26}{space 2} .0380618{col 37}{space 1}    3.72{col 46}{space 3}0.000{col 54}{space 4} .0660616{col 67}{space 3} .2172717
{txt}{space 9}61  {c |}{col 14}{res}{space 2} .4322917{col 26}{space 2} .1441023{col 37}{space 1}    3.00{col 46}{space 3}0.003{col 54}{space 4} .1460501{col 67}{space 3} .7185332
{txt}{space 9}62  {c |}{col 14}{res}{space 2} .4634212{col 26}{space 2} .2354893{col 37}{space 1}    1.97{col 46}{space 3}0.052{col 54}{space 4}-.0043494{col 67}{space 3} .9311918
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2}-.0162273{col 26}{space 2} .0356944{col 37}{space 1}   -0.45{col 46}{space 3}0.650{col 54}{space 4}-.0871299{col 67}{space 3} .0546753
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}Linear regression                               Number of obs     = {res}     2,448
                                                {txt}F(12, 91)         =  {res}     6.21
                                                {txt}Prob > F          = {res}    0.0000
                                                {txt}R-squared         = {res}    0.0210
                                                {txt}Root MSE          =    {res} 84.071

{txt}{ralign 78:(Std. Err. adjusted for {res:92} clusters in idx)}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}co_opsalev~e{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}r_treat {c |}{col 14}{res}{space 2} 1.461506{col 26}{space 2} 6.119639{col 37}{space 1}    0.24{col 46}{space 3}0.812{col 54}{space 4} -10.6944{col 67}{space 3} 13.61742
{txt}{space 12} {c |}
{space 9}str {c |}
{space 9}12  {c |}{col 14}{res}{space 2} 9.748817{col 26}{space 2} 4.612633{col 37}{space 1}    2.11{col 46}{space 3}0.037{col 54}{space 4} .5863895{col 67}{space 3} 18.91125
{txt}{space 9}21  {c |}{col 14}{res}{space 2} 6.706084{col 26}{space 2} 2.946195{col 37}{space 1}    2.28{col 46}{space 3}0.025{col 54}{space 4} .8538291{col 67}{space 3} 12.55834
{txt}{space 9}22  {c |}{col 14}{res}{space 2}  13.8171{col 26}{space 2}  5.88621{col 37}{space 1}    2.35{col 46}{space 3}0.021{col 54}{space 4} 2.124868{col 67}{space 3} 25.50933
{txt}{space 9}31  {c |}{col 14}{res}{space 2} 26.04528{col 26}{space 2} 13.88092{col 37}{space 1}    1.88{col 46}{space 3}0.064{col 54}{space 4} -1.52746{col 67}{space 3} 53.61801
{txt}{space 9}32  {c |}{col 14}{res}{space 2} 35.17676{col 26}{space 2} 11.80165{col 37}{space 1}    2.98{col 46}{space 3}0.004{col 54}{space 4} 11.73423{col 67}{space 3} 58.61928
{txt}{space 9}41  {c |}{col 14}{res}{space 2} 23.36379{col 26}{space 2} 9.017722{col 37}{space 1}    2.59{col 46}{space 3}0.011{col 54}{space 4} 5.451196{col 67}{space 3} 41.27639
{txt}{space 9}42  {c |}{col 14}{res}{space 2} 15.88201{col 26}{space 2} 4.819417{col 37}{space 1}    3.30{col 46}{space 3}0.001{col 54}{space 4} 6.308827{col 67}{space 3} 25.45519
{txt}{space 9}51  {c |}{col 14}{res}{space 2} 35.88621{col 26}{space 2} 20.40462{col 37}{space 1}    1.76{col 46}{space 3}0.082{col 54}{space 4}-4.645056{col 67}{space 3} 76.41748
{txt}{space 9}52  {c |}{col 14}{res}{space 2} 13.99117{col 26}{space 2} 3.708489{col 37}{space 1}    3.77{col 46}{space 3}0.000{col 54}{space 4} 6.624716{col 67}{space 3} 21.35763
{txt}{space 9}61  {c |}{col 14}{res}{space 2} 39.61547{col 26}{space 2}  13.6834{col 37}{space 1}    2.90{col 46}{space 3}0.005{col 54}{space 4} 12.43507{col 67}{space 3} 66.79587
{txt}{space 9}62  {c |}{col 14}{res}{space 2} 33.67699{col 26}{space 2} 17.26276{col 37}{space 1}    1.95{col 46}{space 3}0.054{col 54}{space 4}-.6133688{col 67}{space 3} 67.96736
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2}-.7307531{col 26}{space 2} 3.074559{col 37}{space 1}   -0.24{col 46}{space 3}0.813{col 54}{space 4}-6.837988{col 67}{space 3} 5.376482
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}Linear regression                               Number of obs     = {res}     2,448
                                                {txt}F(12, 91)         =  {res}     2.52
                                                {txt}Prob > F          = {res}    0.0066
                                                {txt}R-squared         = {res}    0.0050
                                                {txt}Root MSE          =    {res} 296.06

{txt}{ralign 78:(Std. Err. adjusted for {res:92} clusters in idx)}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}net_goat_i~e{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}r_treat {c |}{col 14}{res}{space 2} -16.0448{col 26}{space 2}  14.4395{col 37}{space 1}   -1.11{col 46}{space 3}0.269{col 54}{space 4}-44.72709{col 67}{space 3} 12.63748
{txt}{space 12} {c |}
{space 9}str {c |}
{space 9}12  {c |}{col 14}{res}{space 2} 1.553598{col 26}{space 2} 11.74028{col 37}{space 1}    0.13{col 46}{space 3}0.895{col 54}{space 4}-21.76703{col 67}{space 3} 24.87422
{txt}{space 9}21  {c |}{col 14}{res}{space 2}  39.4217{col 26}{space 2} 13.29567{col 37}{space 1}    2.97{col 46}{space 3}0.004{col 54}{space 4} 13.01148{col 67}{space 3} 65.83191
{txt}{space 9}22  {c |}{col 14}{res}{space 2} 19.00141{col 26}{space 2} 9.348277{col 37}{space 1}    2.03{col 46}{space 3}0.045{col 54}{space 4} .4322048{col 67}{space 3} 37.57061
{txt}{space 9}31  {c |}{col 14}{res}{space 2} 55.78577{col 26}{space 2} 21.13892{col 37}{space 1}    2.64{col 46}{space 3}0.010{col 54}{space 4}  13.7959{col 67}{space 3} 97.77563
{txt}{space 9}32  {c |}{col 14}{res}{space 2} 42.73713{col 26}{space 2} 55.12408{col 37}{space 1}    0.78{col 46}{space 3}0.440{col 54}{space 4}-66.76008{col 67}{space 3} 152.2343
{txt}{space 9}41  {c |}{col 14}{res}{space 2} 24.95799{col 26}{space 2} 10.01846{col 37}{space 1}    2.49{col 46}{space 3}0.015{col 54}{space 4} 5.057537{col 67}{space 3} 44.85844
{txt}{space 9}42  {c |}{col 14}{res}{space 2} 12.93056{col 26}{space 2} 9.417772{col 37}{space 1}    1.37{col 46}{space 3}0.173{col 54}{space 4}-5.776689{col 67}{space 3}  31.6378
{txt}{space 9}51  {c |}{col 14}{res}{space 2} 1.039998{col 26}{space 2} 44.82389{col 37}{space 1}    0.02{col 46}{space 3}0.982{col 54}{space 4}-87.99716{col 67}{space 3} 90.07716
{txt}{space 9}52  {c |}{col 14}{res}{space 2} 29.88077{col 26}{space 2} 12.99089{col 37}{space 1}    2.30{col 46}{space 3}0.024{col 54}{space 4} 4.075957{col 67}{space 3} 55.68559
{txt}{space 9}61  {c |}{col 14}{res}{space 2} 43.48192{col 26}{space 2} 14.93592{col 37}{space 1}    2.91{col 46}{space 3}0.005{col 54}{space 4} 13.81354{col 67}{space 3} 73.15029
{txt}{space 9}62  {c |}{col 14}{res}{space 2} 61.44166{col 26}{space 2} 21.56215{col 37}{space 1}    2.85{col 46}{space 3}0.005{col 54}{space 4} 18.61109{col 67}{space 3} 104.2722
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} 30.08957{col 26}{space 2} 9.791861{col 37}{space 1}    3.07{col 46}{space 3}0.003{col 54}{space 4} 10.63924{col 67}{space 3}  49.5399
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}Linear regression                               Number of obs     = {res}     2,448
                                                {txt}F(12, 91)         =  {res}     3.70
                                                {txt}Prob > F          = {res}    0.0001
                                                {txt}R-squared         = {res}    0.0196
                                                {txt}Root MSE          =    {res} .84571

{txt}{ralign 78:(Std. Err. adjusted for {res:92} clusters in idx)}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}index_HH_g~s{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}r_treat {c |}{col 14}{res}{space 2}-.0148343{col 26}{space 2} .0549855{col 37}{space 1}   -0.27{col 46}{space 3}0.788{col 54}{space 4}-.1240563{col 67}{space 3} .0943877
{txt}{space 12} {c |}
{space 9}str {c |}
{space 9}12  {c |}{col 14}{res}{space 2} .0422313{col 26}{space 2} .0388547{col 37}{space 1}    1.09{col 46}{space 3}0.280{col 54}{space 4}-.0349489{col 67}{space 3} .1194115
{txt}{space 9}21  {c |}{col 14}{res}{space 2} .1503165{col 26}{space 2}  .047854{col 37}{space 1}    3.14{col 46}{space 3}0.002{col 54}{space 4} .0552604{col 67}{space 3} .2453727
{txt}{space 9}22  {c |}{col 14}{res}{space 2} .1073284{col 26}{space 2} .0461634{col 37}{space 1}    2.32{col 46}{space 3}0.022{col 54}{space 4} .0156304{col 67}{space 3} .1990263
{txt}{space 9}31  {c |}{col 14}{res}{space 2} .2977966{col 26}{space 2}  .103642{col 37}{space 1}    2.87{col 46}{space 3}0.005{col 54}{space 4} .0919246{col 67}{space 3} .5036687
{txt}{space 9}32  {c |}{col 14}{res}{space 2} .3406787{col 26}{space 2} .1739426{col 37}{space 1}    1.96{col 46}{space 3}0.053{col 54}{space 4}-.0048369{col 67}{space 3} .6861943
{txt}{space 9}41  {c |}{col 14}{res}{space 2} .1925781{col 26}{space 2} .0630375{col 37}{space 1}    3.05{col 46}{space 3}0.003{col 54}{space 4} .0673619{col 67}{space 3} .3177943
{txt}{space 9}42  {c |}{col 14}{res}{space 2} .0990825{col 26}{space 2} .0433023{col 37}{space 1}    2.29{col 46}{space 3}0.024{col 54}{space 4} .0130678{col 67}{space 3} .1850971
{txt}{space 9}51  {c |}{col 14}{res}{space 2} .2141242{col 26}{space 2} .1607925{col 37}{space 1}    1.33{col 46}{space 3}0.186{col 54}{space 4}-.1052704{col 67}{space 3} .5335188
{txt}{space 9}52  {c |}{col 14}{res}{space 2} .1509704{col 26}{space 2} .0475227{col 37}{space 1}    3.18{col 46}{space 3}0.002{col 54}{space 4} .0565723{col 67}{space 3} .2453685
{txt}{space 9}61  {c |}{col 14}{res}{space 2} .3234972{col 26}{space 2}  .086128{col 37}{space 1}    3.76{col 46}{space 3}0.000{col 54}{space 4} .1524145{col 67}{space 3} .4945798
{txt}{space 9}62  {c |}{col 14}{res}{space 2} .4043693{col 26}{space 2} .1477316{col 37}{space 1}    2.74{col 46}{space 3}0.007{col 54}{space 4} .1109187{col 67}{space 3}   .69782
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2}-.2029767{col 26}{space 2} .0391268{col 37}{space 1}   -5.19{col 46}{space 3}0.000{col 54}{space 4}-.2806974{col 67}{space 3}-.1252561
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}Linear regression                               Number of obs     = {res}     1,276
                                                {txt}F(12, 91)         =  {res}     4.02
                                                {txt}Prob > F          = {res}    0.0001
                                                {txt}R-squared         = {res}    0.0576
                                                {txt}Root MSE          =    {res} .59955

{txt}{ralign 78:(Std. Err. adjusted for {res:92} clusters in idx)}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1} visits_sale{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}r_treat {c |}{col 14}{res}{space 2}-.0214082{col 26}{space 2} .0532431{col 37}{space 1}   -0.40{col 46}{space 3}0.689{col 54}{space 4}-.1271691{col 67}{space 3} .0843527
{txt}{space 12} {c |}
{space 9}str {c |}
{space 9}12  {c |}{col 14}{res}{space 2} .2201444{col 26}{space 2} .1689814{col 37}{space 1}    1.30{col 46}{space 3}0.196{col 54}{space 4}-.1155164{col 67}{space 3} .5558053
{txt}{space 9}21  {c |}{col 14}{res}{space 2} .2413819{col 26}{space 2} .1589915{col 37}{space 1}    1.52{col 46}{space 3}0.132{col 54}{space 4}-.0744352{col 67}{space 3}  .557199
{txt}{space 9}22  {c |}{col 14}{res}{space 2} .2910359{col 26}{space 2} .1452137{col 37}{space 1}    2.00{col 46}{space 3}0.048{col 54}{space 4} .0025867{col 67}{space 3} .5794852
{txt}{space 9}31  {c |}{col 14}{res}{space 2} .3784571{col 26}{space 2}  .180028{col 37}{space 1}    2.10{col 46}{space 3}0.038{col 54}{space 4} .0208537{col 67}{space 3} .7360606
{txt}{space 9}32  {c |}{col 14}{res}{space 2} .3789597{col 26}{space 2} .1766231{col 37}{space 1}    2.15{col 46}{space 3}0.035{col 54}{space 4} .0281196{col 67}{space 3} .7297999
{txt}{space 9}41  {c |}{col 14}{res}{space 2} .5497016{col 26}{space 2} .1468327{col 37}{space 1}    3.74{col 46}{space 3}0.000{col 54}{space 4} .2580365{col 67}{space 3} .8413668
{txt}{space 9}42  {c |}{col 14}{res}{space 2} .2918947{col 26}{space 2} .1736635{col 37}{space 1}    1.68{col 46}{space 3}0.096{col 54}{space 4}-.0530665{col 67}{space 3} .6368559
{txt}{space 9}51  {c |}{col 14}{res}{space 2} .5433419{col 26}{space 2} .1464692{col 37}{space 1}    3.71{col 46}{space 3}0.000{col 54}{space 4} .2523989{col 67}{space 3} .8342849
{txt}{space 9}52  {c |}{col 14}{res}{space 2}  .363799{col 26}{space 2} .1461663{col 37}{space 1}    2.49{col 46}{space 3}0.015{col 54}{space 4} .0734575{col 67}{space 3} .6541405
{txt}{space 9}61  {c |}{col 14}{res}{space 2} .5637556{col 26}{space 2} .1514867{col 37}{space 1}    3.72{col 46}{space 3}0.000{col 54}{space 4} .2628459{col 67}{space 3} .8646653
{txt}{space 9}62  {c |}{col 14}{res}{space 2}  .550888{col 26}{space 2} .1457867{col 37}{space 1}    3.78{col 46}{space 3}0.000{col 54}{space 4} .2613007{col 67}{space 3} .8404754
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2}-.6712533{col 26}{space 2} .1325389{col 37}{space 1}   -5.06{col 46}{space 3}0.000{col 54}{space 4}-.9345256{col 67}{space 3}-.4079809
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}Linear regression                               Number of obs     = {res}     1,276
                                                {txt}F(12, 91)         =  {res}     3.15
                                                {txt}Prob > F          = {res}    0.0009
                                                {txt}R-squared         = {res}    0.0310
                                                {txt}Root MSE          =    {res} 2.1406

{txt}{ralign 78:(Std. Err. adjusted for {res:92} clusters in idx)}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1} time_passed{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}r_treat {c |}{col 14}{res}{space 2} -.033793{col 26}{space 2} .1531638{col 37}{space 1}   -0.22{col 46}{space 3}0.826{col 54}{space 4}-.3380342{col 67}{space 3} .2704481
{txt}{space 12} {c |}
{space 9}str {c |}
{space 9}12  {c |}{col 14}{res}{space 2} .2085942{col 26}{space 2} .3197046{col 37}{space 1}    0.65{col 46}{space 3}0.516{col 54}{space 4}-.4264597{col 67}{space 3}  .843648
{txt}{space 9}21  {c |}{col 14}{res}{space 2}-.0016359{col 26}{space 2} .4820147{col 37}{space 1}   -0.00{col 46}{space 3}0.997{col 54}{space 4}-.9590988{col 67}{space 3} .9558271
{txt}{space 9}22  {c |}{col 14}{res}{space 2} .4266038{col 26}{space 2} .3110534{col 37}{space 1}    1.37{col 46}{space 3}0.174{col 54}{space 4}-.1912656{col 67}{space 3} 1.044473
{txt}{space 9}31  {c |}{col 14}{res}{space 2} .3415954{col 26}{space 2} .3701934{col 37}{space 1}    0.92{col 46}{space 3}0.359{col 54}{space 4}-.3937483{col 67}{space 3} 1.076939
{txt}{space 9}32  {c |}{col 14}{res}{space 2} .2943799{col 26}{space 2}   .36223{col 37}{space 1}    0.81{col 46}{space 3}0.419{col 54}{space 4}-.4251455{col 67}{space 3} 1.013905
{txt}{space 9}41  {c |}{col 14}{res}{space 2} .3523781{col 26}{space 2}  .379263{col 37}{space 1}    0.93{col 46}{space 3}0.355{col 54}{space 4}-.4009812{col 67}{space 3} 1.105737
{txt}{space 9}42  {c |}{col 14}{res}{space 2} -.598277{col 26}{space 2}  .542644{col 37}{space 1}   -1.10{col 46}{space 3}0.273{col 54}{space 4}-1.676173{col 67}{space 3} .4796187
{txt}{space 9}51  {c |}{col 14}{res}{space 2} .5233099{col 26}{space 2} .3272889{col 37}{space 1}    1.60{col 46}{space 3}0.113{col 54}{space 4}-.1268093{col 67}{space 3} 1.173429
{txt}{space 9}52  {c |}{col 14}{res}{space 2}-.2715659{col 26}{space 2} .4232883{col 37}{space 1}   -0.64{col 46}{space 3}0.523{col 54}{space 4}-1.112376{col 67}{space 3} .5692444
{txt}{space 9}61  {c |}{col 14}{res}{space 2} .5332976{col 26}{space 2} .3135699{col 37}{space 1}    1.70{col 46}{space 3}0.092{col 54}{space 4}-.0895704{col 67}{space 3} 1.156166
{txt}{space 9}62  {c |}{col 14}{res}{space 2} .8034504{col 26}{space 2} .3008342{col 37}{space 1}    2.67{col 46}{space 3}0.009{col 54}{space 4} .2058801{col 67}{space 3} 1.401021
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2}-.9870027{col 26}{space 2} .2795273{col 37}{space 1}   -3.53{col 46}{space 3}0.001{col 54}{space 4}-1.542249{col 67}{space 3}-.4317561
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}Linear regression                               Number of obs     = {res}     1,276
                                                {txt}F(12, 91)         =  {res}     0.40
                                                {txt}Prob > F          = {res}    0.9590
                                                {txt}R-squared         = {res}    0.0063
                                                {txt}Root MSE          =    {res} 6.9514

{txt}{ralign 78:(Std. Err. adjusted for {res:92} clusters in idx)}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1} transp_cost{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}r_treat {c |}{col 14}{res}{space 2}-.2608459{col 26}{space 2} .1961064{col 37}{space 1}   -1.33{col 46}{space 3}0.187{col 54}{space 4}-.6503871{col 67}{space 3} .1286953
{txt}{space 12} {c |}
{space 9}str {c |}
{space 9}12  {c |}{col 14}{res}{space 2} .0229457{col 26}{space 2} .0768308{col 37}{space 1}    0.30{col 46}{space 3}0.766{col 54}{space 4}-.1296693{col 67}{space 3} .1755607
{txt}{space 9}21  {c |}{col 14}{res}{space 2}-.0126272{col 26}{space 2} .0746639{col 37}{space 1}   -0.17{col 46}{space 3}0.866{col 54}{space 4}-.1609378{col 67}{space 3} .1356835
{txt}{space 9}22  {c |}{col 14}{res}{space 2} .0379544{col 26}{space 2} .0770463{col 37}{space 1}    0.49{col 46}{space 3}0.623{col 54}{space 4}-.1150886{col 67}{space 3} .1909974
{txt}{space 9}31  {c |}{col 14}{res}{space 2} .0858807{col 26}{space 2} .0979692{col 37}{space 1}    0.88{col 46}{space 3}0.383{col 54}{space 4}-.1087232{col 67}{space 3} .2804845
{txt}{space 9}32  {c |}{col 14}{res}{space 2}-1.539228{col 26}{space 2} .9343414{col 37}{space 1}   -1.65{col 46}{space 3}0.103{col 54}{space 4}-3.395182{col 67}{space 3} .3167263
{txt}{space 9}41  {c |}{col 14}{res}{space 2}  .023062{col 26}{space 2} .0762299{col 37}{space 1}    0.30{col 46}{space 3}0.763{col 54}{space 4}-.1283594{col 67}{space 3} .1744834
{txt}{space 9}42  {c |}{col 14}{res}{space 2}-.0388519{col 26}{space 2} .0635065{col 37}{space 1}   -0.61{col 46}{space 3}0.542{col 54}{space 4}-.1649997{col 67}{space 3} .0872959
{txt}{space 9}51  {c |}{col 14}{res}{space 2} .0350829{col 26}{space 2} .0795206{col 37}{space 1}    0.44{col 46}{space 3}0.660{col 54}{space 4}-.1228749{col 67}{space 3} .1930407
{txt}{space 9}52  {c |}{col 14}{res}{space 2} .0443455{col 26}{space 2} .0777148{col 37}{space 1}    0.57{col 46}{space 3}0.570{col 54}{space 4}-.1100254{col 67}{space 3} .1987163
{txt}{space 9}61  {c |}{col 14}{res}{space 2}-.1631037{col 26}{space 2} .1438505{col 37}{space 1}   -1.13{col 46}{space 3}0.260{col 54}{space 4}-.4488451{col 67}{space 3} .1226377
{txt}{space 9}62  {c |}{col 14}{res}{space 2} .0559993{col 26}{space 2} .0880407{col 37}{space 1}    0.64{col 46}{space 3}0.526{col 54}{space 4}-.1188828{col 67}{space 3} .2308813
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} .1003253{col 26}{space 2} .0916948{col 37}{space 1}    1.09{col 46}{space 3}0.277{col 54}{space 4}-.0818151{col 67}{space 3} .2824657
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}Linear regression                               Number of obs     = {res}     1,276
                                                {txt}F(12, 91)         =  {res}     3.59
                                                {txt}Prob > F          = {res}    0.0002
                                                {txt}R-squared         = {res}    0.0226
                                                {txt}Root MSE          =    {res} .81489

{txt}{ralign 78:(Std. Err. adjusted for {res:92} clusters in idx)}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}index_sale~t{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}r_treat {c |}{col 14}{res}{space 2}-.0403676{col 26}{space 2} .0486547{col 37}{space 1}   -0.83{col 46}{space 3}0.409{col 54}{space 4}-.1370141{col 67}{space 3}  .056279
{txt}{space 12} {c |}
{space 9}str {c |}
{space 9}12  {c |}{col 14}{res}{space 2} .1516769{col 26}{space 2} .1299611{col 37}{space 1}    1.17{col 46}{space 3}0.246{col 54}{space 4}-.1064747{col 67}{space 3} .4098286
{txt}{space 9}21  {c |}{col 14}{res}{space 2} .1382997{col 26}{space 2} .1366451{col 37}{space 1}    1.01{col 46}{space 3}0.314{col 54}{space 4}-.1331291{col 67}{space 3} .4097285
{txt}{space 9}22  {c |}{col 14}{res}{space 2} .2172602{col 26}{space 2} .1160054{col 37}{space 1}    1.87{col 46}{space 3}0.064{col 54}{space 4}-.0131702{col 67}{space 3} .4476905
{txt}{space 9}31  {c |}{col 14}{res}{space 2} .2632875{col 26}{space 2} .1415498{col 37}{space 1}    1.86{col 46}{space 3}0.066{col 54}{space 4}-.0178837{col 67}{space 3} .5444587
{txt}{space 9}32  {c |}{col 14}{res}{space 2} .1066023{col 26}{space 2} .1817643{col 37}{space 1}    0.59{col 46}{space 3}0.559{col 54}{space 4}-.2544501{col 67}{space 3} .4676547
{txt}{space 9}41  {c |}{col 14}{res}{space 2} .3576347{col 26}{space 2} .1164081{col 37}{space 1}    3.07{col 46}{space 3}0.003{col 54}{space 4} .1264043{col 67}{space 3} .5888651
{txt}{space 9}42  {c |}{col 14}{res}{space 2} .1016759{col 26}{space 2}  .149045{col 37}{space 1}    0.68{col 46}{space 3}0.497{col 54}{space 4}-.1943836{col 67}{space 3} .3977353
{txt}{space 9}51  {c |}{col 14}{res}{space 2} .3732417{col 26}{space 2} .1168729{col 37}{space 1}    3.19{col 46}{space 3}0.002{col 54}{space 4}  .141088{col 67}{space 3} .6053954
{txt}{space 9}52  {c |}{col 14}{res}{space 2} .1857713{col 26}{space 2} .1192286{col 37}{space 1}    1.56{col 46}{space 3}0.123{col 54}{space 4}-.0510617{col 67}{space 3} .4226043
{txt}{space 9}61  {c |}{col 14}{res}{space 2} .3675817{col 26}{space 2} .1237809{col 37}{space 1}    2.97{col 46}{space 3}0.004{col 54}{space 4} .1217062{col 67}{space 3} .6134572
{txt}{space 9}62  {c |}{col 14}{res}{space 2} .4093299{col 26}{space 2} .1154246{col 37}{space 1}    3.55{col 46}{space 3}0.001{col 54}{space 4} .1800532{col 67}{space 3} .6386066
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2}-.3339552{col 26}{space 2} .1054644{col 37}{space 1}   -3.17{col 46}{space 3}0.002{col 54}{space 4}-.5434474{col 67}{space 3} -.124463
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. matrix A = mat_1
{txt}
{com}. forv i = 2/`listsize' {c -(} // appends into single matrix
{txt}  2{com}.         matrix A = A \ mat_`i'
{txt}  3{com}. {c )-}
{txt}
{com}. 
. * Table
. frmttable using MDE_3.doc, statmat(A) sdec(4) coljust(l;c;l;l) title("Goat Sales") ///
> ctitle("","MDE","% of mean","# of sd's.") ///
> rtitle("Goats Sold"\"Goat Revenue"\"# Sold through Co-op"\"Rev. through Co-op"\"Net Goat Income"\"HH Goat Sales Index"\"Trader Visits per Sale"\"Time Passed"\"Transportation Costs"\"Sale Costs Index") ///
> note("Currency measured in USD") addtable replace
{res}
{txt}{center:Goat Sales}
{txt}{center:{hline 58}}
{center:{txt}{lalign 24:}{txt}{center 9:MDE}{txt}{center 11:% of mean}{txt}{center 12:# of sd's.}}
{txt}{center:{hline 58}}
{center:{txt}{lalign 24:Goats Sold}{res}{center 9:0.3145}{res}{center 11:0.2762}{res}{center 12:0.1678}}
{center:{txt}{lalign 24:Goat Revenue}{res}{center 9:25.3226}{res}{center 11:0.2701}{res}{center 12:0.1663}}
{center:{txt}{lalign 24:# Sold through Co-op}{res}{center 9:0.1986}{res}{center 11:0.8103}{res}{center 12:0.2136}}
{center:{txt}{lalign 24:Rev. through Co-op}{res}{center 9:17.3306}{res}{center 11:0.7827}{res}{center 12:0.2045}}
{center:{txt}{lalign 24:Net Goat Income}{res}{center 9:40.8922}{res}{center 11:0.8007}{res}{center 12:0.1381}}
{center:{txt}{lalign 24:HH Goat Sales Index}{res}{center 9:0.1557}{res}{center 11:-29.5155}{res}{center 12:0.1828}}
{center:{txt}{lalign 24:Trader Visits per Sale}{res}{center 9:0.1508}{res}{center 11:-0.5003}{res}{center 12:0.2453}}
{center:{txt}{lalign 24:Time Passed}{res}{center 9:0.4338}{res}{center 11:-0.5496}{res}{center 12:0.2004}}
{center:{txt}{lalign 24:Transportation Costs}{res}{center 9:0.5554}{res}{center 11:-2.4244}{res}{center 12:0.0800}}
{center:{txt}{lalign 24:Sale Costs Index}{res}{center 9:0.1378}{res}{center 11:-1.0620}{res}{center 12:0.1680}}
{txt}{center:{hline 58}}
{txt}{center:Currency measured in USD}


{com}. 
. 
. * Transparency
. ** HH vars
. gl hh_trn_d index_dTRN
{txt}
{com}. 
. local listsize : list sizeof global(hh_trn_d)
{txt}
{com}. tokenize $hh_trn_d
{txt}
{com}. 
. forv i = 1/`listsize' {c -(}
{txt}  2{com}. 
.         reg ``i'' r_treat i.str, cluster(idx)
{txt}  3{com}.         
.         quietly {c -(}
{txt}  4{com}.                 ereturn list
{txt}  5{com}.                 scalar t_a = invttail(`e(df_r)',0.025) // alpha t-value
{txt}  6{com}.                 scalar t_b = invttail(`e(df_r)',0.2) // beta t-value
{txt}  7{com}.                 scalar mde_``i'' = (t_a + t_b)*_se[r_treat]
{txt}  8{com}.                 
.         * Calculate MDE as % of mean & # of standard deviations
.                 sum ``i''
{txt}  9{com}.                 scalar mean_``i'' = mde_``i'' / r(mean) // % of treatment mean
{txt} 10{com}.                 scalar sd_``i'' = mde_``i'' / r(sd)  // # of treatment sd's
{txt} 11{com}. 
.         * matrix for table
.                 matrix mat_`i' = (mde_``i'',mean_``i'',sd_``i'')
{txt} 12{com}.                 {c )-}
{txt} 13{com}. {c )-}

{txt}Linear regression                               Number of obs     = {res}     1,647
                                                {txt}F(12, 89)         =  {res}     3.86
                                                {txt}Prob > F          = {res}    0.0001
                                                {txt}R-squared         = {res}    0.1710
                                                {txt}Root MSE          =    {res}  .9561

{txt}{ralign 78:(Std. Err. adjusted for {res:90} clusters in idx)}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}  index_dTRN{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}r_treat {c |}{col 14}{res}{space 2} .0137947{col 26}{space 2} .1455412{col 37}{space 1}    0.09{col 46}{space 3}0.925{col 54}{space 4}-.2753926{col 67}{space 3}  .302982
{txt}{space 12} {c |}
{space 9}str {c |}
{space 9}12  {c |}{col 14}{res}{space 2} .4917095{col 26}{space 2} .3639389{col 37}{space 1}    1.35{col 46}{space 3}0.180{col 54}{space 4}-.2314292{col 67}{space 3} 1.214848
{txt}{space 9}21  {c |}{col 14}{res}{space 2}-.6307693{col 26}{space 2} .5134395{col 37}{space 1}   -1.23{col 46}{space 3}0.222{col 54}{space 4}-1.650963{col 67}{space 3} .3894241
{txt}{space 9}22  {c |}{col 14}{res}{space 2}-.0873837{col 26}{space 2} .4292735{col 37}{space 1}   -0.20{col 46}{space 3}0.839{col 54}{space 4} -.940341{col 67}{space 3} .7655737
{txt}{space 9}31  {c |}{col 14}{res}{space 2} .2403525{col 26}{space 2} .3649742{col 37}{space 1}    0.66{col 46}{space 3}0.512{col 54}{space 4}-.4848434{col 67}{space 3} .9655484
{txt}{space 9}32  {c |}{col 14}{res}{space 2}-.3793974{col 26}{space 2} .5074348{col 37}{space 1}   -0.75{col 46}{space 3}0.457{col 54}{space 4} -1.38766{col 67}{space 3} .6288647
{txt}{space 9}41  {c |}{col 14}{res}{space 2} .1962006{col 26}{space 2} .3561076{col 37}{space 1}    0.55{col 46}{space 3}0.583{col 54}{space 4}-.5113775{col 67}{space 3} .9037788
{txt}{space 9}42  {c |}{col 14}{res}{space 2}  .691778{col 26}{space 2} .3659076{col 37}{space 1}    1.89{col 46}{space 3}0.062{col 54}{space 4}-.0352726{col 67}{space 3} 1.418829
{txt}{space 9}51  {c |}{col 14}{res}{space 2} .5273478{col 26}{space 2}  .370865{col 37}{space 1}    1.42{col 46}{space 3}0.159{col 54}{space 4}-.2095531{col 67}{space 3} 1.264249
{txt}{space 9}52  {c |}{col 14}{res}{space 2} .2058728{col 26}{space 2} .4232645{col 37}{space 1}    0.49{col 46}{space 3}0.628{col 54}{space 4}-.6351447{col 67}{space 3}  1.04689
{txt}{space 9}61  {c |}{col 14}{res}{space 2} .3933517{col 26}{space 2} .3943393{col 37}{space 1}    1.00{col 46}{space 3}0.321{col 54}{space 4}-.3901922{col 67}{space 3} 1.176895
{txt}{space 9}62  {c |}{col 14}{res}{space 2}-.5845542{col 26}{space 2} .3773228{col 37}{space 1}   -1.55{col 46}{space 3}0.125{col 54}{space 4}-1.334287{col 67}{space 3} .1651782
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} .2464227{col 26}{space 2} .3486653{col 37}{space 1}    0.71{col 46}{space 3}0.482{col 54}{space 4}-.4463679{col 67}{space 3} .9392133
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. matrix A = mat_1
{txt}
{com}. forv i = 2/`listsize' {c -(} // appends into single matrix
{txt}  2{com}.         matrix A = A \ mat_`i'
{txt}  3{com}. {c )-}
{txt}
{com}. 
. * Strata table
. frmttable using MDE_3.doc, statmat(A) sdec(4) title("Transparency") ///
> ctitle("","MDE","% of mean","# of sd's.") ///
> rtitle("Discrepancy Index") addtable replace
{res}
{txt}{center:Transparency}
{txt}{center:{hline 52}}
{center:{txt}{lalign 19:}{txt}{center 8:MDE}{txt}{center 11:% of mean}{txt}{center 12:# of sd's.}}
{txt}{center:{hline 52}}
{center:{txt}{lalign 19:Discrepancy Index}{res}{center 8:0.4123}{res}{center 11:1.3212}{res}{center 12:0.3940}}
{txt}{center:{hline 52}}


{com}. 
. 
. 
. 
. 
. ** Co-op level dataset
. ********************************************* 
. clear
{txt}
{com}. use "$d3/r_CO_Merged_Ind.dta"
{txt}( )

{com}. 
. * generate strata variable that excludes 4th strata (due to data error)
. * ------------------------------------------------------
. gen str = . 
{txt}(92 missing values generated)

{com}. 
. foreach i in 11 12 21 22 31 32 41 42 51 52 61 62 {c -(}
{txt}  2{com}.         replace str = `i' if strata == `i'1 | strata ==`i'2
{txt}  3{com}. {c )-}
{txt}(6 real changes made)
(7 real changes made)
(7 real changes made)
(8 real changes made)
(6 real changes made)
(7 real changes made)
(8 real changes made)
(9 real changes made)
(8 real changes made)
(9 real changes made)
(8 real changes made)
(9 real changes made)

{com}. * ------------------------------------------------------
. 
. * Planning and Goals
. 
. ** Co-op vars
. gl co_PNG PNG1 PNG2 PNG3 expected_rev index_PNG
{txt}
{com}. 
. *** Strata dummies - No interaction
. ** Co-op vars
. local listsize : list sizeof global(co_PNG)
{txt}
{com}. tokenize $co_PNG
{txt}
{com}. 
. forv i = 1/`listsize' {c -(}
{txt}  2{com}. 
.         reg ``i'' r_treat i.str
{txt}  3{com}.         
.         quietly {c -(}
{txt}  4{com}.                 ereturn list
{txt}  5{com}.                 scalar t_a = invttail(`e(df_r)',0.025) // alpha t-value
{txt}  6{com}.                 scalar t_b = invttail(`e(df_r)',0.2) // beta t-value
{txt}  7{com}.                 scalar mde_``i'' = (t_a + t_b)*_se[r_treat]
{txt}  8{com}.                 
.         * Calculate MDE as % of mean & # of standard deviations
.                 sum ``i''
{txt}  9{com}.                 scalar mean_``i'' = mde_``i'' / r(mean) // % of treatment mean
{txt} 10{com}.                 scalar sd_``i'' = mde_``i'' / r(sd)  // # of treatment sd's
{txt} 11{com}. 
.         * matrix for table
.                 matrix mat_`i' = (mde_``i'',mean_``i'',sd_``i'')
{txt} 12{com}.                 {c )-}
{txt} 13{com}. {c )-}

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}        90
{txt}{hline 13}{c +}{hline 34}   F(12, 77)       = {res}     3.98
{txt}       Model {c |} {res} 8.23295842        12  .686079868   {txt}Prob > F        ={res}    0.0001
{txt}    Residual {c |} {res} 13.2781527        77  .172443541   {txt}R-squared       ={res}    0.3827
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.2865
{txt}       Total {c |} {res} 21.5111111        89  .241697878   {txt}Root MSE        =   {res} .41526

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}        PNG1{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}r_treat {c |}{col 14}{res}{space 2}-.1265333{col 26}{space 2} .0881064{col 37}{space 1}   -1.44{col 46}{space 3}0.155{col 54}{space 4}-.3019755{col 67}{space 3} .0489089
{txt}{space 12} {c |}
{space 9}str {c |}
{space 9}12  {c |}{col 14}{res}{space 2}       .5{col 26}{space 2} .2397523{col 37}{space 1}    2.09{col 46}{space 3}0.040{col 54}{space 4} .0225921{col 67}{space 3} .9774079
{txt}{space 9}21  {c |}{col 14}{res}{space 2} .1100095{col 26}{space 2} .2311168{col 37}{space 1}    0.48{col 46}{space 3}0.635{col 54}{space 4}-.3502029{col 67}{space 3} .5702219
{txt}{space 9}22  {c |}{col 14}{res}{space 2}       .5{col 26}{space 2} .2242678{col 37}{space 1}    2.23{col 46}{space 3}0.029{col 54}{space 4} .0534258{col 67}{space 3} .9465742
{txt}{space 9}31  {c |}{col 14}{res}{space 2} .1044222{col 26}{space 2} .2402016{col 37}{space 1}    0.43{col 46}{space 3}0.665{col 54}{space 4}-.3738803{col 67}{space 3} .5827247
{txt}{space 9}32  {c |}{col 14}{res}{space 2}      .25{col 26}{space 2} .2397523{col 37}{space 1}    1.04{col 46}{space 3}0.300{col 54}{space 4}-.2274079{col 67}{space 3} .7274079
{txt}{space 9}41  {c |}{col 14}{res}{space 2}      -.5{col 26}{space 2} .2242678{col 37}{space 1}   -2.23{col 46}{space 3}0.029{col 54}{space 4}-.9465742{col 67}{space 3}-.0534258
{txt}{space 9}42  {c |}{col 14}{res}{space 2}  .159637{col 26}{space 2} .2189177{col 37}{space 1}    0.73{col 46}{space 3}0.468{col 54}{space 4}-.2762837{col 67}{space 3} .5955578
{txt}{space 9}51  {c |}{col 14}{res}{space 2}    -.375{col 26}{space 2} .2242678{col 37}{space 1}   -1.67{col 46}{space 3}0.099{col 54}{space 4}-.8215742{col 67}{space 3} .0715742
{txt}{space 9}52  {c |}{col 14}{res}{space 2}-.0625852{col 26}{space 2} .2189177{col 37}{space 1}   -0.29{col 46}{space 3}0.776{col 54}{space 4}-.4985059{col 67}{space 3} .3733356
{txt}{space 9}61  {c |}{col 14}{res}{space 2}     -.25{col 26}{space 2} .2242678{col 37}{space 1}   -1.11{col 46}{space 3}0.268{col 54}{space 4}-.6965742{col 67}{space 3} .1965742
{txt}{space 9}62  {c |}{col 14}{res}{space 2} .0255481{col 26}{space 2} .2189177{col 37}{space 1}    0.12{col 46}{space 3}0.907{col 54}{space 4}-.4103726{col 67}{space 3} .4614689
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} .5632666{col 26}{space 2} .1751607{col 37}{space 1}    3.22{col 46}{space 3}0.002{col 54}{space 4} .2144771{col 67}{space 3} .9120562
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}        89
{txt}{hline 13}{c +}{hline 34}   F(12, 76)       = {res}     1.58
{txt}       Model {c |} {res} 17.4931686        12  1.45776405   {txt}Prob > F        ={res}    0.1155
{txt}    Residual {c |} {res} 70.1073308        76  .922464879   {txt}R-squared       ={res}    0.1997
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.0733
{txt}       Total {c |} {res} 87.6004994        88   .99546022   {txt}Root MSE        =   {res} .96045

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}        PNG2{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}r_treat {c |}{col 14}{res}{space 2}-.1033321{col 26}{space 2} .2048056{col 37}{space 1}   -0.50{col 46}{space 3}0.615{col 54}{space 4}-.5112379{col 67}{space 3} .3045737
{txt}{space 12} {c |}
{space 9}str {c |}
{space 9}12  {c |}{col 14}{res}{space 2} 1.166667{col 26}{space 2} .5545163{col 37}{space 1}    2.10{col 46}{space 3}0.039{col 54}{space 4} .0622518{col 67}{space 3} 2.271082
{txt}{space 9}21  {c |}{col 14}{res}{space 2} .2069048{col 26}{space 2} .5345455{col 37}{space 1}    0.39{col 46}{space 3}0.700{col 54}{space 4}-.8577347{col 67}{space 3} 1.271544
{txt}{space 9}22  {c |}{col 14}{res}{space 2}      .75{col 26}{space 2} .5187025{col 37}{space 1}    1.45{col 46}{space 3}0.152{col 54}{space 4}-.2830855{col 67}{space 3} 1.783086
{txt}{space 9}31  {c |}{col 14}{res}{space 2} .6005554{col 26}{space 2} .5555659{col 37}{space 1}    1.08{col 46}{space 3}0.283{col 54}{space 4}  -.50595{col 67}{space 3} 1.707061
{txt}{space 9}32  {c |}{col 14}{res}{space 2} 1.277778{col 26}{space 2} .5545163{col 37}{space 1}    2.30{col 46}{space 3}0.024{col 54}{space 4} .1733629{col 67}{space 3} 2.382193
{txt}{space 9}41  {c |}{col 14}{res}{space 2}      .25{col 26}{space 2} .5187025{col 37}{space 1}    0.48{col 46}{space 3}0.631{col 54}{space 4}-.7830855{col 67}{space 3} 1.283086
{txt}{space 9}42  {c |}{col 14}{res}{space 2} 1.272037{col 26}{space 2} .5063296{col 37}{space 1}    2.51{col 46}{space 3}0.014{col 54}{space 4} .2635942{col 67}{space 3}  2.28048
{txt}{space 9}51  {c |}{col 14}{res}{space 2}     .375{col 26}{space 2} .5187025{col 37}{space 1}    0.72{col 46}{space 3}0.472{col 54}{space 4}-.6580855{col 67}{space 3} 1.408086
{txt}{space 9}52  {c |}{col 14}{res}{space 2}    1.375{col 26}{space 2} .5187025{col 37}{space 1}    2.65{col 46}{space 3}0.010{col 54}{space 4} .3419145{col 67}{space 3} 2.408086
{txt}{space 9}61  {c |}{col 14}{res}{space 2}     .875{col 26}{space 2} .5187025{col 37}{space 1}    1.69{col 46}{space 3}0.096{col 54}{space 4}-.1580855{col 67}{space 3} 1.908086
{txt}{space 9}62  {c |}{col 14}{res}{space 2}  .876111{col 26}{space 2} .5063296{col 37}{space 1}    1.73{col 46}{space 3}0.088{col 54}{space 4}-.1323318{col 67}{space 3} 1.884554
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} .5516661{col 26}{space 2} .4052536{col 37}{space 1}    1.36{col 46}{space 3}0.177{col 54}{space 4}-.2554664{col 67}{space 3} 1.358799
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}        90
{txt}{hline 13}{c +}{hline 34}   F(12, 77)       = {res}     3.97
{txt}       Model {c |} {res} 4485741.02        12  373811.752   {txt}Prob > F        ={res}    0.0001
{txt}    Residual {c |} {res} 7258735.48        77  94269.2919   {txt}R-squared       ={res}    0.3819
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.2856
{txt}       Total {c |} {res} 11744476.5        89   131960.41   {txt}Root MSE        =   {res} 307.03

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}        PNG3{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}r_treat {c |}{col 14}{res}{space 2}-.6749434{col 26}{space 2} 65.14318{col 37}{space 1}   -0.01{col 46}{space 3}0.992{col 54}{space 4}-130.3916{col 67}{space 3} 129.0417
{txt}{space 12} {c |}
{space 9}str {c |}
{space 9}12  {c |}{col 14}{res}{space 2} 77.83333{col 26}{space 2} 177.2656{col 37}{space 1}    0.44{col 46}{space 3}0.662{col 54}{space 4}-275.1476{col 67}{space 3} 430.8143
{txt}{space 9}21  {c |}{col 14}{res}{space 2} 33.26131{col 26}{space 2} 170.8808{col 37}{space 1}    0.19{col 46}{space 3}0.846{col 54}{space 4}-307.0058{col 67}{space 3} 373.5284
{txt}{space 9}22  {c |}{col 14}{res}{space 2} 181.0625{col 26}{space 2} 165.8168{col 37}{space 1}    1.09{col 46}{space 3}0.278{col 54}{space 4}-149.1209{col 67}{space 3} 511.2459
{txt}{space 9}31  {c |}{col 14}{res}{space 2} 880.0292{col 26}{space 2} 177.5978{col 37}{space 1}    4.96{col 46}{space 3}0.000{col 54}{space 4} 526.3868{col 67}{space 3} 1233.672
{txt}{space 9}32  {c |}{col 14}{res}{space 2} 516.1667{col 26}{space 2} 177.2656{col 37}{space 1}    2.91{col 46}{space 3}0.005{col 54}{space 4} 163.1857{col 67}{space 3} 869.1476
{txt}{space 9}41  {c |}{col 14}{res}{space 2}  143.125{col 26}{space 2} 165.8168{col 37}{space 1}    0.86{col 46}{space 3}0.391{col 54}{space 4}-187.0584{col 67}{space 3} 473.3084
{txt}{space 9}42  {c |}{col 14}{res}{space 2} 172.7958{col 26}{space 2} 161.8611{col 37}{space 1}    1.07{col 46}{space 3}0.289{col 54}{space 4}-149.5108{col 67}{space 3} 495.1024
{txt}{space 9}51  {c |}{col 14}{res}{space 2}    63.25{col 26}{space 2} 165.8168{col 37}{space 1}    0.38{col 46}{space 3}0.704{col 54}{space 4}-266.9334{col 67}{space 3} 393.4334
{txt}{space 9}52  {c |}{col 14}{res}{space 2} 179.9069{col 26}{space 2} 161.8611{col 37}{space 1}    1.11{col 46}{space 3}0.270{col 54}{space 4}-142.3997{col 67}{space 3} 502.2136
{txt}{space 9}61  {c |}{col 14}{res}{space 2}   80.375{col 26}{space 2} 165.8168{col 37}{space 1}    0.48{col 46}{space 3}0.629{col 54}{space 4}-249.8084{col 67}{space 3} 410.5584
{txt}{space 9}62  {c |}{col 14}{res}{space 2} 385.2782{col 26}{space 2} 161.8611{col 37}{space 1}    2.38{col 46}{space 3}0.020{col 54}{space 4} 62.97163{col 67}{space 3} 707.5848
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} 55.83747{col 26}{space 2} 129.5085{col 37}{space 1}    0.43{col 46}{space 3}0.668{col 54}{space 4}-202.0469{col 67}{space 3} 313.7219
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}        90
{txt}{hline 13}{c +}{hline 34}   F(12, 77)       = {res}     1.50
{txt}       Model {c |} {res} 78429329.2        12  6535777.43   {txt}Prob > F        ={res}    0.1437
{txt}    Residual {c |} {res}  336215406        77  4366433.84   {txt}R-squared       ={res}    0.1891
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.0628
{txt}       Total {c |} {res}  414644735        89  4658929.61   {txt}Root MSE        =   {res} 2089.6

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}expected_rev{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}r_treat {c |}{col 14}{res}{space 2}-131.5397{col 26}{space 2} 443.3506{col 37}{space 1}   -0.30{col 46}{space 3}0.767{col 54}{space 4}-1014.363{col 67}{space 3} 751.2841
{txt}{space 12} {c |}
{space 9}str {c |}
{space 9}12  {c |}{col 14}{res}{space 2}   2653.2{col 26}{space 2} 1206.432{col 37}{space 1}    2.20{col 46}{space 3}0.031{col 54}{space 4} 250.8872{col 67}{space 3} 5055.513
{txt}{space 9}21  {c |}{col 14}{res}{space 2}-1146.435{col 26}{space 2} 1162.978{col 37}{space 1}   -0.99{col 46}{space 3}0.327{col 54}{space 4} -3462.22{col 67}{space 3} 1169.351
{txt}{space 9}22  {c |}{col 14}{res}{space 2}-69.09375{col 26}{space 2} 1128.514{col 37}{space 1}   -0.06{col 46}{space 3}0.951{col 54}{space 4}-2316.252{col 67}{space 3} 2178.064
{txt}{space 9}31  {c |}{col 14}{res}{space 2}-672.7267{col 26}{space 2} 1208.693{col 37}{space 1}   -0.56{col 46}{space 3}0.579{col 54}{space 4}-3079.541{col 67}{space 3} 1734.088
{txt}{space 9}32  {c |}{col 14}{res}{space 2}-858.7978{col 26}{space 2} 1206.432{col 37}{space 1}   -0.71{col 46}{space 3}0.479{col 54}{space 4}-3261.111{col 67}{space 3} 1543.515
{txt}{space 9}41  {c |}{col 14}{res}{space 2} -338.005{col 26}{space 2} 1128.514{col 37}{space 1}   -0.30{col 46}{space 3}0.765{col 54}{space 4}-2585.163{col 67}{space 3} 1909.153
{txt}{space 9}42  {c |}{col 14}{res}{space 2} 250.0922{col 26}{space 2} 1101.592{col 37}{space 1}    0.23{col 46}{space 3}0.821{col 54}{space 4}-1943.458{col 67}{space 3} 2443.642
{txt}{space 9}51  {c |}{col 14}{res}{space 2} -1074.44{col 26}{space 2} 1128.514{col 37}{space 1}   -0.95{col 46}{space 3}0.344{col 54}{space 4}-3321.598{col 67}{space 3} 1172.718
{txt}{space 9}52  {c |}{col 14}{res}{space 2}-1096.749{col 26}{space 2} 1101.592{col 37}{space 1}   -1.00{col 46}{space 3}0.323{col 54}{space 4}-3290.299{col 67}{space 3} 1096.801
{txt}{space 9}61  {c |}{col 14}{res}{space 2}-581.4187{col 26}{space 2} 1128.514{col 37}{space 1}   -0.52{col 46}{space 3}0.608{col 54}{space 4}-2828.577{col 67}{space 3} 1665.739
{txt}{space 9}62  {c |}{col 14}{res}{space 2}-934.5144{col 26}{space 2} 1101.592{col 37}{space 1}   -0.85{col 46}{space 3}0.399{col 54}{space 4}-3128.064{col 67}{space 3} 1259.035
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2}  1468.27{col 26}{space 2} 881.4073{col 37}{space 1}    1.67{col 46}{space 3}0.100{col 54}{space 4}-286.8364{col 67}{space 3} 3223.376
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}        89
{txt}{hline 13}{c +}{hline 34}   F(12, 76)       = {res}     2.88
{txt}       Model {c |} {res} 22.2808372        12  1.85673643   {txt}Prob > F        ={res}    0.0025
{txt}    Residual {c |} {res}  48.963593        76  .644257802   {txt}R-squared       ={res}    0.3127
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.2042
{txt}       Total {c |} {res} 71.2444301        88  .809595797   {txt}Root MSE        =   {res} .80266

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}   index_PNG{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}r_treat {c |}{col 14}{res}{space 2}-.1439418{col 26}{space 2} .1711579{col 37}{space 1}   -0.84{col 46}{space 3}0.403{col 54}{space 4}-.4848322{col 67}{space 3} .1969487
{txt}{space 12} {c |}
{space 9}str {c |}
{space 9}12  {c |}{col 14}{res}{space 2} 1.183328{col 26}{space 2} .4634141{col 37}{space 1}    2.55{col 46}{space 3}0.013{col 54}{space 4} .2603586{col 67}{space 3} 2.106297
{txt}{space 9}21  {c |}{col 14}{res}{space 2}-.0781413{col 26}{space 2} .4467243{col 37}{space 1}   -0.17{col 46}{space 3}0.862{col 54}{space 4}-.9678698{col 67}{space 3} .8115873
{txt}{space 9}22  {c |}{col 14}{res}{space 2} .7054642{col 26}{space 2} .4334842{col 37}{space 1}    1.63{col 46}{space 3}0.108{col 54}{space 4}-.1578944{col 67}{space 3} 1.568823
{txt}{space 9}31  {c |}{col 14}{res}{space 2} 1.285576{col 26}{space 2} .4642912{col 37}{space 1}    2.77{col 46}{space 3}0.007{col 54}{space 4} .3608599{col 67}{space 3} 2.210292
{txt}{space 9}32  {c |}{col 14}{res}{space 2}  .941594{col 26}{space 2} .4634141{col 37}{space 1}    2.03{col 46}{space 3}0.046{col 54}{space 4} .0186249{col 67}{space 3} 1.864563
{txt}{space 9}41  {c |}{col 14}{res}{space 2}-.1592038{col 26}{space 2} .4334842{col 37}{space 1}   -0.37{col 46}{space 3}0.714{col 54}{space 4}-1.022562{col 67}{space 3} .7041547
{txt}{space 9}42  {c |}{col 14}{res}{space 2} .6176568{col 26}{space 2} .4231441{col 37}{space 1}    1.46{col 46}{space 3}0.148{col 54}{space 4}-.2251077{col 67}{space 3} 1.460421
{txt}{space 9}51  {c |}{col 14}{res}{space 2}-.3172386{col 26}{space 2} .4334842{col 37}{space 1}   -0.73{col 46}{space 3}0.467{col 54}{space 4}-1.180597{col 67}{space 3}   .54612
{txt}{space 9}52  {c |}{col 14}{res}{space 2} .2984015{col 26}{space 2} .4334842{col 37}{space 1}    0.69{col 46}{space 3}0.493{col 54}{space 4} -.564957{col 67}{space 3}  1.16176
{txt}{space 9}61  {c |}{col 14}{res}{space 2}  -.02411{col 26}{space 2} .4334842{col 37}{space 1}   -0.06{col 46}{space 3}0.956{col 54}{space 4}-.8874686{col 67}{space 3} .8392485
{txt}{space 9}62  {c |}{col 14}{res}{space 2} .5225901{col 26}{space 2} .4231441{col 37}{space 1}    1.24{col 46}{space 3}0.221{col 54}{space 4}-.3201744{col 67}{space 3} 1.365355
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2}-.2401241{col 26}{space 2}  .338674{col 37}{space 1}   -0.71{col 46}{space 3}0.480{col 54}{space 4}-.9146517{col 67}{space 3} .4344036
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. matrix A = mat_1
{txt}
{com}. forv i = 2/`listsize' {c -(} // appends into single matrix
{txt}  2{com}.         matrix A = A \ mat_`i'
{txt}  3{com}. {c )-}
{txt}
{com}. 
. * Table
. frmttable using MDE_3.doc, statmat(A) sdec(4) title("Planning and Goals") ///
> ctitle("","MDE","% of mean","# of sd's.") ///
> rtitle("Business Plan"\"Planning Time Horizon"\"Expected Goats Sold"\"Expected Rev."\"PNG Index") addtable replace
{res}
{txt}{center:Planning and Goals}
{txt}{center:{hline 60}}
{center:{txt}{lalign 23:}{txt}{center 12:MDE}{txt}{center 11:% of mean}{txt}{center 12:# of sd's.}}
{txt}{center:{hline 60}}
{center:{txt}{lalign 23:Business Plan}{res}{center 12:0.2500}{res}{center 11:0.4787}{res}{center 12:0.5085}}
{center:{txt}{lalign 23:Planning Time Horizon}{res}{center 12:0.5812}{res}{center 11:0.4598}{res}{center 12:0.5826}}
{center:{txt}{lalign 23:Expected Goats Sold}{res}{center 12:184.8482}{res}{center 11:0.6802}{res}{center 12:0.5089}}
{center:{txt}{lalign 23:Expected Rev.}{res}{center 12:1,258.0377}{res}{center 11:1.2254}{res}{center 12:0.5828}}
{center:{txt}{lalign 23:PNG Index}{res}{center 12:0.4858}{res}{center 11:6.8015}{res}{center 12:0.5399}}
{txt}{center:{hline 60}}


{com}. 
. 
. 
. 
. 
. 
. 
{txt}end of do-file

{com}. 