{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}/Users/scottmiller/Documents/GitHub/LSIL_PAP/lsilPAP4_test.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res}27 Nov 2018, 15:43:58
{txt}
{com}. 
. cd "$d3" 
{res}/Users/scottmiller/Dropbox (UFL)/LSIL/Pre-Analysis Plan/Stata Files/PAP Data/LSIL-DATA_scott/VCC baseline aug 20 2018
{txt}
{com}. 
. 
. ** co-op dataset **
. clear
{txt}
{com}. use "r_CO_Merged_PAP.dta"
{txt}
{com}. 
. * Drop Banke District & Pilot Co-op
. drop if district == "Banke"
{txt}(14 observations deleted)

{com}. drop if r_treat ==.
{txt}(0 observations deleted)

{com}. drop if idx == "" 
{txt}(0 observations deleted)

{com}. 
. * Weights = 1 & control group
. generate wgt = 1
{txt}
{com}. generate stdgroup = r_treat
{txt}
{com}. 
. encode region, gen(n_region) // create numerical region variable for regression
{txt}
{com}. 
. ** Winsorize LS9
. * treatment
. sum LS9 if r_treat == 1, d

     {txt}LS9 How much did you earn in total from this sale?
{hline 61}
      Percentiles      Smallest
 1%    {res} 9594.595       9594.595
{txt} 5%    {res} 10083.33        9975.61
{txt}10%    {res} 10318.27       10083.33       {txt}Obs         {res}         46
{txt}25%    {res} 12773.68       10208.41       {txt}Sum of Wgt. {res}         46

{txt}50%    {res} 16727.13                      {txt}Mean          {res} 17912.88
                        {txt}Largest       Std. Dev.     {res} 7183.817
{txt}75%    {res} 22508.85       26539.14
{txt}90%    {res}    26300       27211.86       {txt}Variance      {res} 5.16e+07
{txt}95%    {res} 27211.86          40040       {txt}Skewness      {res} 1.644055
{txt}99%    {res} 44044.44       44044.44       {txt}Kurtosis      {res} 6.502127
{txt}
{com}. scalar t_99 = r(p99)
{txt}
{com}. 
. replace LS9 = t_99 if LS9 > t_99 & !missing(LS9) & r_treat == 1
{txt}(0 real changes made)

{com}. 
. *control
. sum LS9 if r_treat == 0, d

     {txt}LS9 How much did you earn in total from this sale?
{hline 61}
      Percentiles      Smallest
 1%    {res} 4865.857       4865.857
{txt} 5%    {res} 8730.769           5885
{txt}10%    {res} 9857.143       8730.769       {txt}Obs         {res}         46
{txt}25%    {res} 11906.25       9808.333       {txt}Sum of Wgt. {res}         46

{txt}50%    {res} 14718.45                      {txt}Mean          {res} 17002.02
                        {txt}Largest       Std. Dev.     {res} 8848.293
{txt}75%    {res} 19731.91          26250
{txt}90%    {res}  25806.8       27681.82       {txt}Variance      {res} 7.83e+07
{txt}95%    {res} 27681.82          35955       {txt}Skewness      {res} 2.727105
{txt}99%    {res} 60121.95       60121.95       {txt}Kurtosis      {res} 13.62087
{txt}
{com}. scalar c_99 = r(p99)
{txt}
{com}. 
. replace LS9 = c_99 if LS9 > c_99 & !missing(LS9) & r_treat == 0
{txt}(0 real changes made)

{com}. 
. 
. ** Replace Missing values with zero 
. * LS9 , 
. replace LS9 = 0 if LS9 ==.
{txt}(0 real changes made)

{com}. replace co_opsalevalue = 0 if co_opsalevalue ==.
{txt}(0 real changes made)

{com}. 
. 
. 
. 
. ** Communication **
. 
. /* Variables 
> # of times initiated contact with SHG : comm1
> # of times SHG initiated contact : comm2
> Factors that limit communication : (not in index - used as control vars)
> */
. 
.         * # of times initiated contact with SHG : comm1
.         gen comm1 = COMM1a + COMM1b ///
>         + COMM1c + COMM1d
{txt}(2 missing values generated)

{com}.         * # of times SHG initiated contact : comm2
.         gen comm2 = COMM2a + COMM2b ///
>         + COMM2c + COMM2d
{txt}(2 missing values generated)

{com}.         ** Total # of times initiated contact
.         gen contact = comm1 + comm2
{txt}(2 missing values generated)

{com}.         
.         * Total # of times HH is contacted
.         gen HHcontact = COM3 + COM8
{txt}(14 missing values generated)

{com}.         
. 
. * co-op comm index
. local local_CO_comm_full contact COM3 COM8
{txt}
{com}. make_index_gr CO_comm_full wgt stdgroup `local_CO_comm_full' 
{res}  938
{txt}
{com}. 
. * factors that limit communication
.         * principal components index
. 
. 
. ** Transparency **
. 
. /* Variables
> Mandate : Co_opTransparencyTRN1
> Annual Report : Co_opTransparencyTRN2
> Annual Budget : Co_opTransparencyTRN3
> Financial Report: Co_opTransparencyTRN4 
> Meeting minutes : Co_opTransparencyTRN5
> Election Results : Co_opTransparencyTRN6
> Sale Records : Co_opTransparencyTRN7
> Evaluations : Co_opTransparencyTRN8
> */
.         
. ** Co-op Transparency   
. local local_CO_TRN CO_TRN1 CO_TRN2 ///
>         CO_TRN3 CO_TRN4 CO_TRN5 ///
>         CO_TRN6 CO_TRN7
{txt}
{com}. make_index_gr CO_TRN wgt stdgroup `local_CO_TRN' 
{res}  939
{txt}
{com}. 
. 
. ** Household Awareness
. local local_HH_TRN HH_TRN1 HH_TRN2 ///
>         HH_TRN3 HH_TRN4 HH_TRN5 ///
>         HH_TRN6 HH_TRN7
{txt}
{com}. make_index_gr HH_TRN wgt stdgroup `local_HH_TRN' 
{res}  940
{txt}
{com}. 
. 
. ** Discrepancy
.         forvalues i=1/7 {c -(} 
{txt}  2{com}.                 gen dTRN`i' = -(CO_TRN`i' - HH_TRN`i')^2
{txt}  3{com}.                 {c )-}
{txt}(2 missing values generated)
(2 missing values generated)
(2 missing values generated)
(2 missing values generated)
(2 missing values generated)
(2 missing values generated)
(2 missing values generated)

{com}.                 
. local local_dTRN dTRN1 dTRN2 dTRN3 dTRN4 dTRN5 dTRN6 dTRN7
{txt}
{com}. make_index_gr dTRN wgt stdgroup `local_dTRN' 
{res}  948
{txt}
{com}. 
. * average discrepancy
. egen avg_dTRN = rowmean(dTRN1 dTRN2 dTRN3 dTRN4 dTRN5 dTRN6 dTRN7)
{txt}(2 missing values generated)

{com}. 
. 
. ** Cooperative Finances **
. 
. /* Variables 
> Revenue from all activities : role_GMrevenuandcostREV4
> Costs from all activities : role_GMrevenuandcostcalc_REC7
> Assets : role_GMFinLiabiliteisFAL1
> Liabilities : role_GMFinLiabiliteisFAL2
> Goat Rev : role_GMrevenuandcostREC4_1
> Members : role_CPMgt_and_membershi1
> */
. 
. * Convert to USD as of 1/1/18
. 
. gen revenue = REV4*(0.0099) // names too long for macros
{txt}(2 missing values generated)

{com}. gen costs = REC7*(0.0099)
{txt}(2 missing values generated)

{com}. gen assets = FAL1*(0.0099)
{txt}(2 missing values generated)

{com}. gen liabilities = FAL2*(0.0099)
{txt}(2 missing values generated)

{com}. gen goatrev = REC4_1*(0.0099)
{txt}(2 missing values generated)

{com}. 
. gen net_rev = revenue - costs
{txt}(2 missing values generated)

{com}. gen net_finances = (revenue - costs) ///
>                                         + (assets - liabilities)
{txt}(2 missing values generated)

{com}. 
. * per member
. gen rev_member = revenue / MAN3
{txt}(2 missing values generated)

{com}. gen cost_member =  costs / MAN3
{txt}(2 missing values generated)

{com}. gen assets_member = assets / MAN3
{txt}(2 missing values generated)

{com}. gen liab_member = liabilities / MAN3
{txt}(2 missing values generated)

{com}. gen net_rev_member = net_rev / MAN3
{txt}(2 missing values generated)

{com}. gen net_finances_member = net_finances / MAN3
{txt}(2 missing values generated)

{com}. gen goatrev_member = goatrev / MAN3
{txt}(2 missing values generated)

{com}. 
. ** Replace Missing values with zero 
. *  , 
. replace revenue = 0 if revenue ==.
{txt}(2 real changes made)

{com}. replace rev_member = 0 if rev_member ==.
{txt}(2 real changes made)

{com}. replace costs = 0 if costs ==.
{txt}(2 real changes made)

{com}. replace cost_mem = 0 if cost_mem ==.            
{txt}(2 real changes made)

{com}. 
. 
. ** Goat Sales ** 
. 
. /* Variables 
> # of goats sold : REC1
> goat revenue : REC4_1
> # of organized sales at collection points : GTT1
> Members : MAN3
> Goat revenue per member : goatrev_member
> Trader visits per sale
> Time passed
> Transportation costs
> */
. 
. ** co-op level vars
. gen goats_sold = REC1
{txt}(2 missing values generated)

{com}. gen goats_sold_member = REC1 / MAN3
{txt}(2 missing values generated)

{com}. * goatrev
. * revenue per goat sold
. gen goatrev_sold = goatrev / REC1
{txt}(22 missing values generated)

{com}. gen col_points = GTT1
{txt}
{com}. 
. local local_CO_goatsales goats_sold goatrev col_points
{txt}
{com}. make_index_gr CO_goatsales wgt stdgroup `local_CO_goatsales' 
{res}  968
{txt}
{com}. 
. 
. ** household level vars
. gen co_opshare = 0
{txt}
{com}. replace co_opshare = co_opgoatno / LS8 if LS8 != 0
{txt}(59 real changes made)

{com}. gen visits_sale = -1*(LS40 / LS_n_sales)
{txt}
{com}. gen time_passed = -1*(LS41)
{txt}
{com}. gen transp_cost = -1*(LS42*(0.0099))
{txt}
{com}. 
. local local_HH_goatsales LS8 LS9 co_opgoatno co_opsalevalue
{txt}
{com}. make_index_gr HH_goatsales wgt stdgroup `local_HH_goatsales' 
{res}  973
{txt}
{com}. 
. local local_salecost visits_sale time_passed transp_cost
{txt}
{com}. make_index_gr salecost wgt stdgroup `local_salecost' 
{res}  974
{txt}
{com}. 
. 
. * Gross margin -- Net rev. per goat
. 
. /* Costs
> Amount spent purchasing goats: LSE12
> Amount spent on feed/fodder : LSE15
> Amount spent on vet care : LSE16
> Amount spent on breeding fees : LSE17a * LSE17b
> Amount spent on shelters : LSE18
> */
. 
. foreach v of varlist LSE12 LSE15 LSE16 LSE17a LSE17b LSE18 {c -(}
{txt}  2{com}.         replace `v' = 0 if `v'==.
{txt}  3{com}.         {c )-}
{txt}(16 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)

{com}. 
. gen goat_costs = LSE12*(0.0099) + LSE15*(0.0099) + LSE16*(0.0099) + (LSE17a*LSE17b)*(0.0099) + LSE18*(0.0099)
{txt}
{com}. gen net_goat_income = LS9*(0.0099) - goat_costs
{txt}
{com}. gen netincome_goat = net_goat_income / LS8
{txt}
{com}. 
. 
. 
. 
. ** Planning and Goals **
. 
. /* Variables 
> Business Plan : PNG1
> Time Horizon : PNG2
> Expected Goats Sold : PNG3
> Expected Rev. : PNG4
> */
. 
. gen expected_rev = PNG4*(0.0099)
{txt}(2 missing values generated)

{com}. replace PNG2 =. if PNG2 == 99
{txt}(1 real change made, 1 to missing)

{com}. 
. local local_PNG PNG1 PNG2 PNG3 expected_rev
{txt}
{com}. make_index_gr PNG wgt stdgroup `local_PNG'
{res}  979
{txt}
{com}. 
. save "$d3/r_CO_Merged_Ind.dta", replace
{txt}file /Users/scottmiller/Dropbox (UFL)/LSIL/Pre-Analysis Plan/Stata Files/PAP Data/LSIL-DATA_scott/VCC baseline aug 20 2018/r_CO_Merged_Ind.dta saved

{com}. 
. 
. 
. ****************
. ** HH dataset **
. clear
{txt}
{com}. use "$d3/r_HH_Merged_PAP.dta"
{txt}
{com}. 
. * Drop Banke District & Pilot Co-op
. drop if district == "Banke"
{txt}(360 observations deleted)

{com}. drop if r_treat == .
{txt}(48 observations deleted)

{com}. drop if idx == "" 
{txt}(0 observations deleted)

{com}. 
. * Weights = 1 & control group
. generate wgt = 1
{txt}
{com}. generate stdgroup = r_treat
{txt}
{com}. 
. encode region, gen(n_region) // create numerical region variable for regression
{txt}
{com}. 
. 
. ** Winsorize LS9
. * treatment
. sum LS9 if r_treat == 1, d

     {txt}LS9 How much did you earn in total from this sale?
{hline 61}
      Percentiles      Smallest
 1%    {res}        0              0
{txt} 5%    {res}     2000              0
{txt}10%    {res}     4100              0       {txt}Obs         {res}        670
{txt}25%    {res}     8000              0       {txt}Sum of Wgt. {res}        670

{txt}50%    {res}    14000                      {txt}Mean          {res} 19408.81
                        {txt}Largest       Std. Dev.     {res} 21055.66
{txt}75%    {res}    24000         135000
{txt}90%    {res}    38000         145000       {txt}Variance      {res} 4.43e+08
{txt}95%    {res}    50000         235000       {txt}Skewness      {res} 5.149765
{txt}99%    {res}    90000         260000       {txt}Kurtosis      {res} 47.77864
{txt}
{com}. scalar t_99 = r(p99)
{txt}
{com}. 
. replace LS9 = t_99 if LS9 > t_99 & !missing(LS9) & r_treat == 1
{txt}(6 real changes made)

{com}. 
. *control
. sum LS9 if r_treat == 0, d

     {txt}LS9 How much did you earn in total from this sale?
{hline 61}
      Percentiles      Smallest
 1%    {res}        0              0
{txt} 5%    {res}        0              0
{txt}10%    {res}     4000              0       {txt}Obs         {res}        606
{txt}25%    {res}     7000              0       {txt}Sum of Wgt. {res}        606

{txt}50%    {res}    12500                      {txt}Mean          {res} 18580.66
                        {txt}Largest       Std. Dev.     {res} 26927.11
{txt}75%    {res}    22500         155600
{txt}90%    {res}    35000         195000       {txt}Variance      {res} 7.25e+08
{txt}95%    {res}    50000         220500       {txt}Skewness      {res} 8.796708
{txt}99%    {res}   113300         450000       {txt}Kurtosis      {res} 120.7191
{txt}
{com}. scalar c_99 = r(p99)
{txt}
{com}. 
. replace LS9 = c_99 if LS9 > c_99 & !missing(LS9) & r_treat == 0
{txt}(6 real changes made)

{com}. 
. 
. ** Replace Missing values with zero 
. * LS9 , 
. replace LS9 = 0 if LS9 ==.
{txt}(1,172 real changes made)

{com}. replace LS8 = 0 if LS8 ==.
{txt}(1,172 real changes made)

{com}. replace co_opsalevalue = 0 if co_opsalevalue ==.
{txt}(1,172 real changes made)

{com}. replace co_opgoatno = 0 if co_opgoatno ==.
{txt}(1,172 real changes made)

{com}. 
. 
. ** Communication **
. 
. * Variables 
. 
.         * Total # of times HH is contacted
.         gen HHcontact = COM3 + COM8
{txt}(1,241 missing values generated)

{com}. 
. 
. * HH comm index
. local local_HH_comm COM3 COM8
{txt}
{com}. make_index_gr HH_comm wgt stdgroup `local_HH_comm' 
{res}  936
{txt}
{com}. 
. * factors that limit communication
.         * principal components index
. 
. 
. 
. ** Transparency **
. 
. /* Variables
> Mandate : Co_opTransparencyTRN1
> Annual Report : Co_opTransparencyTRN2
> Annual Budget : Co_opTransparencyTRN3
> Financial Report: Co_opTransparencyTRN4 
> Meeting minutes : Co_opTransparencyTRN5
> Election Results : Co_opTransparencyTRN6
> Sale Records : Co_opTransparencyTRN7
> Evaluations : Co_opTransparencyTRN8
> */
. 
.         /*
>         forvalues i=1/7 {c -(} 
>                 destring role_GMtransTRN`i', replace
>                 replace role_GMtransTRN`i' = 0 if role_GMtransTRN`i' == 2
>                 replace role_GMtransTRN`i' = . if role_GMtransTRN`i' == 97
>                 {c )-}
>         */
.         
. ** Co-op Transparency   
. local local_CO_TRN CO_TRN1 CO_TRN2 ///
>         CO_TRN3 CO_TRN4 CO_TRN5 ///
>         CO_TRN6 CO_TRN7
{txt}
{com}. make_index_gr CO_TRN wgt stdgroup `local_CO_TRN'                
{res}  937
{txt}
{com}. 
. ** Household Awareness
. local local_HH_TRN HH_TRN1 HH_TRN2 ///
>         HH_TRN3 HH_TRN4 HH_TRN5 ///
>         HH_TRN6 HH_TRN7
{txt}
{com}. make_index_gr HH_TRN wgt stdgroup `local_HH_TRN' 
{res}  938
{txt}
{com}. 
.         
. ** Transparency Discrepancy index
.         forvalues i=1/7 {c -(} 
{txt}  2{com}.                 gen dTRN`i' = 1 if CO_TRN`i' == HH_TRN`i' ///
>                         &  !missing(CO_TRN`i') & !missing(HH_TRN`i')
{txt}  3{com}.                 replace dTRN`i' = 0 if CO_TRN`i' != HH_TRN`i' ///
>                         &  !missing(CO_TRN`i') & !missing(HH_TRN`i')
{txt}  4{com}.                 {c )-}
{txt}(1,608 missing values generated)
(1,061 real changes made)
(1,624 missing values generated)
(1,083 real changes made)
(1,619 missing values generated)
(1,091 real changes made)
(1,584 missing values generated)
(1,041 real changes made)
(1,535 missing values generated)
(1,045 real changes made)
(1,678 missing values generated)
(1,026 real changes made)
(1,483 missing values generated)
(915 real changes made)

{com}.                 
. local local_dTRN dTRN1 dTRN2 dTRN3 dTRN4 dTRN5 dTRN6 dTRN7
{txt}
{com}. make_index_gr dTRN wgt stdgroup `local_dTRN' 
{res}  946
{txt}
{com}. 
. * average discrepancy
. egen avg_dTRN = rowmean(dTRN1 dTRN2 dTRN3 dTRN4 dTRN5 dTRN6 dTRN7)
{txt}(356 missing values generated)

{com}. 
. 
. ** Goat Sales ** 
. 
. /* Variables 
> # of goats sold : Livestock_SalesLS8
> goat revenue : Livestock_SalesLS9
> goats sold through co-op : co_opgoatno
> goat revenue through co-op : co_opsalevalue
> share through co-op : co_opshare
> trader visits home : Livestock_SalesLS40
> time passed before sale : Livestock_SalesLS41
> transportation cost : Livestock_SalesLS42
> */
. 
. 
. ** household level vars
. gen co_opshare = 0
{txt}
{com}. replace co_opshare = co_opgoatno / LS8 if LS8 != 0
{txt}(261 real changes made)

{com}. gen visits_sale = -1*(LS40 / LS_n_sales)
{txt}(1,172 missing values generated)

{com}. gen time_passed = -1*(LS41)
{txt}(1,172 missing values generated)

{com}. gen transp_cost = -1*(LS42*(0.0099))
{txt}(1,172 missing values generated)

{com}. replace LS9 = LS9*(0.0099)
{txt}(1,218 real changes made)

{com}. replace co_opsalevalue = co_opsalevalue*(0.0099)
{txt}(262 real changes made)

{com}. 
. /* Costs
> Amount spent purchasing goats: LSE12
> Amount spent on feed/fodder : LSE15
> Amount spent on vet care : LSE16
> Amount spent on breeding fees : LSE17a * LSE17b
> Amount spent on shelters : LSE18
> */
. 
. foreach v of varlist LSE12 LSE15 LSE16 LSE17a LSE17b LSE18 {c -(}
{txt}  2{com}.         replace `v' = 0 if `v'==.
{txt}  3{com}.         {c )-}
{txt}(2,191 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(539 real changes made)
(0 real changes made)

{com}. 
. gen goat_costs = LSE12*(0.0099) + LSE15*(0.0099) + LSE16*(0.0099) + (LSE17a*LSE17b)*(0.0099) + LSE18*(0.0099)
{txt}
{com}. gen net_goat_income = LS9 - goat_costs
{txt}
{com}. gen netincome_goat = net_goat_income / LS8
{txt}(1,234 missing values generated)

{com}. 
. 
. local local_HH_goatsales LS8 LS9 co_opgoatno co_opsalevalue net_goat_income
{txt}
{com}. make_index_gr HH_goatsales wgt stdgroup `local_HH_goatsales' 
{res}  955
{txt}
{com}. 
. local local_salecost visits_sale time_passed transp_cost
{txt}
{com}. make_index_gr salecost wgt stdgroup `local_salecost' 
{res}  956
{txt}
{com}. 
. 
. save "$d3/r_HH_Merged_Ind.dta", replace
{txt}file /Users/scottmiller/Dropbox (UFL)/LSIL/Pre-Analysis Plan/Stata Files/PAP Data/LSIL-DATA_scott/VCC baseline aug 20 2018/r_HH_Merged_Ind.dta saved

{com}. 
. 
. 
. 
{txt}end of do-file

{com}. do "/var/folders/_d/jk4yrpt11pbc34dyw8cg5kjm0000gn/T//SD03049.000000"
{txt}
{com}. 
. clear
{txt}
{com}. set more off, perm
{txt}({cmd:set more} preference recorded)

{com}. cd "$d2"
{res}/Users/scottmiller/Dropbox (UFL)/LSIL/Pre-Analysis Plan/Stata Files/PAP Data
{txt}
{com}. 
. ** Co-op level dataset
. ********************************************* 
. clear
{txt}
{com}. use "$d3/r_CO_Merged_Ind.dta"
{txt}
{com}. 
. 
. ** Co-op indicators **
. 
. gl co_summ MAN3 revenue costs net_rev rev_member net_rev_member ///
>                 PNG1 PNG2 PNG3 expected_rev index_PNG CO_TRN1 CO_TRN2 ///
>                 CO_TRN3 CO_TRN4 CO_TRN5 CO_TRN6 CO_TRN7
{txt}
{com}. 
. local listsize : list sizeof global(co_summ)
{txt}
{com}. tokenize $co_summ
{txt}
{com}. 
. forv i = 1/`listsize' {c -(}
{txt}  2{com}.                 
.         quietly {c -(}
{txt}  3{com}.                 sum ``i''
{txt}  4{com}.                 return list
{txt}  5{com}.                 scalar N_``i'' = r(N) // N
{txt}  6{com}.                 scalar mean_``i'' = r(mean) // mean
{txt}  7{com}.                 scalar sd_``i'' = r(sd)  // sd
{txt}  8{com}.                 scalar min_``i'' = r(min)  // sd
{txt}  9{com}.                 scalar max_``i'' = r(max)  // sd
{txt} 10{com}.                 
.         * matrix for table
.                 matrix mat_`i' = (N_``i'',mean_``i'',sd_``i'',min_``i'',max_``i'')
{txt} 11{com}.                 {c )-}
{txt} 12{com}. {c )-}
{txt}
{com}. matrix A = mat_1
{txt}
{com}. forv i = 2/`listsize' {c -(} // appends into single matrix
{txt}  2{com}.         matrix A = A \ mat_`i'
{txt}  3{com}. {c )-}
{txt}
{com}. 
. * Table
. frmttable using CO_summary.tex, tex statmat(A) sdec(2) coljust(l;c;l;l) title("Cooperative Indicators - Summmary Statistics") ///
> ctitle("","N","Mean","sd","Min","Max") ///
> rtitle("\# of Members"\"Revenue (USD)"\"Costs (USD)"\"Net Revenue (USD)"\"Revenue per Member (USD)"\"Net Revenue per Member (USD)"\"Co-op has a Business Plan"\"Planning Time Horizon (Years)"\"Expected Goats Sold"\"Expected Revenue (USD)"\"Planning \& Goals Summmary Index"\"Transparency: Mandate"\"Transparency: Annual Report"\"Transparency: Annual Budget"\"Transparency: Financial Report"\"Transparency: Meeting Minutes"\"Transparency: Election Results"\"Transparency: Sale Records")replace
{res}
{txt}{center:Cooperative Indicators - Summmary Statistics}
{txt}{center:{hline 81}}
{center:{txt}{lalign 34:}{txt}{center 7:N}{txt}{center 10:Mean}{txt}{center 10:sd}{txt}{center 7:Min}{txt}{center 11:Max}}
{txt}{center:{hline 81}}
{center:{txt}{lalign 34:\# of Members}{res}{center 7:92.00}{res}{center 10:553.36}{res}{center 10:376.42}{res}{center 7:11.00}{res}{center 11:2,600.00}}
{center:{txt}{lalign 34:Revenue (USD)}{res}{center 7:92.00}{res}{center 10:3.78}{res}{center 10:8.01}{res}{center 7:0.00}{res}{center 11:65.71}}
{center:{txt}{lalign 34:Costs (USD)}{res}{center 7:92.00}{res}{center 10:0.38}{res}{center 10:1.64}{res}{center 7:0.00}{res}{center 11:10.96}}
{center:{txt}{lalign 34:Net Revenue (USD)}{res}{center 7:90.00}{res}{center 10:3.47}{res}{center 10:8.25}{res}{center 7:-7.93}{res}{center 11:65.55}}
{center:{txt}{lalign 34:Revenue per Member (USD)}{res}{center 7:92.00}{res}{center 10:0.01}{res}{center 10:0.01}{res}{center 7:0.00}{res}{center 11:0.06}}
{center:{txt}{lalign 34:Net Revenue per Member (USD)}{res}{center 7:90.00}{res}{center 10:0.01}{res}{center 10:0.01}{res}{center 7:-0.01}{res}{center 11:0.06}}
{center:{txt}{lalign 34:Co-op has a Business Plan}{res}{center 7:90.00}{res}{center 10:0.52}{res}{center 10:0.49}{res}{center 7:0.00}{res}{center 11:1.00}}
{center:{txt}{lalign 34:Planning Time Horizon (Years)}{res}{center 7:89.00}{res}{center 10:1.26}{res}{center 10:1.00}{res}{center 7:0.00}{res}{center 11:5.00}}
{center:{txt}{lalign 34:Expected Goats Sold}{res}{center 7:90.00}{res}{center 10:271.74}{res}{center 10:363.26}{res}{center 7:0.00}{res}{center 11:2,500.00}}
{center:{txt}{lalign 34:Expected Revenue (USD)}{res}{center 7:90.00}{res}{center 10:1,026.62}{res}{center 10:2,158.46}{res}{center 7:0.00}{res}{center 11:14,850.00}}
{center:{txt}{lalign 34:Planning \& Goals Summmary Index}{res}{center 7:89.00}{res}{center 10:0.06}{res}{center 10:0.91}{res}{center 7:-1.17}{res}{center 11:3.88}}
{center:{txt}{lalign 34:Transparency: Mandate}{res}{center 7:90.00}{res}{center 10:0.81}{res}{center 10:0.38}{res}{center 7:0.00}{res}{center 11:1.00}}
{center:{txt}{lalign 34:Transparency: Annual Report}{res}{center 7:90.00}{res}{center 10:0.84}{res}{center 10:0.36}{res}{center 7:0.00}{res}{center 11:1.00}}
{center:{txt}{lalign 34:Transparency: Annual Budget}{res}{center 7:90.00}{res}{center 10:0.82}{res}{center 10:0.38}{res}{center 7:0.00}{res}{center 11:1.00}}
{center:{txt}{lalign 34:Transparency: Financial Report}{res}{center 7:90.00}{res}{center 10:0.81}{res}{center 10:0.38}{res}{center 7:0.00}{res}{center 11:1.00}}
{center:{txt}{lalign 34:Transparency: Meeting Minutes}{res}{center 7:90.00}{res}{center 10:0.78}{res}{center 10:0.40}{res}{center 7:0.00}{res}{center 11:1.00}}
{center:{txt}{lalign 34:Transparency: Election Results}{res}{center 7:90.00}{res}{center 10:0.55}{res}{center 10:0.49}{res}{center 7:0.00}{res}{center 11:1.00}}
{center:{txt}{lalign 34:Transparency: Sale Records}{res}{center 7:90.00}{res}{center 10:0.76}{res}{center 10:0.43}{res}{center 7:0.00}{res}{center 11:1.00}}
{txt}{center:{hline 81}}


{com}.  
. 
. 
. 
. 
. ** communication **
. gl co_comm comm1 comm2 contact COM3 COM8 index_CO_comm HHcontact
{txt}
{com}.         
. ** Co-op vars
. local listsize : list sizeof global(co_comm)
{txt}
{com}. tokenize $co_comm
{txt}
{com}. 
. forv i = 1/`listsize' {c -(}
{txt}  2{com}.                 
.         quietly {c -(}
{txt}  3{com}.                 sum ``i''
{txt}  4{com}.                 return list
{txt}  5{com}.                 scalar N_``i'' = r(N) // N
{txt}  6{com}.                 scalar mean_``i'' = r(mean) // mean
{txt}  7{com}.                 scalar sd_``i'' = r(sd)  // sd
{txt}  8{com}.                 scalar min_``i'' = r(min)  // sd
{txt}  9{com}.                 scalar max_``i'' = r(max)  // sd
{txt} 10{com}.                 
.         * matrix for table
.                 matrix mat_`i' = (N_``i'',mean_``i'',sd_``i'',min_``i'',max_``i'')
{txt} 11{com}.                 {c )-}
{txt} 12{com}. {c )-}
{txt}
{com}. matrix A = mat_1
{txt}
{com}. forv i = 2/`listsize' {c -(} // appends into single matrix
{txt}  2{com}.         matrix A = A \ mat_`i'
{txt}  3{com}. {c )-}
{txt}
{com}. 
. * Table
. frmttable using MDE_summary.doc, statmat(A) sdec(2) coljust(l;c;l;l) title("Co-op Level - Communication: Summmary Stats") ///
> ctitle("","N","Mean","sd","Min","Max") ///
> rtitle("Contacted SHG"\"Contacted by SHG"\"Total Co-op Contact"\"HH info sales"\"HH info activities"\"co-op level index"\"Total HH Contact") replace
{res}
{txt}{center:Co-op Level - Communication: Summmary Stats}
{txt}{center:{hline 59}}
{center:{txt}{lalign 21:}{txt}{center 7:N}{txt}{center 7:Mean}{txt}{center 7:sd}{txt}{center 7:Min}{txt}{center 8:Max}}
{txt}{center:{hline 59}}
{center:{txt}{lalign 21:Contacted SHG}{res}{center 7:90.00}{res}{center 7:9.54}{res}{center 7:12.90}{res}{center 7:0.00}{res}{center 8:90.00}}
{center:{txt}{lalign 21:Contacted by SHG}{res}{center 7:90.00}{res}{center 7:7.45}{res}{center 7:13.66}{res}{center 7:0.00}{res}{center 8:100.00}}
{center:{txt}{lalign 21:Total Co-op Contact}{res}{center 7:90.00}{res}{center 7:16.99}{res}{center 7:25.46}{res}{center 7:0.00}{res}{center 8:190.00}}
{center:{txt}{lalign 21:HH info sales}{res}{center 7:78.00}{res}{center 7:1.11}{res}{center 7:0.90}{res}{center 7:0.00}{res}{center 8:3.50}}
{center:{txt}{lalign 21:HH info activities}{res}{center 7:92.00}{res}{center 7:1.04}{res}{center 7:1.16}{res}{center 7:0.00}{res}{center 8:8.10}}
{center:{txt}{lalign 21:co-op level index}{res}{center 7:76.00}{res}{center 7:-0.08}{res}{center 7:0.78}{res}{center 7:-1.16}{res}{center 8:3.64}}
{center:{txt}{lalign 21:Total HH Contact}{res}{center 7:78.00}{res}{center 7:2.18}{res}{center 7:1.65}{res}{center 7:0.00}{res}{center 8:9.58}}
{txt}{center:{hline 59}}


{com}.  
.  
. * ------------------------------------------- 
.  
.  
. ** finance **
. gl co_finance revenue rev_member costs cost_member ///
>         assets assets_member liabilities liab_member goatrev goatrev_member ///
>         net_rev net_rev_member net_finances net_finances_member
{txt}
{com}.         
. ** Co-op vars
. local listsize : list sizeof global(co_finance)
{txt}
{com}. tokenize $co_finance
{txt}
{com}. 
. forv i = 1/`listsize' {c -(}
{txt}  2{com}.                 
.         quietly {c -(}
{txt}  3{com}.                 sum ``i''
{txt}  4{com}.                 return list
{txt}  5{com}.                 scalar N_``i'' = r(N) // N
{txt}  6{com}.                 scalar mean_``i'' = r(mean) // mean
{txt}  7{com}.                 scalar sd_``i'' = r(sd)  // sd
{txt}  8{com}.                 scalar min_``i'' = r(min)  // sd
{txt}  9{com}.                 scalar max_``i'' = r(max)  // sd
{txt} 10{com}.                 
.         * matrix for table
.                 matrix mat_`i' = (N_``i'',mean_``i'',sd_``i'',min_``i'',max_``i'')
{txt} 11{com}.                 {c )-}
{txt} 12{com}. {c )-}
{txt}
{com}. matrix A = mat_1
{txt}
{com}. forv i = 2/`listsize' {c -(} // appends into single matrix
{txt}  2{com}.         matrix A = A \ mat_`i'
{txt}  3{com}. {c )-}
{txt}
{com}. 
. * Table
. frmttable using MDE_summary.doc, statmat(A) sdec(2) coljust(l;c;l;l) title("Co-op Level - Finances: Summmary Stats") ///
> ctitle("","N","Mean","sd","Min","Max") ///
> rtitle("Revenue"\"Rev. per Member"\"Costs"\"Costs per Mem."\"Assets"\"Assets per Mem."\"Liabilities"\"Liabilities per Mem."\"Goat Revenue"\"Goat Rev. per Mem."\"Net Revenue"\"Net Rev. per Mem."\"Net Finances"\"Net Fin. per Mem.") ///
> note("Currency measured in USD") addtable replace
{res}
{txt}{center:Co-op Level - Finances: Summmary Stats}
{txt}{center:{hline 77}}
{center:{txt}{lalign 22:}{txt}{center 7:N}{txt}{center 11:Mean}{txt}{center 11:sd}{txt}{center 12:Min}{txt}{center 12:Max}}
{txt}{center:{hline 77}}
{center:{txt}{lalign 22:Revenue}{res}{center 7:92.00}{res}{center 11:3.78}{res}{center 11:8.01}{res}{center 12:0.00}{res}{center 12:65.71}}
{center:{txt}{lalign 22:Rev. per Member}{res}{center 7:92.00}{res}{center 11:0.01}{res}{center 11:0.01}{res}{center 12:0.00}{res}{center 12:0.06}}
{center:{txt}{lalign 22:Costs}{res}{center 7:92.00}{res}{center 11:0.38}{res}{center 11:1.64}{res}{center 12:0.00}{res}{center 12:10.96}}
{center:{txt}{lalign 22:Costs per Mem.}{res}{center 7:92.00}{res}{center 11:0.00}{res}{center 11:0.00}{res}{center 12:0.00}{res}{center 12:0.02}}
{center:{txt}{lalign 22:Assets}{res}{center 7:90.00}{res}{center 11:33,020.56}{res}{center 11:40,397.44}{res}{center 12:0.00}{res}{center 12:257,985.61}}
{center:{txt}{lalign 22:Assets per Mem.}{res}{center 7:90.00}{res}{center 11:107.53}{res}{center 11:379.45}{res}{center 12:0.00}{res}{center 12:3,600.00}}
{center:{txt}{lalign 22:Liabilities}{res}{center 7:90.00}{res}{center 11:7,041.03}{res}{center 11:18,065.10}{res}{center 12:0.00}{res}{center 12:86,877.45}}
{center:{txt}{lalign 22:Liabilities per Mem.}{res}{center 7:90.00}{res}{center 11:13.78}{res}{center 11:36.17}{res}{center 12:0.00}{res}{center 12:217.19}}
{center:{txt}{lalign 22:Goat Revenue}{res}{center 7:90.00}{res}{center 11:111.86}{res}{center 11:203.73}{res}{center 12:0.00}{res}{center 12:1,029.40}}
{center:{txt}{lalign 22:Goat Rev. per Mem.}{res}{center 7:90.00}{res}{center 11:0.22}{res}{center 11:0.46}{res}{center 12:0.00}{res}{center 12:3.02}}
{center:{txt}{lalign 22:Net Revenue}{res}{center 7:90.00}{res}{center 11:3.47}{res}{center 11:8.25}{res}{center 12:-7.93}{res}{center 12:65.55}}
{center:{txt}{lalign 22:Net Rev. per Mem.}{res}{center 7:90.00}{res}{center 11:0.01}{res}{center 11:0.01}{res}{center 12:-0.01}{res}{center 12:0.06}}
{center:{txt}{lalign 22:Net Finances}{res}{center 7:90.00}{res}{center 11:25,982.99}{res}{center 11:46,455.02}{res}{center 12:-77,457.15}{res}{center 12:257,992.86}}
{center:{txt}{lalign 22:Net Fin. per Mem.}{res}{center 7:90.00}{res}{center 11:93.76}{res}{center 11:384.31}{res}{center 12:-193.64}{res}{center 12:3,600.00}}
{txt}{center:{hline 77}}
{txt}{center:Currency measured in USD}


{com}.         
.         
. * ------------------------------------------- 
. 
. 
. ** goat sales **
. 
. ** Co-op vars
. gl co_goatsales goats_sold goats_sold_member goatrev goatrev_member goatrev_sold ///
>                                 col_points index_CO_goatsales
{txt}
{com}. 
. ** HH vars
. gl hh_goatsales LS8 LS9 co_opgoatno co_opsalevalue ///
>                                 co_opshare visits_sale time_passed transp_cost index_salecost ///
>                                 net_goat_income netincome_goat
{txt}
{com}.         
. ** Co-op vars
. local listsize : list sizeof global(co_goatsales)
{txt}
{com}. tokenize $co_goatsales
{txt}
{com}. 
. forv i = 1/`listsize' {c -(}
{txt}  2{com}.                 
.         quietly {c -(}
{txt}  3{com}.                 sum ``i''
{txt}  4{com}.                 return list
{txt}  5{com}.                 scalar N_``i'' = r(N) // N
{txt}  6{com}.                 scalar mean_``i'' = r(mean) // mean
{txt}  7{com}.                 scalar sd_``i'' = r(sd)  // sd
{txt}  8{com}.                 scalar min_``i'' = r(min)  // sd
{txt}  9{com}.                 scalar max_``i'' = r(max)  // sd
{txt} 10{com}.                 
.         * matrix for table
.                 matrix mat_`i' = (N_``i'',mean_``i'',sd_``i'',min_``i'',max_``i'')
{txt} 11{com}.                 {c )-}
{txt} 12{com}. {c )-}
{txt}
{com}. matrix A = mat_1
{txt}
{com}. forv i = 2/`listsize' {c -(} // appends into single matrix
{txt}  2{com}.         matrix A = A \ mat_`i'
{txt}  3{com}. {c )-}
{txt}
{com}. 
. * Table
. frmttable using MDE_summary.doc, statmat(A) sdec(2) coljust(l;c;l;l) title("Co-op Level - Co-op Goat Sales: Summmary Stats") ///
> ctitle("","N","Mean","sd","Min","Max") ///
> rtitle("Goats Sold"\"Goats Sold per Mem."\"Goat Revenue"\"Goat Rev. per Mem."\"Rev. per Goat Sold"\"Collection Points"\"CO Goat Sales Index") ///
> note("Currency measured in USD") addtable replace
{res}
{txt}{center:Co-op Level - Co-op Goat Sales: Summmary Stats}
{txt}{center:{hline 63}}
{center:{txt}{lalign 21:}{txt}{center 7:N}{txt}{center 8:Mean}{txt}{center 8:sd}{txt}{center 7:Min}{txt}{center 10:Max}}
{txt}{center:{hline 63}}
{center:{txt}{lalign 21:Goats Sold}{res}{center 7:90.00}{res}{center 8:189.82}{res}{center 8:244.66}{res}{center 7:0.00}{res}{center 10:1,129.00}}
{center:{txt}{lalign 21:Goats Sold per Mem.}{res}{center 7:90.00}{res}{center 8:0.77}{res}{center 8:3.83}{res}{center 7:0.00}{res}{center 10:36.36}}
{center:{txt}{lalign 21:Goat Revenue}{res}{center 7:90.00}{res}{center 8:111.86}{res}{center 8:203.73}{res}{center 7:0.00}{res}{center 10:1,029.40}}
{center:{txt}{lalign 21:Goat Rev. per Mem.}{res}{center 7:90.00}{res}{center 8:0.22}{res}{center 8:0.46}{res}{center 7:0.00}{res}{center 10:3.02}}
{center:{txt}{lalign 21:Rev. per Goat Sold}{res}{center 7:70.00}{res}{center 8:0.81}{res}{center 8:0.62}{res}{center 7:0.00}{res}{center 10:2.64}}
{center:{txt}{lalign 21:Collection Points}{res}{center 7:92.00}{res}{center 8:61.94}{res}{center 8:27.88}{res}{center 7:1.11}{res}{center 10:100.00}}
{center:{txt}{lalign 21:CO Goat Sales Index}{res}{center 7:90.00}{res}{center 8:-0.01}{res}{center 8:0.92}{res}{center 7:-1.75}{res}{center 10:2.19}}
{txt}{center:{hline 63}}
{txt}{center:Currency measured in USD}


{com}.  
.  
. ** HH vars
. local listsize : list sizeof global(hh_goatsales)
{txt}
{com}. tokenize $hh_goatsales
{txt}
{com}. 
. forv i = 1/`listsize' {c -(} 
{txt}  2{com}.  
.         quietly {c -(}
{txt}  3{com}.                 sum ``i''
{txt}  4{com}.                 return list
{txt}  5{com}.                 scalar N_``i'' = r(N) // N
{txt}  6{com}.                 scalar mean_``i'' = r(mean) // mean
{txt}  7{com}.                 scalar sd_``i'' = r(sd)  // sd
{txt}  8{com}.                 scalar min_``i'' = r(min)  // sd
{txt}  9{com}.                 scalar max_``i'' = r(max)  // sd
{txt} 10{com}.                 
.         * matrix for table
.                 matrix mat_`i' = (N_``i'',mean_``i'',sd_``i'',min_``i'',max_``i'')
{txt} 11{com}.                 {c )-}
{txt} 12{com}. {c )-}
{txt}
{com}. matrix A = mat_1
{txt}
{com}. forv i = 2/`listsize' {c -(} // appends into single matrix
{txt}  2{com}.         matrix A = A \ mat_`i'
{txt}  3{com}. {c )-}
{txt}
{com}. 
. * Table
. frmttable using MDE_summary.doc, statmat(A) sdec(2) coljust(l;c;l;l) title("Co-op Level - HH Goat Sales: Summmary Stats") ///
> ctitle("","N","Mean","sd","Min","Max") ///
> rtitle("Goats Sold"\"Goat Revenue"\"# Sold through Co-op"\"Rev. through Co-op"\"% Sold through Co-op"\"Trader Visits per Sale"\"Time Passed"\"Transportation Costs"\"Sale Costs Index"\"Net Goat Income"\"Net Income per Goat") addtable replace 
{res}
{txt}{center:Co-op Level - HH Goat Sales: Summmary Stats}
{txt}{center:{hline 75}}
{center:{txt}{lalign 24:}{txt}{center 7:N}{txt}{center 11:Mean}{txt}{center 10:sd}{txt}{center 10:Min}{txt}{center 11:Max}}
{txt}{center:{hline 75}}
{center:{txt}{lalign 24:Goats Sold}{res}{center 7:92.00}{res}{center 11:2.11}{res}{center 10:0.85}{res}{center 10:0.80}{res}{center 11:5.56}}
{center:{txt}{lalign 24:Goat Revenue}{res}{center 7:92.00}{res}{center 11:17,457.45}{res}{center 10:8,027.81}{res}{center 10:4,865.86}{res}{center 11:60,121.95}}
{center:{txt}{lalign 24:# Sold through Co-op}{res}{center 7:92.00}{res}{center 11:0.44}{res}{center 10:0.64}{res}{center 10:0.00}{res}{center 11:3.22}}
{center:{txt}{lalign 24:Rev. through Co-op}{res}{center 7:92.00}{res}{center 11:3,863.52}{res}{center 10:5,347.00}{res}{center 10:0.00}{res}{center 11:22,372.73}}
{center:{txt}{lalign 24:% Sold through Co-op}{res}{center 7:92.00}{res}{center 11:0.20}{res}{center 10:0.25}{res}{center 10:0.00}{res}{center 11:0.91}}
{center:{txt}{lalign 24:Trader Visits per Sale}{res}{center 7:92.00}{res}{center 11:-5.62}{res}{center 10:50.99}{res}{center 10:-489.39}{res}{center 11:0.00}}
{center:{txt}{lalign 24:Time Passed}{res}{center 7:92.00}{res}{center 11:-0.81}{res}{center 10:0.90}{res}{center 10:-3.88}{res}{center 11:0.00}}
{center:{txt}{lalign 24:Transportation Costs}{res}{center 7:92.00}{res}{center 11:-0.07}{res}{center 10:0.40}{res}{center 10:-3.77}{res}{center 11:0.00}}
{center:{txt}{lalign 24:Sale Costs Index}{res}{center 7:92.00}{res}{center 11:0.03}{res}{center 10:0.78}{res}{center 10:-6.01}{res}{center 11:0.51}}
{center:{txt}{lalign 24:Net Goat Income}{res}{center 7:92.00}{res}{center 11:76.73}{res}{center 10:97.44}{res}{center 10:-194.03}{res}{center 11:439.59}}
{center:{txt}{lalign 24:Net Income per Goat}{res}{center 7:92.00}{res}{center 11:30.67}{res}{center 10:42.94}{res}{center 10:-155.23}{res}{center 11:108.79}}
{txt}{center:{hline 75}}


{com}.  
. * -------------------------------------------   
. 
.         
. ** Transparency **
. 
. ** Co-op vars
. gl co_trn CO_TRN1 CO_TRN2 ///
>         CO_TRN3 CO_TRN4 CO_TRN5 ///
>         CO_TRN6 CO_TRN7 index_CO_TRN
{txt}
{com}.         
. ** HH vars
. gl hh_trn HH_TRN1 HH_TRN2 ///
>         HH_TRN3 HH_TRN4 HH_TRN5 ///
>         HH_TRN6 HH_TRN7 index_HH_TRN index_dTRN avg_dTRN
{txt}
{com}. 
. 
. ** Co-op vars
. local listsize : list sizeof global(co_trn)
{txt}
{com}. tokenize $co_trn
{txt}
{com}. 
. forv i = 1/`listsize' {c -(}
{txt}  2{com}.                 
.         quietly {c -(}
{txt}  3{com}.                 sum ``i''
{txt}  4{com}.                 return list
{txt}  5{com}.                 scalar N_``i'' = r(N) // N
{txt}  6{com}.                 scalar mean_``i'' = r(mean) // mean
{txt}  7{com}.                 scalar sd_``i'' = r(sd)  // sd
{txt}  8{com}.                 scalar min_``i'' = r(min)  // sd
{txt}  9{com}.                 scalar max_``i'' = r(max)  // sd
{txt} 10{com}.                 
.         * matrix for table
.                 matrix mat_`i' = (N_``i'',mean_``i'',sd_``i'',min_``i'',max_``i'')
{txt} 11{com}.                 {c )-}
{txt} 12{com}. {c )-}
{txt}
{com}. matrix A = mat_1
{txt}
{com}. forv i = 2/`listsize' {c -(} // appends into single matrix
{txt}  2{com}.         matrix A = A \ mat_`i'
{txt}  3{com}. {c )-}
{txt}
{com}. 
. * Table
. frmttable using MDE_summary.doc, statmat(A) sdec(2) coljust(l;c;l;l) title("Co-op Level - Co-op Transparency: Summmary Stats") ///
> ctitle("","N","Mean","sd","Min","Max") ///
> rtitle("Mandate"\"Annual Report"\"Annual Budget"\"Financial Report"\"Meeting Minutes"\"Election Results"\"Sale Records"\"Co-op Index") addtable replace
{res}
{txt}{center:Co-op Level - Co-op Transparency: Summmary Stats}
{txt}{center:{hline 52}}
{center:{txt}{lalign 18:}{txt}{center 7:N}{txt}{center 6:Mean}{txt}{center 6:sd}{txt}{center 7:Min}{txt}{center 6:Max}}
{txt}{center:{hline 52}}
{center:{txt}{lalign 18:Mandate}{res}{center 7:90.00}{res}{center 6:0.81}{res}{center 6:0.38}{res}{center 7:0.00}{res}{center 6:1.00}}
{center:{txt}{lalign 18:Annual Report}{res}{center 7:90.00}{res}{center 6:0.84}{res}{center 6:0.36}{res}{center 7:0.00}{res}{center 6:1.00}}
{center:{txt}{lalign 18:Annual Budget}{res}{center 7:90.00}{res}{center 6:0.82}{res}{center 6:0.38}{res}{center 7:0.00}{res}{center 6:1.00}}
{center:{txt}{lalign 18:Financial Report}{res}{center 7:90.00}{res}{center 6:0.81}{res}{center 6:0.38}{res}{center 7:0.00}{res}{center 6:1.00}}
{center:{txt}{lalign 18:Meeting Minutes}{res}{center 7:90.00}{res}{center 6:0.78}{res}{center 6:0.40}{res}{center 7:0.00}{res}{center 6:1.00}}
{center:{txt}{lalign 18:Election Results}{res}{center 7:90.00}{res}{center 6:0.55}{res}{center 6:0.49}{res}{center 7:0.00}{res}{center 6:1.00}}
{center:{txt}{lalign 18:Sale Records}{res}{center 7:90.00}{res}{center 6:0.76}{res}{center 6:0.43}{res}{center 7:0.00}{res}{center 6:1.00}}
{center:{txt}{lalign 18:Co-op Index}{res}{center 7:90.00}{res}{center 6:0.17}{res}{center 6:0.91}{res}{center 7:-1.98}{res}{center 6:0.98}}
{txt}{center:{hline 52}}


{com}.  
.  
. ** HH vars
. local listsize : list sizeof global(hh_trn)
{txt}
{com}. tokenize $hh_trn
{txt}
{com}. 
. forv i = 1/`listsize' {c -(}
{txt}  2{com}.  
.         quietly {c -(}
{txt}  3{com}.                 sum ``i''
{txt}  4{com}.                 return list
{txt}  5{com}.                 scalar N_``i'' = r(N) // N
{txt}  6{com}.                 scalar mean_``i'' = r(mean) // mean
{txt}  7{com}.                 scalar sd_``i'' = r(sd)  // sd
{txt}  8{com}.                 scalar min_``i'' = r(min)  // sd
{txt}  9{com}.                 scalar max_``i'' = r(max)  // sd
{txt} 10{com}.                 
.         * matrix for table
.                 matrix mat_`i' = (N_``i'',mean_``i'',sd_``i'',min_``i'',max_``i'')
{txt} 11{com}.                 {c )-}
{txt} 12{com}. {c )-}
{txt}
{com}. matrix A = mat_1
{txt}
{com}. forv i = 2/`listsize' {c -(} // appends into single matrix
{txt}  2{com}.         matrix A = A \ mat_`i'
{txt}  3{com}. {c )-}
{txt}
{com}. 
. * Table
. frmttable using MDE_summary.doc, statmat(A) sdec(2) coljust(l;c;l;l) title("Co-op Level - HH Awareness: Summmary Stats") ///
> ctitle("","N","Mean","sd","Min","Max") ///
> rtitle("Mandate"\"Annual Report"\"Annual Budget"\"Financial Report"\"Meeting Minutes"\"Election Results"\"Sale Records"\"HH Index"\"Discrepancy Index"\"Avg. Discrepancy") addtable replace
{res}
{txt}{center:Co-op Level - HH Awareness: Summmary Stats}
{txt}{center:{hline 55}}
{center:{txt}{lalign 19:}{txt}{center 7:N}{txt}{center 7:Mean}{txt}{center 6:sd}{txt}{center 7:Min}{txt}{center 7:Max}}
{txt}{center:{hline 55}}
{center:{txt}{lalign 19:Mandate}{res}{center 7:92.00}{res}{center 7:0.45}{res}{center 6:0.28}{res}{center 7:0.00}{res}{center 7:1.00}}
{center:{txt}{lalign 19:Annual Report}{res}{center 7:92.00}{res}{center 7:0.52}{res}{center 6:0.30}{res}{center 7:0.00}{res}{center 7:1.00}}
{center:{txt}{lalign 19:Annual Budget}{res}{center 7:92.00}{res}{center 7:0.54}{res}{center 6:0.30}{res}{center 7:0.00}{res}{center 7:1.00}}
{center:{txt}{lalign 19:Financial Report}{res}{center 7:92.00}{res}{center 7:0.57}{res}{center 6:0.28}{res}{center 7:0.00}{res}{center 7:1.00}}
{center:{txt}{lalign 19:Meeting Minutes}{res}{center 7:92.00}{res}{center 7:0.52}{res}{center 6:0.29}{res}{center 7:0.00}{res}{center 7:1.00}}
{center:{txt}{lalign 19:Election Results}{res}{center 7:92.00}{res}{center 7:0.32}{res}{center 6:0.24}{res}{center 7:0.00}{res}{center 7:0.94}}
{center:{txt}{lalign 19:Sale Records}{res}{center 7:92.00}{res}{center 7:0.47}{res}{center 6:0.29}{res}{center 7:0.00}{res}{center 7:0.95}}
{center:{txt}{lalign 19:HH Index}{res}{center 7:92.00}{res}{center 7:0.07}{res}{center 6:1.05}{res}{center 7:-1.92}{res}{center 7:2.00}}
{center:{txt}{lalign 19:Discrepancy Index}{res}{center 7:90.00}{res}{center 7:-0.16}{res}{center 6:1.03}{res}{center 7:-3.28}{res}{center 7:1.32}}
{center:{txt}{lalign 19:Avg. Discrepancy}{res}{center 7:90.00}{res}{center 7:-0.33}{res}{center 6:0.22}{res}{center 7:-1.00}{res}{center 7:-0.02}}
{txt}{center:{hline 55}}


{com}.  
. * -------------------------------------------           
.         
. 
. 
. ** HH level dataset
. ********************************************* 
. clear
{txt}
{com}. use "$d3/r_HH_Merged_Ind.dta"
{txt}
{com}. 
. 
. ** HH indicators **
. 
. gl hh_summ COM3 COM8 index_HH_comm ///
>                                 LS8 LS9 co_opgoatno co_opsalevalue ///
>                                 net_goat_income index_HH_goatsales ///
>                                 visits_sale time_passed transp_cost index_salecost ///
>                                 index_dTRN ///
>                                 
{txt}
{com}. 
. local listsize : list sizeof global(hh_summ)
{txt}
{com}. tokenize $hh_summ
{txt}
{com}. 
. forv i = 1/`listsize' {c -(}
{txt}  2{com}.                 
.         quietly {c -(}
{txt}  3{com}.                 sum ``i''
{txt}  4{com}.                 return list
{txt}  5{com}.                 scalar N_``i'' = r(N) // N
{txt}  6{com}.                 scalar mean_``i'' = r(mean) // mean
{txt}  7{com}.                 scalar sd_``i'' = r(sd)  // sd
{txt}  8{com}.                 scalar min_``i'' = r(min)  // sd
{txt}  9{com}.                 scalar max_``i'' = r(max)  // sd
{txt} 10{com}.                 
.         * matrix for table
.                 matrix mat_`i' = (N_``i'',mean_``i'',sd_``i'',min_``i'',max_``i'')
{txt} 11{com}.                 {c )-}
{txt} 12{com}. {c )-}
{txt}
{com}. matrix A = mat_1
{txt}
{com}. forv i = 2/`listsize' {c -(} // appends into single matrix
{txt}  2{com}.         matrix A = A \ mat_`i'
{txt}  3{com}. {c )-}
{txt}
{com}. 
. * Table
. frmttable using HH_summary.tex, tex statmat(A) sdec(2) coljust(l;c;l;l) title("Household Indicators - Summmary Statistics") ///
> ctitle("","N","Mean","sd","Min","Max") ///
> rtitle("HH info sales"\"HH info activities"\"HH level index"\"Goats Sold"\"Goat Revenue"\"# Sold through Co-op"\"Rev. through Co-op"\"Net Goat Income"\"HH Goat Sales Index"\"Trader Visits per Sale"\"Time Passed"\"Transportation Costs"\"Sale Costs Index"\"Transparency Discrepancy Index")replace
{res}
{txt}{center:Household Indicators - Summmary Statistics}
{txt}{center:{hline 80}}
{center:{txt}{lalign 32:}{txt}{center 10:N}{txt}{center 7:Mean}{txt}{center 8:sd}{txt}{center 11:Min}{txt}{center 10:Max}}
{txt}{center:{hline 80}}
{center:{txt}{lalign 32:HH info sales}{res}{center 10:1,261.00}{res}{center 7:1.37}{res}{center 8:1.75}{res}{center 11:0.00}{res}{center 10:10.00}}
{center:{txt}{lalign 32:HH info activities}{res}{center 10:2,149.00}{res}{center 7:1.10}{res}{center 8:3.50}{res}{center 11:0.00}{res}{center 10:100.00}}
{center:{txt}{lalign 32:HH level index}{res}{center 10:1,207.00}{res}{center 7:0.25}{res}{center 8:0.89}{res}{center 11:-0.47}{res}{center 10:9.14}}
{center:{txt}{lalign 32:Goats Sold}{res}{center 10:2,448.00}{res}{center 7:1.14}{res}{center 8:1.87}{res}{center 11:0.00}{res}{center 10:24.00}}
{center:{txt}{lalign 32:Goat Revenue}{res}{center 10:2,448.00}{res}{center 7:93.84}{res}{center 8:150.77}{res}{center 11:0.00}{res}{center 10:1,121.67}}
{center:{txt}{lalign 32:# Sold through Co-op}{res}{center 10:2,448.00}{res}{center 7:0.25}{res}{center 8:0.93}{res}{center 11:0.00}{res}{center 10:15.00}}
{center:{txt}{lalign 32:Rev. through Co-op}{res}{center 10:2,448.00}{res}{center 7:22.14}{res}{center 8:84.76}{res}{center 11:0.00}{res}{center 10:1,257.30}}
{center:{txt}{lalign 32:Net Goat Income}{res}{center 10:2,448.00}{res}{center 7:51.15}{res}{center 8:295.51}{res}{center 11:-9,867.33}{res}{center 10:1,121.67}}
{center:{txt}{lalign 32:HH Goat Sales Index}{res}{center 10:2,448.00}{res}{center 7:-0.07}{res}{center 8:0.90}{res}{center 11:-3.00}{res}{center 10:12.57}}
{center:{txt}{lalign 32:Trader Visits per Sale}{res}{center 10:1,276.00}{res}{center 7:-4.22}{res}{center 8:139.98}{res}{center 11:-5,000.33}{res}{center 10:0.00}}
{center:{txt}{lalign 32:Time Passed}{res}{center 10:1,276.00}{res}{center 7:-0.79}{res}{center 8:2.16}{res}{center 11:-30.00}{res}{center 10:0.00}}
{center:{txt}{lalign 32:Transportation Costs}{res}{center 10:1,276.00}{res}{center 7:-0.23}{res}{center 8:6.94}{res}{center 11:-247.50}{res}{center 10:0.00}}
{center:{txt}{lalign 32:Sale Costs Index}{res}{center 10:1,276.00}{res}{center 7:-0.08}{res}{center 8:0.80}{res}{center 11:-24.13}{res}{center 10:0.09}}
{center:{txt}{lalign 32:Transparency Discrepancy Index}{res}{center 10:1,647.00}{res}{center 7:0.31}{res}{center 8:0.98}{res}{center 11:-1.05}{res}{center 10:2.00}}
{txt}{center:{hline 80}}


{com}.  
. 
. 
. ** communication **
. gl hh_comm COM3 COM8 index_HH_comm HHcontact
{txt}
{com}.         
. ** Co-op vars
. local listsize : list sizeof global(hh_comm)
{txt}
{com}. tokenize $hh_comm
{txt}
{com}. 
. forv i = 1/`listsize' {c -(}
{txt}  2{com}.                 
.         quietly {c -(}
{txt}  3{com}.                 sum ``i''
{txt}  4{com}.                 return list
{txt}  5{com}.                 scalar N_``i'' = r(N) // N
{txt}  6{com}.                 scalar mean_``i'' = r(mean) // mean
{txt}  7{com}.                 scalar sd_``i'' = r(sd)  // sd
{txt}  8{com}.                 scalar min_``i'' = r(min)  // sd
{txt}  9{com}.                 scalar max_``i'' = r(max)  // sd
{txt} 10{com}.                 
.         * matrix for table
.                 matrix mat_`i' = (N_``i'',mean_``i'',sd_``i'',min_``i'',max_``i'')
{txt} 11{com}.                 {c )-}
{txt} 12{com}. {c )-}
{txt}
{com}. matrix A = mat_1
{txt}
{com}. forv i = 2/`listsize' {c -(} // appends into single matrix
{txt}  2{com}.         matrix A = A \ mat_`i'
{txt}  3{com}. {c )-}
{txt}
{com}. 
. * Table
. frmttable using MDE_summary.doc, statmat(A) sdec(2) coljust(l;c;l;l) title("HH Level - Communication: Summmary Stats") ///
> ctitle("","N","Mean","sd","Min","Max") ///
> rtitle("HH info sales"\"HH info activities"\"HH level index"\"Total HH Contact") addtable replace
{res}
{txt}{center:HH Level - Communication: Summmary Stats}
{txt}{center:{hline 59}}
{center:{txt}{lalign 20:}{txt}{center 10:N}{txt}{center 6:Mean}{txt}{center 6:sd}{txt}{center 7:Min}{txt}{center 8:Max}}
{txt}{center:{hline 59}}
{center:{txt}{lalign 20:HH info sales}{res}{center 10:1,261.00}{res}{center 6:1.37}{res}{center 6:1.75}{res}{center 7:0.00}{res}{center 8:10.00}}
{center:{txt}{lalign 20:HH info activities}{res}{center 10:2,149.00}{res}{center 6:1.10}{res}{center 6:3.50}{res}{center 7:0.00}{res}{center 8:100.00}}
{center:{txt}{lalign 20:HH level index}{res}{center 10:1,207.00}{res}{center 6:0.25}{res}{center 6:0.89}{res}{center 7:-0.47}{res}{center 8:9.14}}
{center:{txt}{lalign 20:Total HH Contact}{res}{center 10:1,207.00}{res}{center 6:2.56}{res}{center 6:3.06}{res}{center 7:0.00}{res}{center 8:31.00}}
{txt}{center:{hline 59}}


{com}.  
.  
. * ------------------------------------------- 
. 
. ** goat sales **
. 
. ** Co-op vars
. gl co_goatsales goats_sold goats_sold_member goatrev goatrev_member goatrev_sold ///
>                                 col_points index_CO_goatsales
{txt}
{com}. 
. gl hh_goatsales LS8 LS9 co_opgoatno co_opsalevalue ///
>                                 co_opshare visits_sale LS41 LS42 index_salecost ///
>                                 net_goat_income netincome_goat
{txt}
{com}. 
. 
.  
. ** HH vars
. local listsize : list sizeof global(hh_goatsales)
{txt}
{com}. tokenize $hh_goatsales
{txt}
{com}. 
. forv i = 1/`listsize' {c -(} 
{txt}  2{com}.  
.         quietly {c -(}
{txt}  3{com}.                 sum ``i''
{txt}  4{com}.                 return list
{txt}  5{com}.                 scalar N_``i'' = r(N) // N
{txt}  6{com}.                 scalar mean_``i'' = r(mean) // mean
{txt}  7{com}.                 scalar sd_``i'' = r(sd)  // sd
{txt}  8{com}.                 scalar min_``i'' = r(min)  // sd
{txt}  9{com}.                 scalar max_``i'' = r(max)  // sd
{txt} 10{com}.                 
.         * matrix for table
.                 matrix mat_`i' = (N_``i'',mean_``i'',sd_``i'',min_``i'',max_``i'')
{txt} 11{com}.                 {c )-}
{txt} 12{com}. {c )-}
{txt}
{com}. matrix A = mat_1
{txt}
{com}. forv i = 2/`listsize' {c -(} // appends into single matrix
{txt}  2{com}.         matrix A = A \ mat_`i'
{txt}  3{com}. {c )-}
{txt}
{com}. 
. * Table
. frmttable using MDE_summary.doc, statmat(A) sdec(2) coljust(l;c;l;l) title("HH Level - HH Goat Sales: Summmary Stats") ///
> ctitle("","N","Mean","sd","Min","Max") ///
> rtitle("Goats Sold"\"Goat Revenue"\"# Sold through Co-op"\"Rev. through Co-op"\"% Sold through Co-op"\"Trader Visits per Sale"\"Time Passed"\"Transportation Costs"\"Sale Costs Index"\"Net Goat Income"\"Net Income per Goat") ///
> note("Currency measured in USD") addtable replace 
{res}
{txt}{center:HH Level - HH Goat Sales: Summmary Stats}
{txt}{center:{hline 73}}
{center:{txt}{lalign 24:}{txt}{center 10:N}{txt}{center 7:Mean}{txt}{center 8:sd}{txt}{center 11:Min}{txt}{center 11:Max}}
{txt}{center:{hline 73}}
{center:{txt}{lalign 24:Goats Sold}{res}{center 10:2,448.00}{res}{center 7:1.14}{res}{center 8:1.87}{res}{center 11:0.00}{res}{center 11:24.00}}
{center:{txt}{lalign 24:Goat Revenue}{res}{center 10:2,448.00}{res}{center 7:93.84}{res}{center 8:150.77}{res}{center 11:0.00}{res}{center 11:1,121.67}}
{center:{txt}{lalign 24:# Sold through Co-op}{res}{center 10:2,448.00}{res}{center 7:0.25}{res}{center 8:0.93}{res}{center 11:0.00}{res}{center 11:15.00}}
{center:{txt}{lalign 24:Rev. through Co-op}{res}{center 10:2,448.00}{res}{center 7:22.14}{res}{center 8:84.76}{res}{center 11:0.00}{res}{center 11:1,257.30}}
{center:{txt}{lalign 24:% Sold through Co-op}{res}{center 10:2,448.00}{res}{center 7:0.10}{res}{center 8:0.29}{res}{center 11:0.00}{res}{center 11:1.00}}
{center:{txt}{lalign 24:Trader Visits per Sale}{res}{center 10:1,276.00}{res}{center 7:-4.22}{res}{center 8:139.98}{res}{center 11:-5,000.33}{res}{center 11:0.00}}
{center:{txt}{lalign 24:Time Passed}{res}{center 10:1,276.00}{res}{center 7:0.79}{res}{center 8:2.16}{res}{center 11:0.00}{res}{center 11:30.00}}
{center:{txt}{lalign 24:Transportation Costs}{res}{center 10:1,276.00}{res}{center 7:23.14}{res}{center 8:701.05}{res}{center 11:0.00}{res}{center 11:25,000.00}}
{center:{txt}{lalign 24:Sale Costs Index}{res}{center 10:1,276.00}{res}{center 7:-0.08}{res}{center 8:0.80}{res}{center 11:-24.13}{res}{center 11:0.09}}
{center:{txt}{lalign 24:Net Goat Income}{res}{center 10:2,448.00}{res}{center 7:51.15}{res}{center 8:295.51}{res}{center 11:-9,867.33}{res}{center 11:1,121.67}}
{center:{txt}{lalign 24:Net Income per Goat}{res}{center 10:1,214.00}{res}{center 7:62.76}{res}{center 8:72.14}{res}{center 11:-1,233.42}{res}{center 11:723.69}}
{txt}{center:{hline 73}}
{txt}{center:Currency measured in USD}


{com}.  
. * -------------------------------------------   
. 
.         
. ** Transparency **
. 
. ** HH vars
. gl hh_trn_d HH_TRN1 HH_TRN2 ///
>         HH_TRN3 HH_TRN4 HH_TRN5 ///
>         HH_TRN6 HH_TRN7 index_HH_TRN avg_dTRN
{txt}
{com}. 
. 
. ** Co-op vars
. local listsize : list sizeof global(co_trn)
{txt}
{com}. tokenize $co_trn
{txt}
{com}. 
. forv i = 1/`listsize' {c -(}
{txt}  2{com}.                 
.         quietly {c -(}
{txt}  3{com}.                 sum ``i''
{txt}  4{com}.                 return list
{txt}  5{com}.                 scalar N_``i'' = r(N) // N
{txt}  6{com}.                 scalar mean_``i'' = r(mean) // mean
{txt}  7{com}.                 scalar sd_``i'' = r(sd)  // sd
{txt}  8{com}.                 scalar min_``i'' = r(min)  // sd
{txt}  9{com}.                 scalar max_``i'' = r(max)  // sd
{txt} 10{com}.                 
.         * matrix for table
.                 matrix mat_`i' = (N_``i'',mean_``i'',sd_``i'',min_``i'',max_``i'')
{txt} 11{com}.                 {c )-}
{txt} 12{com}. {c )-}
{txt}
{com}. matrix A = mat_1
{txt}
{com}. forv i = 2/`listsize' {c -(} // appends into single matrix
{txt}  2{com}.         matrix A = A \ mat_`i'
{txt}  3{com}. {c )-}
{txt}
{com}. 
. * Table
. frmttable using MDE_summary.doc, statmat(A) sdec(2) coljust(l;c;l;l) title("HH Level - Co-op Transparency: Summmary Stats") ///
> ctitle("","N","Mean","sd","Min","Max") ///
> rtitle("Mandate"\"Annual Report"\"Annual Budget"\"Financial Report"\"Meeting Minutes"\"Election Results"\"Sale Records"\"Co-op Index") addtable replace
{res}
{txt}{center:HH Level - Co-op Transparency: Summmary Stats}
{txt}{center:{hline 55}}
{center:{txt}{lalign 18:}{txt}{center 10:N}{txt}{center 6:Mean}{txt}{center 6:sd}{txt}{center 7:Min}{txt}{center 6:Max}}
{txt}{center:{hline 55}}
{center:{txt}{lalign 18:Mandate}{res}{center 10:2,400.00}{res}{center 6:0.80}{res}{center 6:0.37}{res}{center 7:0.00}{res}{center 6:1.00}}
{center:{txt}{lalign 18:Annual Report}{res}{center 10:2,400.00}{res}{center 6:0.83}{res}{center 6:0.34}{res}{center 7:0.00}{res}{center 6:1.00}}
{center:{txt}{lalign 18:Annual Budget}{res}{center 10:2,400.00}{res}{center 6:0.81}{res}{center 6:0.37}{res}{center 7:0.00}{res}{center 6:1.00}}
{center:{txt}{lalign 18:Financial Report}{res}{center 10:2,400.00}{res}{center 6:0.80}{res}{center 6:0.37}{res}{center 7:0.00}{res}{center 6:1.00}}
{center:{txt}{lalign 18:Meeting Minutes}{res}{center 10:2,400.00}{res}{center 6:0.77}{res}{center 6:0.39}{res}{center 7:0.00}{res}{center 6:1.00}}
{center:{txt}{lalign 18:Election Results}{res}{center 10:2,400.00}{res}{center 6:0.54}{res}{center 6:0.47}{res}{center 7:0.00}{res}{center 6:1.00}}
{center:{txt}{lalign 18:Sale Records}{res}{center 10:2,400.00}{res}{center 6:0.76}{res}{center 6:0.41}{res}{center 7:0.00}{res}{center 6:1.00}}
{center:{txt}{lalign 18:Co-op Index}{res}{center 10:2,400.00}{res}{center 6:0.20}{res}{center 6:0.92}{res}{center 7:-1.97}{res}{center 6:1.06}}
{txt}{center:{hline 55}}


{com}.  
.  
. ** HH vars
. local listsize : list sizeof global(hh_trn_d)
{txt}
{com}. tokenize $hh_trn_d
{txt}
{com}. 
. forv i = 1/`listsize' {c -(}
{txt}  2{com}.  
.         quietly {c -(}
{txt}  3{com}.                 sum ``i''
{txt}  4{com}.                 return list
{txt}  5{com}.                 scalar N_``i'' = r(N) // N
{txt}  6{com}.                 scalar mean_``i'' = r(mean) // mean
{txt}  7{com}.                 scalar sd_``i'' = r(sd)  // sd
{txt}  8{com}.                 scalar min_``i'' = r(min)  // sd
{txt}  9{com}.                 scalar max_``i'' = r(max)  // sd
{txt} 10{com}.                 
.         * matrix for table
.                 matrix mat_`i' = (N_``i'',mean_``i'',sd_``i'',min_``i'',max_``i'')
{txt} 11{com}.                 {c )-}
{txt} 12{com}. {c )-}
{txt}
{com}. matrix A = mat_1
{txt}
{com}. forv i = 2/`listsize' {c -(} // appends into single matrix
{txt}  2{com}.         matrix A = A \ mat_`i'
{txt}  3{com}. {c )-}
{txt}
{com}. 
. * Table
. frmttable using MDE_summary.doc, statmat(A) sdec(2) coljust(l;c;l;l) title("HH Level - HH Awareness: Summmary Stats") ///
> ctitle("","N","Mean","sd","Min","Max") ///
> rtitle("Mandate"\"Annual Report"\"Annual Budget"\"Financial Report"\"Meeting Minutes"\"Election Results"\"Sale Records"\"HH Index"\"Avg. Discrepancy") addtable replace
{res}
{txt}{center:HH Level - HH Awareness: Summmary Stats}
{txt}{center:{hline 55}}
{center:{txt}{lalign 18:}{txt}{center 10:N}{txt}{center 6:Mean}{txt}{center 6:sd}{txt}{center 7:Min}{txt}{center 6:Max}}
{txt}{center:{hline 55}}
{center:{txt}{lalign 18:Mandate}{res}{center 10:1,930.00}{res}{center 6:0.45}{res}{center 6:0.50}{res}{center 7:0.00}{res}{center 6:1.00}}
{center:{txt}{lalign 18:Annual Report}{res}{center 10:1,938.00}{res}{center 6:0.52}{res}{center 6:0.50}{res}{center 7:0.00}{res}{center 6:1.00}}
{center:{txt}{lalign 18:Annual Budget}{res}{center 10:1,952.00}{res}{center 6:0.54}{res}{center 6:0.50}{res}{center 7:0.00}{res}{center 6:1.00}}
{center:{txt}{lalign 18:Financial Report}{res}{center 10:1,937.00}{res}{center 6:0.56}{res}{center 6:0.50}{res}{center 7:0.00}{res}{center 6:1.00}}
{center:{txt}{lalign 18:Meeting Minutes}{res}{center 10:1,996.00}{res}{center 6:0.54}{res}{center 6:0.50}{res}{center 7:0.00}{res}{center 6:1.00}}
{center:{txt}{lalign 18:Election Results}{res}{center 10:1,821.00}{res}{center 6:0.32}{res}{center 6:0.47}{res}{center 7:0.00}{res}{center 6:1.00}}
{center:{txt}{lalign 18:Sale Records}{res}{center 10:1,919.00}{res}{center 6:0.48}{res}{center 6:0.50}{res}{center 7:0.00}{res}{center 6:1.00}}
{center:{txt}{lalign 18:HH Index}{res}{center 10:1,667.00}{res}{center 6:0.21}{res}{center 6:1.00}{res}{center 7:-0.92}{res}{center 6:1.59}}
{center:{txt}{lalign 18:Avg. Discrepancy}{res}{center 10:2,092.00}{res}{center 6:0.46}{res}{center 6:0.37}{res}{center 7:0.00}{res}{center 6:1.00}}
{txt}{center:{hline 55}}


{com}.  
.         
. 
{txt}end of do-file

{com}. do "/var/folders/_d/jk4yrpt11pbc34dyw8cg5kjm0000gn/T//SD03049.000000"
{txt}
{com}. clear
{txt}
{com}. use "$d3/r_CO_Merged_Ind.dta"
{txt}
{com}. 
{txt}end of do-file

{com}. do "/var/folders/_d/jk4yrpt11pbc34dyw8cg5kjm0000gn/T//SD03049.000000"
{txt}
{com}. sum PNG4, d

      {txt}PNG4 Over the next 6 months,(apart from savings)
               what is your projection of tota
{hline 61}
      Percentiles      Smallest
 1%    {res}        0              0
{txt} 5%    {res}        0              0
{txt}10%    {res}        0              0       {txt}Obs         {res}         90
{txt}25%    {res}     2000              0       {txt}Sum of Wgt. {res}         90

{txt}50%    {res}    35000                      {txt}Mean          {res}   103699
                        {txt}Largest       Std. Dev.     {res} 218025.8
{txt}75%    {res}  72516.5         700000
{txt}90%    {res}   300000         800000       {txt}Variance      {res} 4.75e+10
{txt}95%    {res}   475000         800000       {txt}Skewness      {res} 4.017894
{txt}99%    {res}  1500000        1500000       {txt}Kurtosis      {res} 22.31015
{txt}
{com}. sum expected_rev, d

                        {txt}expected_rev
{hline 61}
      Percentiles      Smallest
 1%    {res}        0              0
{txt} 5%    {res}        0              0
{txt}10%    {res}        0              0       {txt}Obs         {res}         90
{txt}25%    {res}     19.8              0       {txt}Sum of Wgt. {res}         90

{txt}50%    {res}    346.5                      {txt}Mean          {res}  1026.62
                        {txt}Largest       Std. Dev.     {res} 2158.455
{txt}75%    {res} 717.9133           6930
{txt}90%    {res}     2970           7920       {txt}Variance      {res}  4658930
{txt}95%    {res}   4702.5           7920       {txt}Skewness      {res} 4.017894
{txt}99%    {res}    14850          14850       {txt}Kurtosis      {res} 22.31015
{txt}
{com}. 
{txt}end of do-file

{com}. do "/var/folders/_d/jk4yrpt11pbc34dyw8cg5kjm0000gn/T//SD03049.000000"
{txt}
{com}. 
. clear 
{txt}
{com}. use "$d3/r_CO_Merged_Ind.dta"
{txt}
{com}. 
. * ---------------------------------------------------
. ** Add true treatment status to this dataset
. * Merge treatment status from original randomization
. 
. * Original dataset
. clear
{txt}
{com}. use "/Users/scottmiller/Dropbox (UFL)/LSIL/Data/Previous Versions/Baseline/Merged/Baseline_Merged_Str.dta", clear
{txt}( )

{com}. recast str99 idx // idx is str99 in r_Baseline_Merged_Str
{txt}
{com}. 
. keep idx treat
{txt}
{com}. 
. save "$d3/treat.dta", replace
{txt}file /Users/scottmiller/Dropbox (UFL)/LSIL/Pre-Analysis Plan/Stata Files/PAP Data/LSIL-DATA_scott/VCC baseline aug 20 2018/treat.dta saved

{com}. 
. merge 1:1 idx using "$d3/r_CO_Merged_Ind.dta"
{res}
{txt}{col 5}Result{col 38}# of obs.
{col 5}{hline 41}
{col 5}not matched{col 30}{res}              14
{txt}{col 9}from master{col 30}{res}              14{txt}  (_merge==1)
{col 9}from using{col 30}{res}               0{txt}  (_merge==2)

{col 5}matched{col 30}{res}              92{txt}  (_merge==3)
{col 5}{hline 41}

{com}. drop if _merge == 1 // banke district in original treatment status
{txt}(14 observations deleted)

{com}. 
. save "$d3/r_CO_Merged_Ind_treat.dta", replace
{txt}file /Users/scottmiller/Dropbox (UFL)/LSIL/Pre-Analysis Plan/Stata Files/PAP Data/LSIL-DATA_scott/VCC baseline aug 20 2018/r_CO_Merged_Ind_treat.dta saved

{com}. * ---------------------------------------------------
. 
. * Balance tables after dropping Banke district
. clear 
{txt}
{com}. use "$d3/r_CO_Merged_Ind_treat.dta"
{txt}( )

{com}. 
. 
. lab var COMM6_1 "Co-op sends sale info by word-of-mouth"
{txt}
{com}. lab var COMM6_2 "Co-op sends sale info by SMS to SHG leaders"
{txt}
{com}. lab var COMM6_3 "Co-op sends sale info by SMS to members"
{txt}
{com}. lab var COMM6_4 "Co-op sends sale info by phone call to SHG leaders"
{txt}
{com}. lab var COMM6_5 "Co-op sends sale info by phone call to members"
{txt}
{com}. lab var COMM6_6 "Co-op sends sale info by announcement at SHG meetings"
{txt}
{com}. lab var COMM6_7 "Co-op sends sale info by announcement at general assembly"
{txt}
{com}. lab var COMM6_8 "Co-op does not send sale info"
{txt}
{com}. 
. lab var COMM1a "No. of times initiated SHG contact by SMS in past month"
{txt}
{com}. lab var COMM1b "No. of times initiated SHG contact by phone in past month"
{txt}
{com}. lab var COMM1c "No. of times initiated SHG contact by email in past month"
{txt}
{com}. lab var COMM1d "No. of times initiated SHG contact face-to-face in past month"
{txt}
{com}. 
. lab var COMM2a "No. of times SHG leader initiated contact by SMS in past month"
{txt}
{com}. lab var COMM2b "No. of times SHG leader initiated contact by phone in past month"
{txt}
{com}. lab var COMM2c "No. of times SHG leader initiated  contact by email in past month"
{txt}
{com}. lab var COMM2d "No. of times SHG leader initiated contact face-to-face in past month"
{txt}
{com}. 
. foreach v of varlist COMM8a COMM8b ///
> COMM8c COMM8d COMM8e ///
> COMM8f {c -(}
{txt}  2{com}.         qui tab `v', g(`v'_)
{txt}  3{com}. {c )-}
{txt}
{com}. 
. local j 1
{txt}
{com}. foreach i in seriously somewhat "doesn't" {c -(}
{txt}  2{com}.         lab var COMM8a_`j' "Internet `i' limits communication"
{txt}  3{com}.         local ++j
{txt}  4{com}. {c )-}
{txt}
{com}. 
. local j 1
{txt}
{com}. foreach i in seriously somewhat "doesn't" {c -(}
{txt}  2{com}.         lab var COMM8b_`j' "Mobile network `i' limits communication"
{txt}  3{com}.         local ++j
{txt}  4{com}. {c )-}
{txt}
{com}. 
. local j 1
{txt}
{com}. foreach i in seriously somewhat "doesn't" {c -(}
{txt}  2{com}.         lab var COMM8c_`j' "Cost of SMS `i' limits communication"
{txt}  3{com}.         local ++j
{txt}  4{com}. {c )-}
{txt}
{com}. 
. local j 1
{txt}
{com}. foreach i in seriously somewhat "doesn't" {c -(}
{txt}  2{com}.         lab var COMM8d_`j' "Distance between members `i' limits communication"
{txt}  3{com}.         local ++j
{txt}  4{com}. {c )-}
{txt}
{com}. 
. local j 1
{txt}
{com}. foreach i in seriously somewhat "doesn't" {c -(}
{txt}  2{com}.         lab var COMM8e_`j' "Road quality `i' limits communication"
{txt}  3{com}.         local ++j
{txt}  4{com}. {c )-}
{txt}
{com}. 
. local j 1
{txt}
{com}. foreach i in seriously somewhat "doesn't" {c -(}
{txt}  2{com}.         lab var COMM8f_`j' "Access to transport `i' limits communication"
{txt}  3{com}.         local ++j
{txt}  4{com}. {c )-}
{txt}
{com}. 
. foreach v of varlist COMM6_1 COMM6_2 COMM6_3 ///
> COMM6_4 COMM6_5 COMM6_6 ///
> COMM6_7 COMM6_8 ///
> COMM8a_1 COMM8b_1 ///
> COMM8c_1 COMM8d_1 ///
> COMM8e_1  COMM8f_1 ///
> COMM1a COMM1b COMM1c ///
> COMM1d ///
> COMM2a COMM2b COMM2c ///
> COMM2d {c -(}
{txt}  2{com}.         cap destring `v', replace
{txt}  3{com}. {c )-}
{txt}
{com}. 
. 
. lab var revenue "Co-op Revenue (USD)"
{txt}
{com}. lab var rev_member "Co-op Revenue per Member (USD)"
{txt}
{com}. lab var costs "Co-op Costs (UDS)"
{txt}
{com}. lab var cost_mem "Co-op Costs per Member (USD)"
{txt}
{com}. lab var net_rev "Co-op Net Revenue (UDS)"
{txt}
{com}. lab var net_rev_member "Co-op Net Revenue per Member (USD)"
{txt}
{com}. lab var goats_sold "Co-op Goats Sold"
{txt}
{com}. lab var goatssold_mem "Co-op Goats Sold per Member"
{txt}
{com}. lab var MAN3 "\# of Members"
{txt}
{com}. lab var PNG1 "Does the cooperative have a written business plan?"
{txt}
{com}. lab var PNG2 "Planning Tume Horizon (Years)"
{txt}
{com}. lab var PNG3 "Expected Goats Sold over next 6 months"
{txt}
{com}. lab var expected_rev "Expected Revenue over next 6 months (USD)"
{txt}
{com}. lab var index_PNG "Planning & Goals Summary Index"
{txt}
{com}. lab var CO_TRN1 "Co-op makes its mandate available to its members"
{txt}
{com}. lab var CO_TRN2 "Co-op makes its annual report available to its members"
{txt}
{com}. lab var CO_TRN3 "Co-op makes its annual budget available to its members"
{txt}
{com}. lab var CO_TRN4 "Co-op makes its financial report available to its members"
{txt}
{com}. lab var CO_TRN5 "Co-op makes its meeting minutes available to its members"
{txt}
{com}. lab var CO_TRN6 "Co-op makes its election results available to its members"
{txt}
{com}. lab var CO_TRN7 "Co-op makes its sale records available to its members"
{txt}
{com}. lab var GTT1 "% of goats expected to be sold through co-op"
{txt}
{com}. lab var GTT2 "% of goats expected to be sold through other channels"
{txt}
{com}. lab var GTT3 "% of goats expected to not be sold"
{txt}
{com}. 
. *iebaltable
. 
. iebaltab revenue rev_member costs cost_mem net_rev net_rev_member ///
>                 goats_sold goatssold_mem MAN3 ///
>                 PNG1 PNG2 PNG3 expected_rev index_PNG ///
>                 COMM6_1 COMM6_2 ///
>                 COMM6_4 COMM6_5 COMM6_6 ///
>                 COMM6_7 COMM6_8 ///
>                 COMM8a_1 COMM8b_1 ///
>                 COMM8c_1 COMM8d_1 ///
>                 COMM8e_1  COMM8f_1 ///
>                 CO_TRN1 CO_TRN2 CO_TRN3 CO_TRN4 CO_TRN5 ///
>                 CO_TRN6 CO_TRN7 ///
>                 GTT1 GTT2 GTT3, rowvarlabels grpvar(treat) ///
>                 savetex("/Users/scottmiller/Dropbox (UFL)/LSIL/Pre-Analysis Plan/Stata Files/iebaltab1_nobanke_PAP.tex") replace
{res}{phang}Balance table saved to: {browse "/Users/scottmiller/Dropbox (UFL)/LSIL/Pre-Analysis Plan/Stata Files/iebaltab1_nobanke_PAP.tex":/Users/scottmiller/Dropbox (UFL)/LSIL/Pre-Analysis Plan/Stata Files/iebaltab1_nobanke_PAP.tex} 
{txt}
{smcl}
{com}. 
. 
. * ---------------------------------------------------
. ** Add true treatment status to this dataset
. * Merge treatment status from original randomization
. * Original dataset
. clear
{txt}
{com}. use "$d3/r_HH_Merged_Ind.dta"
{txt}
{com}. drop _merge
{txt}
{com}. 
. merge m:1 idx using "$d3/treat.dta"
{res}
{txt}{col 5}Result{col 38}# of obs.
{col 5}{hline 41}
{col 5}not matched{col 30}{res}              14
{txt}{col 9}from master{col 30}{res}               0{txt}  (_merge==1)
{col 9}from using{col 30}{res}              14{txt}  (_merge==2)

{col 5}matched{col 30}{res}           2,448{txt}  (_merge==3)
{col 5}{hline 41}

{com}. drop if _merge == 1 // banke district in original treatment status
{txt}(0 observations deleted)

{com}. drop if idx == "Karmath SEWC 2" | idx == "Lekhbesi SEWC 1"
{txt}(0 observations deleted)

{com}. 
. save "$d3/r_HH_Merged_Ind_treat.dta", replace
{txt}file /Users/scottmiller/Dropbox (UFL)/LSIL/Pre-Analysis Plan/Stata Files/PAP Data/LSIL-DATA_scott/VCC baseline aug 20 2018/r_HH_Merged_Ind_treat.dta saved

{com}. * ---------------------------------------------------           
.                 
.                 
. clear
{txt}
{com}. use "$d3/r_HH_Merged_Ind_treat.dta"
{txt}
{com}. 
. replace HHR14 = . if HHR4 < 18
{txt}(2 real changes made, 2 to missing)

{com}. 
. *rename Co_opTransparencyTransparency_no Co_opTransparency_no
. *rename Live_EntexofemaleExotic_Female Live_Exotic_Female
. *rename Live_EntcrofemaleCross_Breed_Fem Live_Cross_Breed_Fem
. *rename Live_EntCro_breed_female_goats Live_breed_female_goats
. 
. foreach v of var * {c -(}
{txt}  2{com}.         cap local vv = subinstr("`v'", "Follow_up", "Follup",.) // names too long for macros
{txt}  3{com}.         if _rc == 0 {c -(}
{txt}  4{com}.                 rename `v' `vv'
{txt}  5{com}.                 local v `vv'
{txt}  6{com}.         {c )-}
{txt}  7{com}.         cap local vv = subinstr("`v'", "Food_Consumption", "Food_Cons",.) // names too long for macros
{txt}  8{com}.         if _rc == 0 {c -(}
{txt}  9{com}.                 rename `v' `vv'
{txt} 10{com}.                 local v `vv'
{txt} 11{com}.         {c )-}
{txt} 12{com}.         cap local vv = subinstr("`v'", "_related_", "",.) // names too long for macros
{txt} 13{com}.         if _rc == 0 {c -(}
{txt} 14{com}.                 rename `v' `vv'
{txt} 15{com}.                 local v `vv'
{txt} 16{com}.         {c )-}
{txt} 17{com}.         cap local vv = subinstr("`v'", "Enterprises", "Enterp",.) // names too long for macros
{txt} 18{com}.         if _rc == 0 {c -(}
{txt} 19{com}.                 rename `v' `vv'
{txt} 20{com}.                 local v `vv'
{txt} 21{com}.         {c )-}
{txt} 22{com}.         cap local vv = subinstr("`v'", "questionnaire", "",.) // names too long for macros
{txt} 23{com}.         if _rc == 0 {c -(}
{txt} 24{com}.                 rename `v' `vv'
{txt} 25{com}.                 local v `vv'
{txt} 26{com}.         {c )-}
{txt} 27{com}.         local l`v' : variable label `v'
{txt} 28{com}.         local ll`v': val lab `v'
{txt} 29{com}.         if `"`l`v''"' == "" {c -(}
{txt} 30{com}.                 local l`v' "`v'"
{txt} 31{com}.         {c )-}
{txt} 32{com}. {c )-}
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}  (all {it:newnames}=={it:oldnames})

{com}. lab var COM3 "No. of times in past 6 months receive info about livestock sales"
{txt}
{com}. 
. * Winsorize LS9 by treatment status
. sum LS9, d

     {txt}LS9 How much did you earn in total from this sale?
{hline 61}
      Percentiles      Smallest
 1%    {res}        0              0
{txt} 5%    {res}        0              0
{txt}10%    {res}        0              0       {txt}Obs         {res}      2,448
{txt}25%    {res}        0              0       {txt}Sum of Wgt. {res}      2,448

{txt}50%    {res}        0                      {txt}Mean          {res} 93.84167
                        {txt}Largest       Std. Dev.     {res} 150.7685
{txt}75%    {res}    138.6        1121.67
{txt}90%    {res}    267.3        1121.67       {txt}Variance      {res} 22731.13
{txt}95%    {res}    366.3        1121.67       {txt}Skewness      {res} 2.865138
{txt}99%    {res}    742.5        1121.67       {txt}Kurtosis      {res}  14.6434
{txt}
{com}. 
. * treatment
. sum LS9 if treat == 1, d

     {txt}LS9 How much did you earn in total from this sale?
{hline 61}
      Percentiles      Smallest
 1%    {res}        0              0
{txt} 5%    {res}        0              0
{txt}10%    {res}        0              0       {txt}Obs         {res}      1,248
{txt}25%    {res}        0              0       {txt}Sum of Wgt. {res}      1,248

{txt}50%    {res}   14.355                      {txt}Mean          {res} 99.71177
                        {txt}Largest       Std. Dev.     {res} 161.5279
{txt}75%    {res}    148.5        1121.67
{txt}90%    {res}    277.2        1121.67       {txt}Variance      {res} 26091.25
{txt}95%    {res}      396        1121.67       {txt}Skewness      {res} 2.927918
{txt}99%    {res}    851.4        1121.67       {txt}Kurtosis      {res}  14.8848
{txt}
{com}. scalar t_99 = r(p99)
{txt}
{com}. 
. replace LS9 = t_99 if LS9 > t_99 & !missing(LS9) & treat == 1
{txt}(12 real changes made)

{com}. 
. *control
. sum LS9 if treat == 0, d

     {txt}LS9 How much did you earn in total from this sale?
{hline 61}
      Percentiles      Smallest
 1%    {res}        0              0
{txt} 5%    {res}        0              0
{txt}10%    {res}        0              0       {txt}Obs         {res}      1,200
{txt}25%    {res}        0              0       {txt}Sum of Wgt. {res}      1,200

{txt}50%    {res}        0                      {txt}Mean          {res} 87.73677
                        {txt}Largest       Std. Dev.     {res} 138.5001
{txt}75%    {res}    128.7            891
{txt}90%    {res}  249.975            891       {txt}Variance      {res} 19182.29
{txt}95%    {res}    346.5          910.8       {txt}Skewness      {res} 2.666266
{txt}99%    {res}    683.1        1121.67       {txt}Kurtosis      {res} 12.96663
{txt}
{com}. scalar c_99 = r(p99)
{txt}
{com}. 
. replace LS9 = c_99 if LS9 > c_99 & !missing(LS9) & treat == 0
{txt}(12 real changes made)

{com}. 
. ** Replace Missing values with zero 
. * LS9 , 
. replace LS9 = 0 if LS9 ==.
{txt}(14 real changes made)

{com}. replace co_opsalevalue = 0 if co_opsalevalue ==.
{txt}(14 real changes made)

{com}. 
. 
. foreach v of var * {c -(}
{txt}  2{com}.         label var `v' "`l`v''"
{txt}  3{com}.         cap label val `v' "`ll`v''"
{txt}  4{com}. {c )-}
{txt}
{com}. 
. 
. lab var COM3 "HH Info Sales"
{txt}
{com}. lab var COM8 "HH Info Activities"
{txt}
{com}. lab var index_HH_comm "Communication Summary Index"
{txt}
{com}. lab var LS8 "Goats Sold"
{txt}
{com}. lab var LS9 "Goats Revenue (USD)"
{txt}
{com}. lab var co_opgoatno "Goats Sold through Co-op"
{txt}
{com}. lab var co_opsalevalue "Goat Revenue through Co-op (USD)"
{txt}
{com}. lab var net_goat_income "Net Goat Income (USD)"
{txt}
{com}. lab var index_HH_goatsales "Goat Sales Summary Index"
{txt}
{com}. lab var visits_sale "Trader Visits per Sale"
{txt}
{com}. lab var time_passed "Time between Contact & Sale (Days)"
{txt}
{com}. lab var transp_cost "Transportation Costs (USD)"
{txt}
{com}. lab var index_salecost "Sales Cost Summary Index"
{txt}
{com}. lab var index_dTRN "Transparency Discrepancy Summary Index"
{txt}
{com}. 
. 
. 
. *iebaltable
. 
. iebaltab COM3 COM8 index_HH_comm ///
>                 LS8 LS9 co_opgoatno co_opsalevalue ///
>                 net_goat_income index_HH_goatsales ///
>                 visits_sale time_passed transp_cost index_salecost ///
>                 index_dTRN ///
>                 HHR14 HSE5 HSE10  ///
>                 MGT5 COM3 COM5 ///
>                 BR1 BR BR2 ///
>                 BR3 GP21, rowvarlabels ///
>                 grpvar(treat) vce(cluster idx)  ///
>                 savetex("/Users/scottmiller/Dropbox (UFL)/LSIL/Pre-Analysis Plan/Stata Files/iebaltab2_nobanke_PAP.tex") replace
{res}{phang}Balance table saved to: {browse "/Users/scottmiller/Dropbox (UFL)/LSIL/Pre-Analysis Plan/Stata Files/iebaltab2_nobanke_PAP.tex":/Users/scottmiller/Dropbox (UFL)/LSIL/Pre-Analysis Plan/Stata Files/iebaltab2_nobanke_PAP.tex} 
{txt}
{smcl}
{com}.                 
.                 
.                 
.                 
.                 
.                 
. 
{txt}end of do-file

{com}. do "/var/folders/_d/jk4yrpt11pbc34dyw8cg5kjm0000gn/T//SD03049.000000"
{txt}
{com}. clear all
{res}{txt}
{com}. set more off, perm
{txt}({cmd:set more} preference recorded)

{com}. 
. *log
. cap log close
{smcl}
{com}{sf}{ul off}