{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}/Users/scottmiller/Documents/GitHub/LSIL_PAP/lsilPAP4_test.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res}10 Oct 2018, 11:01:37
{txt}
{com}. 
. cd "$d3" 
{res}/Users/scottmiller/Dropbox (UFL)/LSIL/Pre-Analysis Plan/Stata Files/PAP Data/LSIL-DATA_scott/VCC baseline aug 20 2018
{txt}
{com}. 
. 
. ** co-op dataset **
. clear
{txt}
{com}. use "r_CO_Merged_PAP.dta"
{txt}
{com}. 
. * Drop Banke District & Pilot Co-op
. drop if district == "Banke"
{txt}(14 observations deleted)

{com}. drop if r_treat ==.
{txt}(0 observations deleted)

{com}. drop if idx == "" 
{txt}(0 observations deleted)

{com}. 
. * Weights = 1 & control group
. generate wgt = 1
{txt}
{com}. generate stdgroup = r_treat
{txt}
{com}. 
. encode region, gen(n_region) // create numerical region variable for regression
{txt}
{com}. 
. ** Winsorize LS9
. * treatment
. sum LS9 if r_treat == 1, d

     {txt}LS9 How much did you earn in total from this sale?
{hline 61}
      Percentiles      Smallest
 1%    {res} 9594.595       9594.595
{txt} 5%    {res} 10083.33        9975.61
{txt}10%    {res} 10318.27       10083.33       {txt}Obs         {res}         46
{txt}25%    {res} 12773.68       10208.41       {txt}Sum of Wgt. {res}         46

{txt}50%    {res} 16727.13                      {txt}Mean          {res} 17912.88
                        {txt}Largest       Std. Dev.     {res} 7183.817
{txt}75%    {res} 22508.85       26539.14
{txt}90%    {res}    26300       27211.86       {txt}Variance      {res} 5.16e+07
{txt}95%    {res} 27211.86          40040       {txt}Skewness      {res} 1.644055
{txt}99%    {res} 44044.44       44044.44       {txt}Kurtosis      {res} 6.502127
{txt}
{com}. scalar t_99 = r(p99)
{txt}
{com}. 
. replace LS9 = t_99 if LS9 > t_99 & !missing(LS9) & r_treat == 1
{txt}(0 real changes made)

{com}. 
. *control
. sum LS9 if r_treat == 0, d

     {txt}LS9 How much did you earn in total from this sale?
{hline 61}
      Percentiles      Smallest
 1%    {res} 4865.857       4865.857
{txt} 5%    {res} 8730.769           5885
{txt}10%    {res} 9857.143       8730.769       {txt}Obs         {res}         46
{txt}25%    {res} 11906.25       9808.333       {txt}Sum of Wgt. {res}         46

{txt}50%    {res} 14718.45                      {txt}Mean          {res} 17002.02
                        {txt}Largest       Std. Dev.     {res} 8848.293
{txt}75%    {res} 19731.91          26250
{txt}90%    {res}  25806.8       27681.82       {txt}Variance      {res} 7.83e+07
{txt}95%    {res} 27681.82          35955       {txt}Skewness      {res} 2.727105
{txt}99%    {res} 60121.95       60121.95       {txt}Kurtosis      {res} 13.62087
{txt}
{com}. scalar c_99 = r(p99)
{txt}
{com}. 
. replace LS9 = c_99 if LS9 > c_99 & !missing(LS9) & r_treat == 0
{txt}(0 real changes made)

{com}. 
. 
. ** Replace Missing values with zero 
. * LS9 , 
. replace LS9 = 0 if LS9 ==.
{txt}(0 real changes made)

{com}. replace co_opsalevalue = 0 if co_opsalevalue ==.
{txt}(0 real changes made)

{com}. 
{txt}end of do-file

{com}. browse MAN18*

. do "/var/folders/vj/bmv34kqd60j8sb8x04d58nhr0000gn/T//SD01626.000000"
{txt}
{com}. * destring
. foreach v of varlist MAN18a MAN18b ///
> MAN18c MAN18d MAN18e {c -(}
{txt}  2{com}.         destring `v', replace
{txt}  3{com}. {c )-}       
{txt}MAN18a: all characters numeric; {res}replaced {txt}as {res}byte
{txt}(65 missing values generated)
{res}{txt}MAN18b: all characters numeric; {res}replaced {txt}as {res}byte
{txt}(65 missing values generated)
{res}{txt}MAN18c: all characters numeric; {res}replaced {txt}as {res}byte
{txt}(68 missing values generated)
{res}{txt}MAN18d: all characters numeric; {res}replaced {txt}as {res}byte
{txt}(65 missing values generated)
{res}{txt}MAN18e: all characters numeric; {res}replaced {txt}as {res}byte
{txt}(65 missing values generated)
{res}{txt}
{com}. 
{txt}end of do-file

{com}. tab MAN18a

{txt}MAN18a What {c |}
     is the {c |}
cooperative {c |}
decision-ma {c |}
       king {c |}
   practice {c |}
       with {c |}
 regards to {c |}
   setting  {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          1 {c |}{res}         15       55.56       55.56
{txt}          3 {c |}{res}          6       22.22       77.78
{txt}          4 {c |}{res}          6       22.22      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}         27      100.00

{com}. do "/var/folders/vj/bmv34kqd60j8sb8x04d58nhr0000gn/T//SD01626.000000"
{txt}
{com}. local local_decision MAN18a MAN18b MAN18c MAN18d MAN18e 
{txt}
{com}. make_index_gr decision wgt stdgroup `local_decision'
{err}command {bf}make_index_gr{sf} is unrecognized
{txt}{search r(199), local:r(199);}

end of do-file

{search r(199), local:r(199);}

{com}. do "/Users/scottmiller/Documents/GitHub/LSIL_PAP/lsilPAP3.do"
{txt}
{com}. /***********************************************
> *INVERSE COVARIANCE WEIGHTED INDEX V.0.2
> *Cyrus Samii, NYU, December 2017
> *(cds2083@nyu.edu)
> *
> *This ado file creates an index using inverse covariance weighting, 
> *a la Anderson (2008, p. 1485).
> 
> ***********************************************/
. 
. capture program drop make_index_gr
{txt}
{com}. capture mata: mata drop icwxmata()
{txt}
{com}. program make_index_gr
{txt}  1{com}. version 11.1
{txt}  2{com}.     syntax anything [if]
{txt}  3{com}.     gettoken newname anything: anything
{txt}  4{com}.     gettoken wgt anything: anything
{txt}  5{com}.         gettoken sgroup anything: anything
{txt}  6{com}.     local Xvars `anything'
{txt}  7{com}.         marksample touse
{txt}  8{com}.         mata: icwxmata(("`Xvars'"),"`wgt'","`sgroup'", "index")
{txt}  9{com}.         rename index index_`newname'
{txt} 10{com}. end
{txt}
{com}.  
. mata:
{txt}{hline 49} mata (type {cmd:end} to exit) {hline}
{com}:         function icwxmata(xvars, wgts, sgroups, indexname)
>         {c -(}
>                 st_view(X=0,.,tokens(xvars))
>                 st_view(wgt=.,.,wgts)
>                 st_view(sgroup=.,.,sgroups)
>                 nr = rows(X)
>                 nc = cols(X)    
>                 sg_wgt = wgt:*sgroup
>                 sg_wgtst = sg_wgt/sum(sg_wgt)
>                 all_wgtst = wgt/sum(wgt)
>                 sg_wgtstdM = J(1,nc,1) # sg_wgtst
>                 all_wgtstdM = J(1,nc,1) # all_wgtst
>                 sg_wgtdmeans = colsum(X:*sg_wgtstdM)
>                 sgroup2 = sgroup
>                 sgroupdM = J(1,nc,1) # sgroup2
>                 sg_meandevs = ((X:*sgroupdM) - (J(nr,1,1) # sg_wgtdmeans):*sgroupdM)
>                 all_wgtdmeandevs = X - (J(nr,1,1) # sg_wgtdmeans)
>                 sg_wgtdstds = sqrt(colsum(sg_wgt:*(sg_meandevs:*sg_meandevs)):/(sum(sg_wgt)-1))
>                 Xs = all_wgtdmeandevs:/(J(nr,1,1) # sg_wgtdstds)
>                 S = variance(Xs, wgt)
>                 invS = invsym(S)
>                 ivec = J(nc,1,1)
>                 indexout_sc = (invsym(ivec'*invS*ivec)*ivec'*invS*Xs')'
>                 indexout = indexout_sc/sqrt(variance(indexout_sc, sg_wgt))
>                 st_addvar("float",indexname)
>                 st_store(.,indexname,indexout)
>         {c )-}
{txt}note: variable all_wgtstdM set but not used

{com}: end
{txt}{hline}

{com}. 
{txt}end of do-file

{com}. do "/var/folders/vj/bmv34kqd60j8sb8x04d58nhr0000gn/T//SD01626.000000"
{txt}
{com}. local local_decision MAN18a MAN18b MAN18c MAN18d MAN18e 
{txt}
{com}. make_index_gr decision wgt stdgroup `local_decision'
{res}  934
{txt}
{com}. 
{txt}end of do-file

{com}. summary index_decision
{err}command {bf}summary{sf} is unrecognized
{txt}{search r(199), local:r(199);}

{com}. sum index_decision

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
index_deci~n {c |}{res}         24     1.45122    1.080502   .5858385   3.695603

{com}. 