{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}/Users/scottmiller/Documents/GitHub/LSIL_PAP/lsilPAP4_test.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res} 4 Jan 2019, 11:32:37
{txt}
{com}. 
. cd "$d3" 
{res}/Users/scottmiller/Dropbox (UFL)/LSIL/Pre-Analysis Plan/Stata Files/PAP Data/LSIL-DATA_scott/VCC baseline aug 20 2018
{txt}
{com}. 
. 
. ** co-op dataset **
. clear
{txt}
{com}. use "r_CO_Merged_PAP.dta"
{txt}
{com}. 
. * Drop Banke District & Pilot Co-op
. drop if district == "Banke"
{txt}(14 observations deleted)

{com}. drop if r_treat ==.
{txt}(0 observations deleted)

{com}. drop if idx == "" 
{txt}(0 observations deleted)

{com}. 
. * Weights = 1 & control group
. generate wgt = 1
{txt}
{com}. generate stdgroup = r_treat
{txt}
{com}. 
. encode region, gen(n_region) // create numerical region variable for regression
{txt}
{com}. 
. 
. ** Winsorize LS9
. * -----------------------------------------------
. gen LS9_w = LS9
{txt}
{com}. 
. * treatment
. sum LS9_w if r_treat == 1, d

                            {txt}LS9_w
{hline 61}
      Percentiles      Smallest
 1%    {res} 9594.595       9594.595
{txt} 5%    {res} 10083.33       9975.609
{txt}10%    {res} 10318.27       10083.33       {txt}Obs         {res}         49
{txt}25%    {res} 13106.15       10208.41       {txt}Sum of Wgt. {res}         49

{txt}50%    {res} 16579.78                      {txt}Mean          {res}  18532.1
                        {txt}Largest       Std. Dev.     {res} 8958.606
{txt}75%    {res} 22508.85       27211.87
{txt}90%    {res} 26539.14       32828.79       {txt}Variance      {res} 8.03e+07
{txt}95%    {res} 32828.79       44044.45       {txt}Skewness      {res} 2.570638
{txt}99%    {res} 60121.95       60121.95       {txt}Kurtosis      {res} 11.62613
{txt}
{com}. scalar t_99 = r(p99)
{txt}
{com}. 
. replace LS9_w = t_99 if LS9_w > t_99 & !missing(LS9_w) & r_treat == 1
{txt}(0 real changes made)

{com}. 
. *control
. sum LS9_w if r_treat == 0, d

                            {txt}LS9_w
{hline 61}
      Percentiles      Smallest
 1%    {res} 4865.857       4865.857
{txt} 5%    {res}  8730.77           5885
{txt}10%    {res} 9857.143        8730.77       {txt}Obs         {res}         43
{txt}25%    {res} 11717.95       9808.333       {txt}Sum of Wgt. {res}         43

{txt}50%    {res} 14287.88                      {txt}Mean          {res} 15788.82
                        {txt}Largest       Std. Dev.     {res} 6049.443
{txt}75%    {res} 19218.18       23162.86
{txt}90%    {res} 22981.16          26250       {txt}Variance      {res} 3.66e+07
{txt}95%    {res}    26250       27681.82       {txt}Skewness      {res}  .974943
{txt}99%    {res}    35955          35955       {txt}Kurtosis      {res} 4.420623
{txt}
{com}. scalar c_99 = r(p99)
{txt}
{com}. 
. replace LS9_w = c_99 if LS9_w > c_99 & !missing(LS9_w) & r_treat == 0
{txt}(0 real changes made)

{com}. 
. 
. ** Replace Missing values with zero 
. * LS9 , 
. replace LS9_w = 0 if LS9_w ==.
{txt}(0 real changes made)

{com}. replace co_opsalevalue = 0 if co_opsalevalue ==.
{txt}(0 real changes made)

{com}. * -----------------------------------------------
. */
. 
. 
. ** Communication **
. 
. /* Variables 
> # of times initiated contact with SHG : comm1
> # of times SHG initiated contact : comm2
> Factors that limit communication : (not in index - used as control vars)
> */
. 
.         * # of times initiated contact with SHG : comm1
.         gen comm1 = COMM1a + COMM1b ///
>         + COMM1c + COMM1d
{txt}(2 missing values generated)

{com}.         * # of times SHG initiated contact : comm2
.         gen comm2 = COMM2a + COMM2b ///
>         + COMM2c + COMM2d
{txt}(2 missing values generated)

{com}.         ** Total # of times initiated contact
.         gen contact = comm1 + comm2
{txt}(2 missing values generated)

{com}.         
.         * Total # of times HH is contacted
.         gen HHcontact = COM3 + COM8
{txt}(14 missing values generated)

{com}.         
. 
. * co-op comm index
. local local_CO_comm_full contact COM3 COM8
{txt}
{com}. make_index_gr CO_comm_full wgt stdgroup `local_CO_comm_full' 
{res}  939
{txt}
{com}. 
. * factors that limit communication
.         * principal components index
. 
. 
. ** Transparency **
. 
. /* Variables
> Mandate : Co_opTransparencyTRN1
> Annual Report : Co_opTransparencyTRN2
> Annual Budget : Co_opTransparencyTRN3
> Financial Report: Co_opTransparencyTRN4 
> Meeting minutes : Co_opTransparencyTRN5
> Election Results : Co_opTransparencyTRN6
> Sale Records : Co_opTransparencyTRN7
> Evaluations : Co_opTransparencyTRN8
> */
.         
. ** Co-op Transparency   
. local local_CO_TRN CO_TRN1 CO_TRN2 ///
>         CO_TRN3 CO_TRN4 CO_TRN5 ///
>         CO_TRN6 CO_TRN7
{txt}
{com}. make_index_gr CO_TRN wgt stdgroup `local_CO_TRN' 
{res}  940
{txt}
{com}. 
. 
. ** Household Awareness
. local local_HH_TRN HH_TRN1 HH_TRN2 ///
>         HH_TRN3 HH_TRN4 HH_TRN5 ///
>         HH_TRN6 HH_TRN7
{txt}
{com}. make_index_gr HH_TRN wgt stdgroup `local_HH_TRN' 
{res}  941
{txt}
{com}. 
. 
. ** Discrepancy
.         forvalues i=1/7 {c -(} 
{txt}  2{com}.                 gen dTRN`i' = -(CO_TRN`i' - HH_TRN`i')^2
{txt}  3{com}.                 {c )-}
{txt}(2 missing values generated)
(2 missing values generated)
(2 missing values generated)
(2 missing values generated)
(2 missing values generated)
(2 missing values generated)
(2 missing values generated)

{com}.                 
. local local_dTRN dTRN1 dTRN2 dTRN3 dTRN4 dTRN5 dTRN6 dTRN7
{txt}
{com}. make_index_gr dTRN wgt stdgroup `local_dTRN' 
{res}  949
{txt}
{com}. 
. * average discrepancy
. egen avg_dTRN = rowmean(dTRN1 dTRN2 dTRN3 dTRN4 dTRN5 dTRN6 dTRN7)
{txt}(2 missing values generated)

{com}. 
. 
. ** Cooperative Finances **
. 
. /* Variables 
> Revenue from all activities : role_GMrevenuandcostREV4
> Costs from all activities : role_GMrevenuandcostcalc_REC7
> Assets : role_GMFinLiabiliteisFAL1
> Liabilities : role_GMFinLiabiliteisFAL2
> Goat Rev : role_GMrevenuandcostREC4_1
> Members : role_CPMgt_and_membershi1
> */
. 
. * Convert to USD as of 1/1/18
. 
. gen revenue = REV4*(0.0099)
{txt}(2 missing values generated)

{com}. gen costs = REC7*(0.0099)
{txt}(2 missing values generated)

{com}. gen assets = FAL1*(0.0099)
{txt}(2 missing values generated)

{com}. gen liabilities = FAL2*(0.0099)
{txt}(2 missing values generated)

{com}. gen goatrev = REC4_1*(0.0099)
{txt}(2 missing values generated)

{com}. 
. gen net_rev = revenue - costs
{txt}(2 missing values generated)

{com}. gen net_finances = (revenue - costs) ///
>                                         + (assets - liabilities)
{txt}(2 missing values generated)

{com}. 
. * per member
. gen rev_member = revenue / MAN3
{txt}(2 missing values generated)

{com}. gen cost_member =  costs / MAN3
{txt}(2 missing values generated)

{com}. gen assets_member = assets / MAN3
{txt}(2 missing values generated)

{com}. gen liab_member = liabilities / MAN3
{txt}(2 missing values generated)

{com}. gen net_rev_member = net_rev / MAN3
{txt}(2 missing values generated)

{com}. gen net_finances_member = net_finances / MAN3
{txt}(2 missing values generated)

{com}. gen goatrev_member = goatrev / MAN3
{txt}(2 missing values generated)

{com}. 
. ** Replace Missing values with zero 
. *  , 
. replace revenue = 0 if revenue ==.
{txt}(2 real changes made)

{com}. replace rev_member = 0 if rev_member ==.
{txt}(2 real changes made)

{com}. replace costs = 0 if costs ==.
{txt}(2 real changes made)

{com}. replace cost_mem = 0 if cost_mem ==.            
{txt}(2 real changes made)

{com}. 
. 
. ** Goat Sales ** 
. 
. /* Variables 
> # of goats sold : REC1
> goat revenue : REC4_1
> # of organized sales at collection points : GTT1
> Members : MAN3
> Goat revenue per member : goatrev_member
> Trader visits per sale
> Time passed
> Transportation costs
> */
. 
. ** co-op level vars
. gen goats_sold = REC1
{txt}(2 missing values generated)

{com}. gen goats_sold_member = REC1 / MAN3
{txt}(2 missing values generated)

{com}. * goatrev
. * revenue per goat sold
. gen goatrev_sold = goatrev / REC1
{txt}(22 missing values generated)

{com}. gen col_points = GTT1
{txt}
{com}. 
. local local_CO_goatsales goats_sold goatrev col_points
{txt}
{com}. make_index_gr CO_goatsales wgt stdgroup `local_CO_goatsales' 
{res}  969
{txt}
{com}. 
. 
. ** household level vars
. gen co_opshare = 0
{txt}
{com}. replace co_opshare = co_opgoatno / LS8 if LS8 != 0
{txt}(59 real changes made)

{com}. gen visits_sale = -1*(LS40 / LS_n_sales)
{txt}
{com}. gen time_passed = -1*(LS41)
{txt}
{com}. gen transp_cost = -1*(LS42*(0.0099))
{txt}
{com}. 
. local local_HH_goatsales LS8 LS9_w co_opgoatno co_opsalevalue
{txt}
{com}. make_index_gr HH_goatsales wgt stdgroup `local_HH_goatsales' 
{res}  974
{txt}
{com}. 
. local local_salecost visits_sale time_passed transp_cost
{txt}
{com}. make_index_gr salecost wgt stdgroup `local_salecost' 
{res}  975
{txt}
{com}. 
. 
. * Gross margin -- Net rev. per goat
. 
. /* Costs
> Amount spent purchasing goats: LSE12
> Amount spent on feed/fodder : LSE15
> Amount spent on vet care : LSE16
> Amount spent on breeding fees : LSE17a * LSE17b
> Amount spent on shelters : LSE18
> */
. 
. foreach v of varlist LSE12 LSE15 LSE16 LSE17a LSE17b LSE18 {c -(}
{txt}  2{com}.         replace `v' = 0 if `v'==.
{txt}  3{com}.         {c )-}
{txt}(16 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)

{com}. 
. gen goat_costs = LSE12*(0.0099) + LSE15*(0.0099) + LSE16*(0.0099) + (LSE17a*LSE17b)*(0.0099) + LSE18*(0.0099)
{txt}
{com}. gen net_goat_income = LS9_w*(0.0099) - goat_costs
{txt}
{com}. gen netincome_goat = net_goat_income / LS8
{txt}
{com}. 
. 
. 
. 
. ** Planning and Goals **
. 
. /* Variables 
> Business Plan : PNG1
> Time Horizon : PNG2
> Expected Goats Sold : PNG3
> Expected Rev. : PNG4
> */
. 
. gen expected_rev = PNG4*(0.0099)
{txt}(2 missing values generated)

{com}. replace PNG2 =. if PNG2 == 99
{txt}(1 real change made, 1 to missing)

{com}. 
. local local_PNG PNG1 PNG2 PNG3 expected_rev
{txt}
{com}. make_index_gr PNG wgt stdgroup `local_PNG'
{res}  980
{txt}
{com}. 
. save "$d3/r_CO_Merged_Ind.dta", replace
{txt}file /Users/scottmiller/Dropbox (UFL)/LSIL/Pre-Analysis Plan/Stata Files/PAP Data/LSIL-DATA_scott/VCC baseline aug 20 2018/r_CO_Merged_Ind.dta saved

{com}. 
. 
. 
. ****************
. ** HH dataset **
. clear
{txt}
{com}. use "$d3/r_HH_Merged_PAP.dta"
{txt}
{com}. 
. * Drop Banke District & Pilot Co-op
. drop if district == "Banke"
{txt}(360 observations deleted)

{com}. drop if r_treat == .
{txt}(48 observations deleted)

{com}. drop if idx == "" 
{txt}(0 observations deleted)

{com}. 
. * Weights = 1 & control group
. generate wgt = 1
{txt}
{com}. generate stdgroup = r_treat
{txt}
{com}. 
. encode region, gen(n_region) // create numerical region variable for regression
{txt}
{com}. 
. 
. ** Winsorize LS9
. * -----------------------------------------------
. gen LS9_w = LS9
{txt}(1,172 missing values generated)

{com}. 
. * treatment
. sum LS9_w if r_treat == 1, d

                            {txt}LS9_w
{hline 61}
      Percentiles      Smallest
 1%    {res}        0              0
{txt} 5%    {res}     2300              0
{txt}10%    {res}     5000              0       {txt}Obs         {res}        740
{txt}25%    {res} 8256.875              0       {txt}Sum of Wgt. {res}        740

{txt}50%    {res}    14000                      {txt}Mean          {res} 20174.93
                        {txt}Largest       Std. Dev.     {res} 23993.72
{txt}75%    {res}    24000         145000
{txt}90%    {res}    39700         195000       {txt}Variance      {res} 5.76e+08
{txt}95%    {res}    51750         220500       {txt}Skewness      {res} 6.099018
{txt}99%    {res}   117000       353191.3       {txt}Kurtosis      {res}  65.3599
{txt}
{com}. scalar t_99 = r(p99)
{txt}
{com}. 
. replace LS9_w = t_99 if LS9_w > t_99 & !missing(LS9_w) & r_treat == 1
{txt}(7 real changes made)

{com}. 
. *control
. sum LS9_w if r_treat == 0, d

                            {txt}LS9_w
{hline 61}
      Percentiles      Smallest
 1%    {res}        0              0
{txt} 5%    {res}        0              0
{txt}10%    {res}     3000              0       {txt}Obs         {res}        536
{txt}25%    {res}     7000              0       {txt}Sum of Wgt. {res}        536

{txt}50%    {res}    12000                      {txt}Mean          {res} 16555.42
                        {txt}Largest       Std. Dev.     {res} 16489.12
{txt}75%    {res}    22000         110000
{txt}90%    {res}    32000         127000       {txt}Variance      {res} 2.72e+08
{txt}95%    {res}    45000         144000       {txt}Skewness      {res} 3.584523
{txt}99%    {res}    75000         155600       {txt}Kurtosis      {res} 24.33791
{txt}
{com}. scalar c_99 = r(p99)
{txt}
{com}. 
. replace LS9_w = c_99 if LS9_w > c_99 & !missing(LS9_w) & r_treat == 0
{txt}(5 real changes made)

{com}. * -----------------------------------------------
. 
. 
. ** Replace Missing values with zero
. * ----------------------------------------------- 
. * LS9 , 
. replace LS9_w = 0 if LS9_w ==.
{txt}(1,172 real changes made)

{com}. replace LS8 = 0 if LS8 ==.
{txt}(1,172 real changes made)

{com}. replace co_opsalevalue = 0 if co_opsalevalue ==.
{txt}(1,172 real changes made)

{com}. replace co_opgoatno = 0 if co_opgoatno ==.
{txt}(1,172 real changes made)

{com}. * -----------------------------------------------
. */
. 
. ** Communication **
. 
. * Variables 
. 
.         * Total # of times HH is contacted
.         gen HHcontact = COM3 + COM8
{txt}(1,241 missing values generated)

{com}. 
. 
. * HH comm index
. local local_HH_comm COM3 COM8
{txt}
{com}. make_index_gr HH_comm wgt stdgroup `local_HH_comm' 
{res}  937
{txt}
{com}. 
. * factors that limit communication
.         * principal components index
. 
. 
. 
. ** Transparency **
. 
. /* Variables
> Mandate : Co_opTransparencyTRN1
> Annual Report : Co_opTransparencyTRN2
> Annual Budget : Co_opTransparencyTRN3
> Financial Report: Co_opTransparencyTRN4 
> Meeting minutes : Co_opTransparencyTRN5
> Election Results : Co_opTransparencyTRN6
> Sale Records : Co_opTransparencyTRN7
> Evaluations : Co_opTransparencyTRN8
> */
. 
.         /*
>         forvalues i=1/7 {c -(} 
>                 destring role_GMtransTRN`i', replace
>                 replace role_GMtransTRN`i' = 0 if role_GMtransTRN`i' == 2
>                 replace role_GMtransTRN`i' = . if role_GMtransTRN`i' == 97
>                 {c )-}
>         */
.         
. ** Co-op Transparency   
. local local_CO_TRN CO_TRN1 CO_TRN2 ///
>         CO_TRN3 CO_TRN4 CO_TRN5 ///
>         CO_TRN6 CO_TRN7
{txt}
{com}. make_index_gr CO_TRN wgt stdgroup `local_CO_TRN'                
{res}  938
{txt}
{com}. 
. ** Household Awareness
. local local_HH_TRN HH_TRN1 HH_TRN2 ///
>         HH_TRN3 HH_TRN4 HH_TRN5 ///
>         HH_TRN6 HH_TRN7
{txt}
{com}. make_index_gr HH_TRN wgt stdgroup `local_HH_TRN' 
{res}  939
{txt}
{com}. 
.         
. ** Transparency Discrepancy index
.         forvalues i=1/7 {c -(} 
{txt}  2{com}.                 gen dTRN`i' = 1 if CO_TRN`i' == HH_TRN`i' ///
>                         &  !missing(CO_TRN`i') & !missing(HH_TRN`i')
{txt}  3{com}.                 replace dTRN`i' = 0 if CO_TRN`i' != HH_TRN`i' ///
>                         &  !missing(CO_TRN`i') & !missing(HH_TRN`i')
{txt}  4{com}.                 {c )-}
{txt}(1,608 missing values generated)
(1,061 real changes made)
(1,624 missing values generated)
(1,083 real changes made)
(1,619 missing values generated)
(1,091 real changes made)
(1,584 missing values generated)
(1,041 real changes made)
(1,535 missing values generated)
(1,045 real changes made)
(1,678 missing values generated)
(1,026 real changes made)
(1,483 missing values generated)
(915 real changes made)

{com}.                 
. local local_dTRN dTRN1 dTRN2 dTRN3 dTRN4 dTRN5 dTRN6 dTRN7
{txt}
{com}. make_index_gr dTRN wgt stdgroup `local_dTRN' 
{res}  947
{txt}
{com}. 
. * average discrepancy
. egen avg_dTRN = rowmean(dTRN1 dTRN2 dTRN3 dTRN4 dTRN5 dTRN6 dTRN7)
{txt}(356 missing values generated)

{com}. 
. 
. ** Goat Sales ** 
. 
. /* Variables 
> # of goats sold : Livestock_SalesLS8
> goat revenue : Livestock_SalesLS9
> goats sold through co-op : co_opgoatno
> goat revenue through co-op : co_opsalevalue
> share through co-op : co_opshare
> trader visits home : Livestock_SalesLS40
> time passed before sale : Livestock_SalesLS41
> transportation cost : Livestock_SalesLS42
> */
. /* Costs
> Amount spent purchasing goats: LSE12
> Amount spent on feed/fodder : LSE15
> Amount spent on vet care : LSE16
> Amount spent on breeding fees : LSE17a * LSE17b
> Amount spent on shelters : LSE18
> */
. 
. 
. ** household level vars
. gen co_opshare = 0
{txt}
{com}. replace co_opshare = co_opgoatno / LS8 if LS8 != 0
{txt}(261 real changes made)

{com}. gen visits_sale = -1*(LS40 / LS_n_sales)
{txt}(1,172 missing values generated)

{com}. gen time_passed = -1*(LS41)
{txt}(1,172 missing values generated)

{com}. gen transp_cost = -1*(LS42*(0.0099))
{txt}(1,172 missing values generated)

{com}. replace LS9_w = LS9_w*(0.0099)
{txt}(1,218 real changes made)

{com}. replace co_opsalevalue = co_opsalevalue*(0.0099)
{txt}(262 real changes made)

{com}. 
. 
. * replace obvious outlier with sample median (median = 0)
. replace visits_sale = 0 if visits_sale <= -5000
{txt}(1 real change made)

{com}. 
. * replace missing values with zero
. foreach v of varlist LSE12 LSE15 LSE16 LSE17a LSE17b LSE18 {c -(}
{txt}  2{com}.         replace `v' = 0 if `v'==.
{txt}  3{com}.         {c )-}
{txt}(2,191 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(539 real changes made)
(0 real changes made)

{com}. 
. gen goat_costs = LSE12*(0.0099) + LSE15*(0.0099) + LSE16*(0.0099) + (LSE17a*LSE17b)*(0.0099) + LSE18*(0.0099)
{txt}
{com}. gen net_goat_income = LS9_w - goat_costs
{txt}
{com}. gen netincome_goat = net_goat_income / LS8
{txt}(1,234 missing values generated)

{com}. 
. 
. local local_HH_goatsales LS8 LS9_w co_opgoatno co_opsalevalue net_goat_income
{txt}
{com}. make_index_gr HH_goatsales wgt stdgroup `local_HH_goatsales' 
{res}  956
{txt}
{com}. 
. local local_salecost visits_sale time_passed transp_cost
{txt}
{com}. make_index_gr salecost wgt stdgroup `local_salecost' 
{res}  957
{txt}
{com}. 
. 
. save "$d3/r_HH_Merged_Ind.dta", replace
{txt}file /Users/scottmiller/Dropbox (UFL)/LSIL/Pre-Analysis Plan/Stata Files/PAP Data/LSIL-DATA_scott/VCC baseline aug 20 2018/r_HH_Merged_Ind.dta saved

{com}. 
. 
. 
. 
{txt}end of do-file

{com}. do "/var/folders/_d/jk4yrpt11pbc34dyw8cg5kjm0000gn/T//SD01678.000000"
{txt}
{com}. gl hh_goatsales LS8 LS9_w co_opgoatno co_opsalevalue ///

{txt}end of do-file

{com}. do "/var/folders/_d/jk4yrpt11pbc34dyw8cg5kjm0000gn/T//SD01678.000000"
{txt}
{com}. 
. clear
{txt}
{com}. set more off, perm
{txt}({cmd:set more} preference recorded)

{com}. cd "$d2"
{res}/Users/scottmiller/Dropbox (UFL)/LSIL/Pre-Analysis Plan/Stata Files/PAP Data
{txt}
{com}. 
. ** Co-op level dataset
. ********************************************* 
. clear
{txt}
{com}. use "$d3/r_CO_Merged_Ind.dta"
{txt}
{com}. 
. 
. ** Co-op indicators **
. 
. gl co_summ MAN3 revenue costs net_rev rev_member net_rev_member goatrev ///
>                 PNG1 PNG2 PNG3 expected_rev index_PNG CO_TRN1 CO_TRN2 ///
>                 CO_TRN3 CO_TRN4 CO_TRN5 CO_TRN6 CO_TRN7
{txt}
{com}. 
. local listsize : list sizeof global(co_summ)
{txt}
{com}. tokenize $co_summ
{txt}
{com}. 
. forv i = 1/`listsize' {c -(}
{txt}  2{com}.                 
.         quietly {c -(}
{txt}  3{com}.                 sum ``i''
{txt}  4{com}.                 return list
{txt}  5{com}.                 scalar N_``i'' = r(N) // N
{txt}  6{com}.                 scalar mean_``i'' = r(mean) // mean
{txt}  7{com}.                 scalar sd_``i'' = r(sd)  // sd
{txt}  8{com}.                 scalar min_``i'' = r(min)  // sd
{txt}  9{com}.                 scalar max_``i'' = r(max)  // sd
{txt} 10{com}.                 
.         * matrix for table
.                 matrix mat_`i' = (N_``i'',mean_``i'',sd_``i'',min_``i'',max_``i'')
{txt} 11{com}.                 {c )-}
{txt} 12{com}. {c )-}
{txt}
{com}. matrix A = mat_1
{txt}
{com}. forv i = 2/`listsize' {c -(} // appends into single matrix
{txt}  2{com}.         matrix A = A \ mat_`i'
{txt}  3{com}. {c )-}
{txt}
{com}. 
. * Table
. frmttable using CO_summary.tex, tex statmat(A) sdec(2) coljust(l;c;l;l) title("Cooperative Indicators - Summmary Statistics") ///
> ctitle("","N","Mean","sd","Min","Max") ///
> rtitle("\# of Members"\"Revenue (USD)"\"Costs (USD)"\"Net Revenue (USD)"\"Revenue per Member (USD)"\"Net Revenue per Member (USD)"\"Goat Revenue"\"Co-op has a Business Plan"\"Planning Time Horizon (Years)"\"Expected Goats Sold"\"Expected Revenue (USD)"\"Planning \& Goals Summmary Index"\"Transparency: Mandate"\"Transparency: Annual Report"\"Transparency: Annual Budget"\"Transparency: Financial Report"\"Transparency: Meeting Minutes"\"Transparency: Election Results"\"Transparency: Sale Records")replace
{res}
{txt}{center:Cooperative Indicators - Summmary Statistics}
{txt}{center:{hline 85}}
{center:{txt}{lalign 34:}{txt}{center 7:N}{txt}{center 10:Mean}{txt}{center 10:sd}{txt}{center 11:Min}{txt}{center 11:Max}}
{txt}{center:{hline 85}}
{center:{txt}{lalign 34:\# of Members}{res}{center 7:92.00}{res}{center 10:553.36}{res}{center 10:376.42}{res}{center 11:11.00}{res}{center 11:2,600.00}}
{center:{txt}{lalign 34:Revenue (USD)}{res}{center 7:92.00}{res}{center 10:3,775.21}{res}{center 10:8,014.47}{res}{center 11:0.00}{res}{center 11:65,709.51}}
{center:{txt}{lalign 34:Costs (USD)}{res}{center 7:92.00}{res}{center 10:377.52}{res}{center 10:1,639.07}{res}{center 11:0.00}{res}{center 11:10,964.25}}
{center:{txt}{lalign 34:Net Revenue (USD)}{res}{center 7:90.00}{res}{center 10:3,473.19}{res}{center 10:8,245.85}{res}{center 11:-7,935.00}{res}{center 11:65,554.27}}
{center:{txt}{lalign 34:Revenue per Member (USD)}{res}{center 7:92.00}{res}{center 10:7.20}{res}{center 10:10.55}{res}{center 11:0.00}{res}{center 11:63.53}}
{center:{txt}{lalign 34:Net Revenue per Member (USD)}{res}{center 7:90.00}{res}{center 10:6.80}{res}{center 10:10.95}{res}{center 11:-13.22}{res}{center 11:63.53}}
{center:{txt}{lalign 34:Goat Revenue}{res}{center 7:90.00}{res}{center 10:111.86}{res}{center 10:203.73}{res}{center 11:0.00}{res}{center 11:1,029.40}}
{center:{txt}{lalign 34:Co-op has a Business Plan}{res}{center 7:90.00}{res}{center 10:0.52}{res}{center 10:0.49}{res}{center 11:0.00}{res}{center 11:1.00}}
{center:{txt}{lalign 34:Planning Time Horizon (Years)}{res}{center 7:89.00}{res}{center 10:1.26}{res}{center 10:1.00}{res}{center 11:0.00}{res}{center 11:5.00}}
{center:{txt}{lalign 34:Expected Goats Sold}{res}{center 7:90.00}{res}{center 10:271.74}{res}{center 10:363.26}{res}{center 11:0.00}{res}{center 11:2,500.00}}
{center:{txt}{lalign 34:Expected Revenue (USD)}{res}{center 7:90.00}{res}{center 10:1,026.62}{res}{center 10:2,158.46}{res}{center 11:0.00}{res}{center 11:14,850.00}}
{center:{txt}{lalign 34:Planning \& Goals Summmary Index}{res}{center 7:89.00}{res}{center 10:0.11}{res}{center 10:0.94}{res}{center 11:-1.25}{res}{center 11:3.63}}
{center:{txt}{lalign 34:Transparency: Mandate}{res}{center 7:90.00}{res}{center 10:0.81}{res}{center 10:0.38}{res}{center 11:0.00}{res}{center 11:1.00}}
{center:{txt}{lalign 34:Transparency: Annual Report}{res}{center 7:90.00}{res}{center 10:0.84}{res}{center 10:0.36}{res}{center 11:0.00}{res}{center 11:1.00}}
{center:{txt}{lalign 34:Transparency: Annual Budget}{res}{center 7:90.00}{res}{center 10:0.82}{res}{center 10:0.38}{res}{center 11:0.00}{res}{center 11:1.00}}
{center:{txt}{lalign 34:Transparency: Financial Report}{res}{center 7:90.00}{res}{center 10:0.81}{res}{center 10:0.38}{res}{center 11:0.00}{res}{center 11:1.00}}
{center:{txt}{lalign 34:Transparency: Meeting Minutes}{res}{center 7:90.00}{res}{center 10:0.78}{res}{center 10:0.40}{res}{center 11:0.00}{res}{center 11:1.00}}
{center:{txt}{lalign 34:Transparency: Election Results}{res}{center 7:90.00}{res}{center 10:0.55}{res}{center 10:0.49}{res}{center 11:0.00}{res}{center 11:1.00}}
{center:{txt}{lalign 34:Transparency: Sale Records}{res}{center 7:90.00}{res}{center 10:0.76}{res}{center 10:0.43}{res}{center 11:0.00}{res}{center 11:1.00}}
{txt}{center:{hline 85}}


{com}.  
. 
. 
. 
. 
. ** communication **
. gl co_comm comm1 comm2 contact COM3 COM8 index_CO_comm HHcontact
{txt}
{com}.         
. ** Co-op vars
. local listsize : list sizeof global(co_comm)
{txt}
{com}. tokenize $co_comm
{txt}
{com}. 
. forv i = 1/`listsize' {c -(}
{txt}  2{com}.                 
.         quietly {c -(}
{txt}  3{com}.                 sum ``i''
{txt}  4{com}.                 return list
{txt}  5{com}.                 scalar N_``i'' = r(N) // N
{txt}  6{com}.                 scalar mean_``i'' = r(mean) // mean
{txt}  7{com}.                 scalar sd_``i'' = r(sd)  // sd
{txt}  8{com}.                 scalar min_``i'' = r(min)  // sd
{txt}  9{com}.                 scalar max_``i'' = r(max)  // sd
{txt} 10{com}.                 
.         * matrix for table
.                 matrix mat_`i' = (N_``i'',mean_``i'',sd_``i'',min_``i'',max_``i'')
{txt} 11{com}.                 {c )-}
{txt} 12{com}. {c )-}
{txt}
{com}. matrix A = mat_1
{txt}
{com}. forv i = 2/`listsize' {c -(} // appends into single matrix
{txt}  2{com}.         matrix A = A \ mat_`i'
{txt}  3{com}. {c )-}
{txt}
{com}. 
. * Table
. frmttable using MDE_summary.doc, statmat(A) sdec(2) coljust(l;c;l;l) title("Co-op Level - Communication: Summmary Stats") ///
> ctitle("","N","Mean","sd","Min","Max") ///
> rtitle("Contacted SHG"\"Contacted by SHG"\"Total Co-op Contact"\"HH info sales"\"HH info activities"\"co-op level index"\"Total HH Contact") replace
{res}
{txt}{center:Co-op Level - Communication: Summmary Stats}
{txt}{center:{hline 59}}
{center:{txt}{lalign 21:}{txt}{center 7:N}{txt}{center 7:Mean}{txt}{center 7:sd}{txt}{center 7:Min}{txt}{center 8:Max}}
{txt}{center:{hline 59}}
{center:{txt}{lalign 21:Contacted SHG}{res}{center 7:90.00}{res}{center 7:9.54}{res}{center 7:12.90}{res}{center 7:0.00}{res}{center 8:90.00}}
{center:{txt}{lalign 21:Contacted by SHG}{res}{center 7:90.00}{res}{center 7:7.45}{res}{center 7:13.66}{res}{center 7:0.00}{res}{center 8:100.00}}
{center:{txt}{lalign 21:Total Co-op Contact}{res}{center 7:90.00}{res}{center 7:16.99}{res}{center 7:25.46}{res}{center 7:0.00}{res}{center 8:190.00}}
{center:{txt}{lalign 21:HH info sales}{res}{center 7:78.00}{res}{center 7:1.11}{res}{center 7:0.90}{res}{center 7:0.00}{res}{center 8:3.50}}
{center:{txt}{lalign 21:HH info activities}{res}{center 7:92.00}{res}{center 7:1.04}{res}{center 7:1.16}{res}{center 7:0.00}{res}{center 8:8.10}}
{center:{txt}{lalign 21:co-op level index}{res}{center 7:76.00}{res}{center 7:-0.20}{res}{center 7:0.81}{res}{center 7:-1.33}{res}{center 8:3.18}}
{center:{txt}{lalign 21:Total HH Contact}{res}{center 7:78.00}{res}{center 7:2.18}{res}{center 7:1.65}{res}{center 7:0.00}{res}{center 8:9.58}}
{txt}{center:{hline 59}}


{com}.  
.  
. * ------------------------------------------- 
.  
.  
. ** finance **
. gl co_finance revenue rev_member costs cost_member ///
>         assets assets_member liabilities liab_member goatrev goatrev_member ///
>         net_rev net_rev_member net_finances net_finances_member
{txt}
{com}.         
. ** Co-op vars
. local listsize : list sizeof global(co_finance)
{txt}
{com}. tokenize $co_finance
{txt}
{com}. 
. forv i = 1/`listsize' {c -(}
{txt}  2{com}.                 
.         quietly {c -(}
{txt}  3{com}.                 sum ``i''
{txt}  4{com}.                 return list
{txt}  5{com}.                 scalar N_``i'' = r(N) // N
{txt}  6{com}.                 scalar mean_``i'' = r(mean) // mean
{txt}  7{com}.                 scalar sd_``i'' = r(sd)  // sd
{txt}  8{com}.                 scalar min_``i'' = r(min)  // sd
{txt}  9{com}.                 scalar max_``i'' = r(max)  // sd
{txt} 10{com}.                 
.         * matrix for table
.                 matrix mat_`i' = (N_``i'',mean_``i'',sd_``i'',min_``i'',max_``i'')
{txt} 11{com}.                 {c )-}
{txt} 12{com}. {c )-}
{txt}
{com}. matrix A = mat_1
{txt}
{com}. forv i = 2/`listsize' {c -(} // appends into single matrix
{txt}  2{com}.         matrix A = A \ mat_`i'
{txt}  3{com}. {c )-}
{txt}
{com}. 
. * Table
. frmttable using MDE_summary.doc, statmat(A) sdec(2) coljust(l;c;l;l) title("Co-op Level - Finances: Summmary Stats") ///
> ctitle("","N","Mean","sd","Min","Max") ///
> rtitle("Revenue"\"Rev. per Member"\"Costs"\"Costs per Mem."\"Assets"\"Assets per Mem."\"Liabilities"\"Liabilities per Mem."\"Goat Revenue"\"Goat Rev. per Mem."\"Net Revenue"\"Net Rev. per Mem."\"Net Finances"\"Net Fin. per Mem.") ///
> note("Currency measured in USD") addtable replace
{res}
{txt}{center:Co-op Level - Finances: Summmary Stats}
{txt}{center:{hline 77}}
{center:{txt}{lalign 22:}{txt}{center 7:N}{txt}{center 11:Mean}{txt}{center 11:sd}{txt}{center 12:Min}{txt}{center 12:Max}}
{txt}{center:{hline 77}}
{center:{txt}{lalign 22:Revenue}{res}{center 7:92.00}{res}{center 11:3,775.21}{res}{center 11:8,014.47}{res}{center 12:0.00}{res}{center 12:65,709.51}}
{center:{txt}{lalign 22:Rev. per Member}{res}{center 7:92.00}{res}{center 11:7.20}{res}{center 11:10.55}{res}{center 12:0.00}{res}{center 12:63.53}}
{center:{txt}{lalign 22:Costs}{res}{center 7:92.00}{res}{center 11:377.52}{res}{center 11:1,639.07}{res}{center 12:0.00}{res}{center 12:10,964.25}}
{center:{txt}{lalign 22:Costs per Mem.}{res}{center 7:92.00}{res}{center 11:0.55}{res}{center 11:2.30}{res}{center 12:0.00}{res}{center 12:18.27}}
{center:{txt}{lalign 22:Assets}{res}{center 7:90.00}{res}{center 11:33,020.56}{res}{center 11:40,397.44}{res}{center 12:0.00}{res}{center 12:257,985.61}}
{center:{txt}{lalign 22:Assets per Mem.}{res}{center 7:90.00}{res}{center 11:107.53}{res}{center 11:379.45}{res}{center 12:0.00}{res}{center 12:3,600.00}}
{center:{txt}{lalign 22:Liabilities}{res}{center 7:90.00}{res}{center 11:7,041.03}{res}{center 11:18,065.10}{res}{center 12:0.00}{res}{center 12:86,877.45}}
{center:{txt}{lalign 22:Liabilities per Mem.}{res}{center 7:90.00}{res}{center 11:13.78}{res}{center 11:36.17}{res}{center 12:0.00}{res}{center 12:217.19}}
{center:{txt}{lalign 22:Goat Revenue}{res}{center 7:90.00}{res}{center 11:111.86}{res}{center 11:203.73}{res}{center 12:0.00}{res}{center 12:1,029.40}}
{center:{txt}{lalign 22:Goat Rev. per Mem.}{res}{center 7:90.00}{res}{center 11:0.22}{res}{center 11:0.46}{res}{center 12:0.00}{res}{center 12:3.02}}
{center:{txt}{lalign 22:Net Revenue}{res}{center 7:90.00}{res}{center 11:3,473.19}{res}{center 11:8,245.85}{res}{center 12:-7,935.00}{res}{center 12:65,554.27}}
{center:{txt}{lalign 22:Net Rev. per Mem.}{res}{center 7:90.00}{res}{center 11:6.80}{res}{center 11:10.95}{res}{center 12:-13.22}{res}{center 12:63.53}}
{center:{txt}{lalign 22:Net Finances}{res}{center 7:90.00}{res}{center 11:29,452.71}{res}{center 11:49,576.76}{res}{center 12:-75,679.20}{res}{center 12:265,235.69}}
{center:{txt}{lalign 22:Net Fin. per Mem.}{res}{center 7:90.00}{res}{center 11:100.55}{res}{center 11:384.64}{res}{center 12:-189.20}{res}{center 12:3,600.00}}
{txt}{center:{hline 77}}
{txt}{center:Currency measured in USD}


{com}.         
.         
. * ------------------------------------------- 
. 
. 
. ** goat sales **
. 
. ** Co-op vars
. gl co_goatsales goats_sold goats_sold_member goatrev goatrev_member goatrev_sold ///
>                                 col_points index_CO_goatsales
{txt}
{com}. 
. ** HH vars
. gl hh_goatsales LS8 LS9_w co_opgoatno co_opsalevalue ///
>                                 co_opshare visits_sale time_passed transp_cost index_salecost ///
>                                 net_goat_income netincome_goat
{txt}
{com}.         
. ** Co-op vars
. local listsize : list sizeof global(co_goatsales)
{txt}
{com}. tokenize $co_goatsales
{txt}
{com}. 
. forv i = 1/`listsize' {c -(}
{txt}  2{com}.                 
.         quietly {c -(}
{txt}  3{com}.                 sum ``i''
{txt}  4{com}.                 return list
{txt}  5{com}.                 scalar N_``i'' = r(N) // N
{txt}  6{com}.                 scalar mean_``i'' = r(mean) // mean
{txt}  7{com}.                 scalar sd_``i'' = r(sd)  // sd
{txt}  8{com}.                 scalar min_``i'' = r(min)  // sd
{txt}  9{com}.                 scalar max_``i'' = r(max)  // sd
{txt} 10{com}.                 
.         * matrix for table
.                 matrix mat_`i' = (N_``i'',mean_``i'',sd_``i'',min_``i'',max_``i'')
{txt} 11{com}.                 {c )-}
{txt} 12{com}. {c )-}
{txt}
{com}. matrix A = mat_1
{txt}
{com}. forv i = 2/`listsize' {c -(} // appends into single matrix
{txt}  2{com}.         matrix A = A \ mat_`i'
{txt}  3{com}. {c )-}
{txt}
{com}. 
. * Table
. frmttable using MDE_summary.doc, statmat(A) sdec(2) coljust(l;c;l;l) title("Co-op Level - Co-op Goat Sales: Summmary Stats") ///
> ctitle("","N","Mean","sd","Min","Max") ///
> rtitle("Goats Sold"\"Goats Sold per Mem."\"Goat Revenue"\"Goat Rev. per Mem."\"Rev. per Goat Sold"\"Collection Points"\"CO Goat Sales Index") ///
> note("Currency measured in USD") addtable replace
{res}
{txt}{center:Co-op Level - Co-op Goat Sales: Summmary Stats}
{txt}{center:{hline 63}}
{center:{txt}{lalign 21:}{txt}{center 7:N}{txt}{center 8:Mean}{txt}{center 8:sd}{txt}{center 7:Min}{txt}{center 10:Max}}
{txt}{center:{hline 63}}
{center:{txt}{lalign 21:Goats Sold}{res}{center 7:90.00}{res}{center 8:189.82}{res}{center 8:244.66}{res}{center 7:0.00}{res}{center 10:1,129.00}}
{center:{txt}{lalign 21:Goats Sold per Mem.}{res}{center 7:90.00}{res}{center 8:0.77}{res}{center 8:3.83}{res}{center 7:0.00}{res}{center 10:36.36}}
{center:{txt}{lalign 21:Goat Revenue}{res}{center 7:90.00}{res}{center 8:111.86}{res}{center 8:203.73}{res}{center 7:0.00}{res}{center 10:1,029.40}}
{center:{txt}{lalign 21:Goat Rev. per Mem.}{res}{center 7:90.00}{res}{center 8:0.22}{res}{center 8:0.46}{res}{center 7:0.00}{res}{center 10:3.02}}
{center:{txt}{lalign 21:Rev. per Goat Sold}{res}{center 7:70.00}{res}{center 8:0.81}{res}{center 8:0.62}{res}{center 7:0.00}{res}{center 10:2.64}}
{center:{txt}{lalign 21:Collection Points}{res}{center 7:92.00}{res}{center 8:61.94}{res}{center 8:27.88}{res}{center 7:1.11}{res}{center 10:100.00}}
{center:{txt}{lalign 21:CO Goat Sales Index}{res}{center 7:90.00}{res}{center 8:-0.01}{res}{center 8:0.90}{res}{center 7:-1.66}{res}{center 10:2.39}}
{txt}{center:{hline 63}}
{txt}{center:Currency measured in USD}


{com}.  
.  
. ** HH vars
. local listsize : list sizeof global(hh_goatsales)
{txt}
{com}. tokenize $hh_goatsales
{txt}
{com}. 
. forv i = 1/`listsize' {c -(} 
{txt}  2{com}.  
.         quietly {c -(}
{txt}  3{com}.                 sum ``i''
{txt}  4{com}.                 return list
{txt}  5{com}.                 scalar N_``i'' = r(N) // N
{txt}  6{com}.                 scalar mean_``i'' = r(mean) // mean
{txt}  7{com}.                 scalar sd_``i'' = r(sd)  // sd
{txt}  8{com}.                 scalar min_``i'' = r(min)  // sd
{txt}  9{com}.                 scalar max_``i'' = r(max)  // sd
{txt} 10{com}.                 
.         * matrix for table
.                 matrix mat_`i' = (N_``i'',mean_``i'',sd_``i'',min_``i'',max_``i'')
{txt} 11{com}.                 {c )-}
{txt} 12{com}. {c )-}
{txt}
{com}. matrix A = mat_1
{txt}
{com}. forv i = 2/`listsize' {c -(} // appends into single matrix
{txt}  2{com}.         matrix A = A \ mat_`i'
{txt}  3{com}. {c )-}
{txt}
{com}. 
. * Table
. frmttable using MDE_summary.doc, statmat(A) sdec(2) coljust(l;c;l;l) title("Co-op Level - HH Goat Sales: Summmary Stats") ///
> ctitle("","N","Mean","sd","Min","Max") ///
> rtitle("Goats Sold"\"Goat Revenue"\"# Sold through Co-op"\"Rev. through Co-op"\"% Sold through Co-op"\"Trader Visits per Sale"\"Time Passed"\"Transportation Costs"\"Sale Costs Index"\"Net Goat Income"\"Net Income per Goat") addtable replace 
{res}
{txt}{center:Co-op Level - HH Goat Sales: Summmary Stats}
{txt}{center:{hline 75}}
{center:{txt}{lalign 24:}{txt}{center 7:N}{txt}{center 11:Mean}{txt}{center 10:sd}{txt}{center 10:Min}{txt}{center 11:Max}}
{txt}{center:{hline 75}}
{center:{txt}{lalign 24:Goats Sold}{res}{center 7:92.00}{res}{center 11:2.11}{res}{center 10:0.85}{res}{center 10:0.80}{res}{center 11:5.56}}
{center:{txt}{lalign 24:Goat Revenue}{res}{center 7:92.00}{res}{center 11:17,249.91}{res}{center 10:7,817.77}{res}{center 10:4,865.86}{res}{center 11:60,121.95}}
{center:{txt}{lalign 24:# Sold through Co-op}{res}{center 7:92.00}{res}{center 11:0.44}{res}{center 10:0.64}{res}{center 10:0.00}{res}{center 11:3.22}}
{center:{txt}{lalign 24:Rev. through Co-op}{res}{center 7:92.00}{res}{center 11:3,863.52}{res}{center 10:5,347.00}{res}{center 10:0.00}{res}{center 11:22,372.73}}
{center:{txt}{lalign 24:% Sold through Co-op}{res}{center 7:92.00}{res}{center 11:0.20}{res}{center 10:0.25}{res}{center 10:0.00}{res}{center 11:0.91}}
{center:{txt}{lalign 24:Trader Visits per Sale}{res}{center 7:92.00}{res}{center 11:-5.62}{res}{center 10:50.99}{res}{center 10:-489.39}{res}{center 11:0.00}}
{center:{txt}{lalign 24:Time Passed}{res}{center 7:92.00}{res}{center 11:-0.81}{res}{center 10:0.90}{res}{center 10:-3.88}{res}{center 11:0.00}}
{center:{txt}{lalign 24:Transportation Costs}{res}{center 7:92.00}{res}{center 11:-0.07}{res}{center 10:0.40}{res}{center 10:-3.77}{res}{center 11:0.00}}
{center:{txt}{lalign 24:Sale Costs Index}{res}{center 7:92.00}{res}{center 11:0.08}{res}{center 10:0.78}{res}{center 10:-4.46}{res}{center 11:0.56}}
{center:{txt}{lalign 24:Net Goat Income}{res}{center 7:92.00}{res}{center 11:74.68}{res}{center 10:95.90}{res}{center 10:-194.03}{res}{center 11:439.59}}
{center:{txt}{lalign 24:Net Income per Goat}{res}{center 7:92.00}{res}{center 11:29.73}{res}{center 10:42.53}{res}{center 10:-155.23}{res}{center 11:108.79}}
{txt}{center:{hline 75}}


{com}.  
. * -------------------------------------------   
. 
.         
. ** Transparency **
. 
. ** Co-op vars
. gl co_trn CO_TRN1 CO_TRN2 ///
>         CO_TRN3 CO_TRN4 CO_TRN5 ///
>         CO_TRN6 CO_TRN7 index_CO_TRN
{txt}
{com}.         
. ** HH vars
. gl hh_trn HH_TRN1 HH_TRN2 ///
>         HH_TRN3 HH_TRN4 HH_TRN5 ///
>         HH_TRN6 HH_TRN7 index_HH_TRN index_dTRN avg_dTRN
{txt}
{com}. 
. 
. ** Co-op vars
. local listsize : list sizeof global(co_trn)
{txt}
{com}. tokenize $co_trn
{txt}
{com}. 
. forv i = 1/`listsize' {c -(}
{txt}  2{com}.                 
.         quietly {c -(}
{txt}  3{com}.                 sum ``i''
{txt}  4{com}.                 return list
{txt}  5{com}.                 scalar N_``i'' = r(N) // N
{txt}  6{com}.                 scalar mean_``i'' = r(mean) // mean
{txt}  7{com}.                 scalar sd_``i'' = r(sd)  // sd
{txt}  8{com}.                 scalar min_``i'' = r(min)  // sd
{txt}  9{com}.                 scalar max_``i'' = r(max)  // sd
{txt} 10{com}.                 
.         * matrix for table
.                 matrix mat_`i' = (N_``i'',mean_``i'',sd_``i'',min_``i'',max_``i'')
{txt} 11{com}.                 {c )-}
{txt} 12{com}. {c )-}
{txt}
{com}. matrix A = mat_1
{txt}
{com}. forv i = 2/`listsize' {c -(} // appends into single matrix
{txt}  2{com}.         matrix A = A \ mat_`i'
{txt}  3{com}. {c )-}
{txt}
{com}. 
. * Table
. frmttable using MDE_summary.doc, statmat(A) sdec(2) coljust(l;c;l;l) title("Co-op Level - Co-op Transparency: Summmary Stats") ///
> ctitle("","N","Mean","sd","Min","Max") ///
> rtitle("Mandate"\"Annual Report"\"Annual Budget"\"Financial Report"\"Meeting Minutes"\"Election Results"\"Sale Records"\"Co-op Index") addtable replace
{res}
{txt}{center:Co-op Level - Co-op Transparency: Summmary Stats}
{txt}{center:{hline 52}}
{center:{txt}{lalign 18:}{txt}{center 7:N}{txt}{center 6:Mean}{txt}{center 6:sd}{txt}{center 7:Min}{txt}{center 6:Max}}
{txt}{center:{hline 52}}
{center:{txt}{lalign 18:Mandate}{res}{center 7:90.00}{res}{center 6:0.81}{res}{center 6:0.38}{res}{center 7:0.00}{res}{center 6:1.00}}
{center:{txt}{lalign 18:Annual Report}{res}{center 7:90.00}{res}{center 6:0.84}{res}{center 6:0.36}{res}{center 7:0.00}{res}{center 6:1.00}}
{center:{txt}{lalign 18:Annual Budget}{res}{center 7:90.00}{res}{center 6:0.82}{res}{center 6:0.38}{res}{center 7:0.00}{res}{center 6:1.00}}
{center:{txt}{lalign 18:Financial Report}{res}{center 7:90.00}{res}{center 6:0.81}{res}{center 6:0.38}{res}{center 7:0.00}{res}{center 6:1.00}}
{center:{txt}{lalign 18:Meeting Minutes}{res}{center 7:90.00}{res}{center 6:0.78}{res}{center 6:0.40}{res}{center 7:0.00}{res}{center 6:1.00}}
{center:{txt}{lalign 18:Election Results}{res}{center 7:90.00}{res}{center 6:0.55}{res}{center 6:0.49}{res}{center 7:0.00}{res}{center 6:1.00}}
{center:{txt}{lalign 18:Sale Records}{res}{center 7:90.00}{res}{center 6:0.76}{res}{center 6:0.43}{res}{center 7:0.00}{res}{center 6:1.00}}
{center:{txt}{lalign 18:Co-op Index}{res}{center 7:90.00}{res}{center 6:0.15}{res}{center 6:0.91}{res}{center 7:-1.94}{res}{center 6:0.94}}
{txt}{center:{hline 52}}


{com}.  
.  
. ** HH vars
. local listsize : list sizeof global(hh_trn)
{txt}
{com}. tokenize $hh_trn
{txt}
{com}. 
. forv i = 1/`listsize' {c -(}
{txt}  2{com}.  
.         quietly {c -(}
{txt}  3{com}.                 sum ``i''
{txt}  4{com}.                 return list
{txt}  5{com}.                 scalar N_``i'' = r(N) // N
{txt}  6{com}.                 scalar mean_``i'' = r(mean) // mean
{txt}  7{com}.                 scalar sd_``i'' = r(sd)  // sd
{txt}  8{com}.                 scalar min_``i'' = r(min)  // sd
{txt}  9{com}.                 scalar max_``i'' = r(max)  // sd
{txt} 10{com}.                 
.         * matrix for table
.                 matrix mat_`i' = (N_``i'',mean_``i'',sd_``i'',min_``i'',max_``i'')
{txt} 11{com}.                 {c )-}
{txt} 12{com}. {c )-}
{txt}
{com}. matrix A = mat_1
{txt}
{com}. forv i = 2/`listsize' {c -(} // appends into single matrix
{txt}  2{com}.         matrix A = A \ mat_`i'
{txt}  3{com}. {c )-}
{txt}
{com}. 
. * Table
. frmttable using MDE_summary.doc, statmat(A) sdec(2) coljust(l;c;l;l) title("Co-op Level - HH Awareness: Summmary Stats") ///
> ctitle("","N","Mean","sd","Min","Max") ///
> rtitle("Mandate"\"Annual Report"\"Annual Budget"\"Financial Report"\"Meeting Minutes"\"Election Results"\"Sale Records"\"HH Index"\"Discrepancy Index"\"Avg. Discrepancy") addtable replace
{res}
{txt}{center:Co-op Level - HH Awareness: Summmary Stats}
{txt}{center:{hline 55}}
{center:{txt}{lalign 19:}{txt}{center 7:N}{txt}{center 7:Mean}{txt}{center 6:sd}{txt}{center 7:Min}{txt}{center 7:Max}}
{txt}{center:{hline 55}}
{center:{txt}{lalign 19:Mandate}{res}{center 7:92.00}{res}{center 7:0.45}{res}{center 6:0.28}{res}{center 7:0.00}{res}{center 7:1.00}}
{center:{txt}{lalign 19:Annual Report}{res}{center 7:92.00}{res}{center 7:0.52}{res}{center 6:0.30}{res}{center 7:0.00}{res}{center 7:1.00}}
{center:{txt}{lalign 19:Annual Budget}{res}{center 7:92.00}{res}{center 7:0.54}{res}{center 6:0.30}{res}{center 7:0.00}{res}{center 7:1.00}}
{center:{txt}{lalign 19:Financial Report}{res}{center 7:92.00}{res}{center 7:0.57}{res}{center 6:0.28}{res}{center 7:0.00}{res}{center 7:1.00}}
{center:{txt}{lalign 19:Meeting Minutes}{res}{center 7:92.00}{res}{center 7:0.52}{res}{center 6:0.29}{res}{center 7:0.00}{res}{center 7:1.00}}
{center:{txt}{lalign 19:Election Results}{res}{center 7:92.00}{res}{center 7:0.32}{res}{center 6:0.24}{res}{center 7:0.00}{res}{center 7:0.94}}
{center:{txt}{lalign 19:Sale Records}{res}{center 7:92.00}{res}{center 7:0.47}{res}{center 6:0.29}{res}{center 7:0.00}{res}{center 7:0.95}}
{center:{txt}{lalign 19:HH Index}{res}{center 7:92.00}{res}{center 7:0.05}{res}{center 6:1.10}{res}{center 7:-1.96}{res}{center 7:2.07}}
{center:{txt}{lalign 19:Discrepancy Index}{res}{center 7:90.00}{res}{center 7:-0.13}{res}{center 6:0.99}{res}{center 7:-3.07}{res}{center 7:1.29}}
{center:{txt}{lalign 19:Avg. Discrepancy}{res}{center 7:90.00}{res}{center 7:-0.33}{res}{center 6:0.22}{res}{center 7:-1.00}{res}{center 7:-0.02}}
{txt}{center:{hline 55}}


{com}.  
. * -------------------------------------------           
.         
. 
. 
. ** HH level dataset
. ********************************************* 
. clear
{txt}
{com}. use "$d3/r_HH_Merged_Ind.dta"
{txt}
{com}. 
. 
. ** HH indicators **
. 
. gl hh_summ COM3 COM8 index_HH_comm ///
>                                 LS8 LS9_w co_opgoatno co_opsalevalue ///
>                                 net_goat_income index_HH_goatsales ///
>                                 visits_sale time_passed transp_cost index_salecost ///
>                                 index_dTRN ///
>                                 
{txt}
{com}. 
. local listsize : list sizeof global(hh_summ)
{txt}
{com}. tokenize $hh_summ
{txt}
{com}. 
. forv i = 1/`listsize' {c -(}
{txt}  2{com}.                 
.         quietly {c -(}
{txt}  3{com}.                 sum ``i''
{txt}  4{com}.                 return list
{txt}  5{com}.                 scalar N_``i'' = r(N) // N
{txt}  6{com}.                 scalar mean_``i'' = r(mean) // mean
{txt}  7{com}.                 scalar sd_``i'' = r(sd)  // sd
{txt}  8{com}.                 scalar min_``i'' = r(min)  // sd
{txt}  9{com}.                 scalar max_``i'' = r(max)  // sd
{txt} 10{com}.                 
.         * matrix for table
.                 matrix mat_`i' = (N_``i'',mean_``i'',sd_``i'',min_``i'',max_``i'')
{txt} 11{com}.                 {c )-}
{txt} 12{com}. {c )-}
{txt}
{com}. matrix A = mat_1
{txt}
{com}. forv i = 2/`listsize' {c -(} // appends into single matrix
{txt}  2{com}.         matrix A = A \ mat_`i'
{txt}  3{com}. {c )-}
{txt}
{com}. 
. * Table
. frmttable using HH_summary.tex, tex statmat(A) sdec(2) coljust(l;c;l;l) title("Household Indicators - Summmary Statistics") ///
> ctitle("","N","Mean","sd","Min","Max") ///
> rtitle("HH info sales"\"HH info activities"\"HH level index"\"Goats Sold"\"Goat Revenue"\"# Sold through Co-op"\"Rev. through Co-op"\"Net Goat Income"\"HH Goat Sales Index"\"Trader Visits per Sale"\"Time Passed"\"Transportation Costs"\"Sale Costs Index"\"Transparency Discrepancy Index")replace
{res}
{txt}{center:Household Indicators - Summmary Statistics}
{txt}{center:{hline 80}}
{center:{txt}{lalign 32:}{txt}{center 10:N}{txt}{center 7:Mean}{txt}{center 8:sd}{txt}{center 11:Min}{txt}{center 10:Max}}
{txt}{center:{hline 80}}
{center:{txt}{lalign 32:HH info sales}{res}{center 10:1,261.00}{res}{center 7:1.37}{res}{center 8:1.75}{res}{center 11:0.00}{res}{center 10:10.00}}
{center:{txt}{lalign 32:HH info activities}{res}{center 10:2,149.00}{res}{center 7:1.10}{res}{center 8:3.50}{res}{center 11:0.00}{res}{center 10:100.00}}
{center:{txt}{lalign 32:HH level index}{res}{center 10:1,207.00}{res}{center 7:0.03}{res}{center 8:0.88}{res}{center 11:-0.52}{res}{center 10:12.13}}
{center:{txt}{lalign 32:Goats Sold}{res}{center 10:2,448.00}{res}{center 7:1.14}{res}{center 8:1.87}{res}{center 11:0.00}{res}{center 10:24.00}}
{center:{txt}{lalign 32:Goat Revenue}{res}{center 10:2,448.00}{res}{center 7:93.28}{res}{center 8:149.89}{res}{center 11:0.00}{res}{center 10:1,158.30}}
{center:{txt}{lalign 32:# Sold through Co-op}{res}{center 10:2,448.00}{res}{center 7:0.25}{res}{center 8:0.93}{res}{center 11:0.00}{res}{center 10:15.00}}
{center:{txt}{lalign 32:Rev. through Co-op}{res}{center 10:2,448.00}{res}{center 7:22.14}{res}{center 8:84.76}{res}{center 11:0.00}{res}{center 10:1,257.30}}
{center:{txt}{lalign 32:Net Goat Income}{res}{center 10:2,448.00}{res}{center 7:50.58}{res}{center 8:295.07}{res}{center 11:-9,867.33}{res}{center 10:1,158.30}}
{center:{txt}{lalign 32:HH Goat Sales Index}{res}{center 10:2,448.00}{res}{center 7:-0.06}{res}{center 8:0.91}{res}{center 11:-13.08}{res}{center 10:10.53}}
{center:{txt}{lalign 32:Trader Visits per Sale}{res}{center 10:1,276.00}{res}{center 7:-0.30}{res}{center 8:0.61}{res}{center 11:-5.00}{res}{center 10:0.00}}
{center:{txt}{lalign 32:Time Passed}{res}{center 10:1,276.00}{res}{center 7:-0.79}{res}{center 8:2.16}{res}{center 11:-30.00}{res}{center 10:0.00}}
{center:{txt}{lalign 32:Transportation Costs}{res}{center 10:1,276.00}{res}{center 7:-0.23}{res}{center 8:6.94}{res}{center 11:-247.50}{res}{center 10:0.00}}
{center:{txt}{lalign 32:Sale Costs Index}{res}{center 10:1,276.00}{res}{center 7:-0.14}{res}{center 8:0.85}{res}{center 11:-23.48}{res}{center 10:0.16}}
{center:{txt}{lalign 32:Transparency Discrepancy Index}{res}{center 10:1,647.00}{res}{center 7:0.38}{res}{center 8:0.97}{res}{center 11:-0.97}{res}{center 10:2.04}}
{txt}{center:{hline 80}}


{com}.  
. 
. 
. ** communication **
. gl hh_comm COM3 COM8 index_HH_comm HHcontact
{txt}
{com}.         
. ** Co-op vars
. local listsize : list sizeof global(hh_comm)
{txt}
{com}. tokenize $hh_comm
{txt}
{com}. 
. forv i = 1/`listsize' {c -(}
{txt}  2{com}.                 
.         quietly {c -(}
{txt}  3{com}.                 sum ``i''
{txt}  4{com}.                 return list
{txt}  5{com}.                 scalar N_``i'' = r(N) // N
{txt}  6{com}.                 scalar mean_``i'' = r(mean) // mean
{txt}  7{com}.                 scalar sd_``i'' = r(sd)  // sd
{txt}  8{com}.                 scalar min_``i'' = r(min)  // sd
{txt}  9{com}.                 scalar max_``i'' = r(max)  // sd
{txt} 10{com}.                 
.         * matrix for table
.                 matrix mat_`i' = (N_``i'',mean_``i'',sd_``i'',min_``i'',max_``i'')
{txt} 11{com}.                 {c )-}
{txt} 12{com}. {c )-}
{txt}
{com}. matrix A = mat_1
{txt}
{com}. forv i = 2/`listsize' {c -(} // appends into single matrix
{txt}  2{com}.         matrix A = A \ mat_`i'
{txt}  3{com}. {c )-}
{txt}
{com}. 
. * Table
. frmttable using MDE_summary.doc, statmat(A) sdec(2) coljust(l;c;l;l) title("HH Level - Communication: Summmary Stats") ///
> ctitle("","N","Mean","sd","Min","Max") ///
> rtitle("HH info sales"\"HH info activities"\"HH level index"\"Total HH Contact") addtable replace
{res}
{txt}{center:HH Level - Communication: Summmary Stats}
{txt}{center:{hline 59}}
{center:{txt}{lalign 20:}{txt}{center 10:N}{txt}{center 6:Mean}{txt}{center 6:sd}{txt}{center 7:Min}{txt}{center 8:Max}}
{txt}{center:{hline 59}}
{center:{txt}{lalign 20:HH info sales}{res}{center 10:1,261.00}{res}{center 6:1.37}{res}{center 6:1.75}{res}{center 7:0.00}{res}{center 8:10.00}}
{center:{txt}{lalign 20:HH info activities}{res}{center 10:2,149.00}{res}{center 6:1.10}{res}{center 6:3.50}{res}{center 7:0.00}{res}{center 8:100.00}}
{center:{txt}{lalign 20:HH level index}{res}{center 10:1,207.00}{res}{center 6:0.03}{res}{center 6:0.88}{res}{center 7:-0.52}{res}{center 8:12.13}}
{center:{txt}{lalign 20:Total HH Contact}{res}{center 10:1,207.00}{res}{center 6:2.56}{res}{center 6:3.06}{res}{center 7:0.00}{res}{center 8:31.00}}
{txt}{center:{hline 59}}


{com}.  
.  
. * ------------------------------------------- 
. 
. ** goat sales **
. 
. ** Co-op vars
. gl co_goatsales goats_sold goats_sold_member goatrev goatrev_member goatrev_sold ///
>                                 col_points index_CO_goatsales
{txt}
{com}. 
. gl hh_goatsales LS8 LS9 co_opgoatno co_opsalevalue ///
>                                 co_opshare visits_sale LS41 LS42 index_salecost ///
>                                 net_goat_income netincome_goat
{txt}
{com}. 
. 
.  
. ** HH vars
. local listsize : list sizeof global(hh_goatsales)
{txt}
{com}. tokenize $hh_goatsales
{txt}
{com}. 
. forv i = 1/`listsize' {c -(} 
{txt}  2{com}.  
.         quietly {c -(}
{txt}  3{com}.                 sum ``i''
{txt}  4{com}.                 return list
{txt}  5{com}.                 scalar N_``i'' = r(N) // N
{txt}  6{com}.                 scalar mean_``i'' = r(mean) // mean
{txt}  7{com}.                 scalar sd_``i'' = r(sd)  // sd
{txt}  8{com}.                 scalar min_``i'' = r(min)  // sd
{txt}  9{com}.                 scalar max_``i'' = r(max)  // sd
{txt} 10{com}.                 
.         * matrix for table
.                 matrix mat_`i' = (N_``i'',mean_``i'',sd_``i'',min_``i'',max_``i'')
{txt} 11{com}.                 {c )-}
{txt} 12{com}. {c )-}
{txt}
{com}. matrix A = mat_1
{txt}
{com}. forv i = 2/`listsize' {c -(} // appends into single matrix
{txt}  2{com}.         matrix A = A \ mat_`i'
{txt}  3{com}. {c )-}
{txt}
{com}. 
. * Table
. frmttable using MDE_summary.doc, statmat(A) sdec(2) coljust(l;c;l;l) title("HH Level - HH Goat Sales: Summmary Stats") ///
> ctitle("","N","Mean","sd","Min","Max") ///
> rtitle("Goats Sold"\"Goat Revenue"\"# Sold through Co-op"\"Rev. through Co-op"\"% Sold through Co-op"\"Trader Visits per Sale"\"Time Passed"\"Transportation Costs"\"Sale Costs Index"\"Net Goat Income"\"Net Income per Goat") ///
> note("Currency measured in USD") addtable replace 
{res}
{txt}{center:HH Level - HH Goat Sales: Summmary Stats}
{txt}{center:{hline 81}}
{center:{txt}{lalign 24:}{txt}{center 10:N}{txt}{center 11:Mean}{txt}{center 11:sd}{txt}{center 11:Min}{txt}{center 12:Max}}
{txt}{center:{hline 81}}
{center:{txt}{lalign 24:Goats Sold}{res}{center 10:2,448.00}{res}{center 11:1.14}{res}{center 11:1.87}{res}{center 11:0.00}{res}{center 12:24.00}}
{center:{txt}{lalign 24:Goat Revenue}{res}{center 10:1,276.00}{res}{center 11:18,654.50}{res}{center 11:21,235.84}{res}{center 11:0.00}{res}{center 12:353,191.25}}
{center:{txt}{lalign 24:# Sold through Co-op}{res}{center 10:2,448.00}{res}{center 11:0.25}{res}{center 11:0.93}{res}{center 11:0.00}{res}{center 12:15.00}}
{center:{txt}{lalign 24:Rev. through Co-op}{res}{center 10:2,448.00}{res}{center 11:22.14}{res}{center 11:84.76}{res}{center 11:0.00}{res}{center 12:1,257.30}}
{center:{txt}{lalign 24:% Sold through Co-op}{res}{center 10:2,448.00}{res}{center 11:0.10}{res}{center 11:0.29}{res}{center 11:0.00}{res}{center 12:1.00}}
{center:{txt}{lalign 24:Trader Visits per Sale}{res}{center 10:1,276.00}{res}{center 11:-0.30}{res}{center 11:0.61}{res}{center 11:-5.00}{res}{center 12:0.00}}
{center:{txt}{lalign 24:Time Passed}{res}{center 10:1,276.00}{res}{center 11:0.79}{res}{center 11:2.16}{res}{center 11:0.00}{res}{center 12:30.00}}
{center:{txt}{lalign 24:Transportation Costs}{res}{center 10:1,276.00}{res}{center 11:23.14}{res}{center 11:701.05}{res}{center 11:0.00}{res}{center 12:25,000.00}}
{center:{txt}{lalign 24:Sale Costs Index}{res}{center 10:1,276.00}{res}{center 11:-0.14}{res}{center 11:0.85}{res}{center 11:-23.48}{res}{center 12:0.16}}
{center:{txt}{lalign 24:Net Goat Income}{res}{center 10:2,448.00}{res}{center 11:50.58}{res}{center 11:295.07}{res}{center 11:-9,867.33}{res}{center 12:1,158.30}}
{center:{txt}{lalign 24:Net Income per Goat}{res}{center 10:1,214.00}{res}{center 11:61.77}{res}{center 11:67.77}{res}{center 11:-1,233.42}{res}{center 12:246.51}}
{txt}{center:{hline 81}}
{txt}{center:Currency measured in USD}


{com}.  
. * -------------------------------------------   
. 
.         
. ** Transparency **
. 
. ** HH vars
. gl hh_trn_d HH_TRN1 HH_TRN2 ///
>         HH_TRN3 HH_TRN4 HH_TRN5 ///
>         HH_TRN6 HH_TRN7 index_HH_TRN avg_dTRN
{txt}
{com}. 
. 
. ** Co-op vars
. local listsize : list sizeof global(co_trn)
{txt}
{com}. tokenize $co_trn
{txt}
{com}. 
. forv i = 1/`listsize' {c -(}
{txt}  2{com}.                 
.         quietly {c -(}
{txt}  3{com}.                 sum ``i''
{txt}  4{com}.                 return list
{txt}  5{com}.                 scalar N_``i'' = r(N) // N
{txt}  6{com}.                 scalar mean_``i'' = r(mean) // mean
{txt}  7{com}.                 scalar sd_``i'' = r(sd)  // sd
{txt}  8{com}.                 scalar min_``i'' = r(min)  // sd
{txt}  9{com}.                 scalar max_``i'' = r(max)  // sd
{txt} 10{com}.                 
.         * matrix for table
.                 matrix mat_`i' = (N_``i'',mean_``i'',sd_``i'',min_``i'',max_``i'')
{txt} 11{com}.                 {c )-}
{txt} 12{com}. {c )-}
{txt}
{com}. matrix A = mat_1
{txt}
{com}. forv i = 2/`listsize' {c -(} // appends into single matrix
{txt}  2{com}.         matrix A = A \ mat_`i'
{txt}  3{com}. {c )-}
{txt}
{com}. 
. * Table
. frmttable using MDE_summary.doc, statmat(A) sdec(2) coljust(l;c;l;l) title("HH Level - Co-op Transparency: Summmary Stats") ///
> ctitle("","N","Mean","sd","Min","Max") ///
> rtitle("Mandate"\"Annual Report"\"Annual Budget"\"Financial Report"\"Meeting Minutes"\"Election Results"\"Sale Records"\"Co-op Index") addtable replace
{res}
{txt}{center:HH Level - Co-op Transparency: Summmary Stats}
{txt}{center:{hline 55}}
{center:{txt}{lalign 18:}{txt}{center 10:N}{txt}{center 6:Mean}{txt}{center 6:sd}{txt}{center 7:Min}{txt}{center 6:Max}}
{txt}{center:{hline 55}}
{center:{txt}{lalign 18:Mandate}{res}{center 10:2,400.00}{res}{center 6:0.80}{res}{center 6:0.37}{res}{center 7:0.00}{res}{center 6:1.00}}
{center:{txt}{lalign 18:Annual Report}{res}{center 10:2,400.00}{res}{center 6:0.83}{res}{center 6:0.34}{res}{center 7:0.00}{res}{center 6:1.00}}
{center:{txt}{lalign 18:Annual Budget}{res}{center 10:2,400.00}{res}{center 6:0.81}{res}{center 6:0.37}{res}{center 7:0.00}{res}{center 6:1.00}}
{center:{txt}{lalign 18:Financial Report}{res}{center 10:2,400.00}{res}{center 6:0.80}{res}{center 6:0.37}{res}{center 7:0.00}{res}{center 6:1.00}}
{center:{txt}{lalign 18:Meeting Minutes}{res}{center 10:2,400.00}{res}{center 6:0.77}{res}{center 6:0.39}{res}{center 7:0.00}{res}{center 6:1.00}}
{center:{txt}{lalign 18:Election Results}{res}{center 10:2,400.00}{res}{center 6:0.54}{res}{center 6:0.47}{res}{center 7:0.00}{res}{center 6:1.00}}
{center:{txt}{lalign 18:Sale Records}{res}{center 10:2,400.00}{res}{center 6:0.76}{res}{center 6:0.41}{res}{center 7:0.00}{res}{center 6:1.00}}
{center:{txt}{lalign 18:Co-op Index}{res}{center 10:2,400.00}{res}{center 6:0.14}{res}{center 6:0.94}{res}{center 7:-2.10}{res}{center 6:1.01}}
{txt}{center:{hline 55}}


{com}.  
.  
. ** HH vars
. local listsize : list sizeof global(hh_trn_d)
{txt}
{com}. tokenize $hh_trn_d
{txt}
{com}. 
. forv i = 1/`listsize' {c -(}
{txt}  2{com}.  
.         quietly {c -(}
{txt}  3{com}.                 sum ``i''
{txt}  4{com}.                 return list
{txt}  5{com}.                 scalar N_``i'' = r(N) // N
{txt}  6{com}.                 scalar mean_``i'' = r(mean) // mean
{txt}  7{com}.                 scalar sd_``i'' = r(sd)  // sd
{txt}  8{com}.                 scalar min_``i'' = r(min)  // sd
{txt}  9{com}.                 scalar max_``i'' = r(max)  // sd
{txt} 10{com}.                 
.         * matrix for table
.                 matrix mat_`i' = (N_``i'',mean_``i'',sd_``i'',min_``i'',max_``i'')
{txt} 11{com}.                 {c )-}
{txt} 12{com}. {c )-}
{txt}
{com}. matrix A = mat_1
{txt}
{com}. forv i = 2/`listsize' {c -(} // appends into single matrix
{txt}  2{com}.         matrix A = A \ mat_`i'
{txt}  3{com}. {c )-}
{txt}
{com}. 
. * Table
. frmttable using MDE_summary.doc, statmat(A) sdec(2) coljust(l;c;l;l) title("HH Level - HH Awareness: Summmary Stats") ///
> ctitle("","N","Mean","sd","Min","Max") ///
> rtitle("Mandate"\"Annual Report"\"Annual Budget"\"Financial Report"\"Meeting Minutes"\"Election Results"\"Sale Records"\"HH Index"\"Avg. Discrepancy") addtable replace
{res}
{txt}{center:HH Level - HH Awareness: Summmary Stats}
{txt}{center:{hline 55}}
{center:{txt}{lalign 18:}{txt}{center 10:N}{txt}{center 6:Mean}{txt}{center 6:sd}{txt}{center 7:Min}{txt}{center 6:Max}}
{txt}{center:{hline 55}}
{center:{txt}{lalign 18:Mandate}{res}{center 10:1,930.00}{res}{center 6:0.45}{res}{center 6:0.50}{res}{center 7:0.00}{res}{center 6:1.00}}
{center:{txt}{lalign 18:Annual Report}{res}{center 10:1,938.00}{res}{center 6:0.52}{res}{center 6:0.50}{res}{center 7:0.00}{res}{center 6:1.00}}
{center:{txt}{lalign 18:Annual Budget}{res}{center 10:1,952.00}{res}{center 6:0.54}{res}{center 6:0.50}{res}{center 7:0.00}{res}{center 6:1.00}}
{center:{txt}{lalign 18:Financial Report}{res}{center 10:1,937.00}{res}{center 6:0.56}{res}{center 6:0.50}{res}{center 7:0.00}{res}{center 6:1.00}}
{center:{txt}{lalign 18:Meeting Minutes}{res}{center 10:1,996.00}{res}{center 6:0.54}{res}{center 6:0.50}{res}{center 7:0.00}{res}{center 6:1.00}}
{center:{txt}{lalign 18:Election Results}{res}{center 10:1,821.00}{res}{center 6:0.32}{res}{center 6:0.47}{res}{center 7:0.00}{res}{center 6:1.00}}
{center:{txt}{lalign 18:Sale Records}{res}{center 10:1,919.00}{res}{center 6:0.48}{res}{center 6:0.50}{res}{center 7:0.00}{res}{center 6:1.00}}
{center:{txt}{lalign 18:HH Index}{res}{center 10:1,667.00}{res}{center 6:0.22}{res}{center 6:1.03}{res}{center 7:-0.95}{res}{center 6:1.65}}
{center:{txt}{lalign 18:Avg. Discrepancy}{res}{center 10:2,092.00}{res}{center 6:0.46}{res}{center 6:0.37}{res}{center 7:0.00}{res}{center 6:1.00}}
{txt}{center:{hline 55}}


{com}.  
.         
. 
{txt}end of do-file

{com}. do "/var/folders/_d/jk4yrpt11pbc34dyw8cg5kjm0000gn/T//SD01678.000000"
{txt}
{com}. gl hh_goatsales LS8 LS9_w co_opgoatno co_opsalevalue ///

{txt}end of do-file

{com}. do "/var/folders/_d/jk4yrpt11pbc34dyw8cg5kjm0000gn/T//SD01678.000000"
{txt}
{com}. clear all
{res}{txt}
{com}. set more off, perm
{txt}({cmd:set more} preference recorded)

{com}. 
. *log
. cap log close
{smcl}
{com}{sf}{ul off}