{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}/Users/scottmiller/GitHub/LSIL_PAP/lsilPAP1.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res}17 May 2019, 14:42:29
{txt}
{com}. 
. 
. /*******************************************************************************
> lsilPAP1.d0             
>                                         
> - Merge true and randomized treatment status from lsilPAP_rand1/2
>         into clean datasets to be used for power calculations
>         
> *******************************************************************************/
. 
. ** Load merged baseline dataset
. use "$d3/Baseline_Merged.dta", clear
{txt}
{com}. 
. 
. ** Add true and randomized treatment status to this dataset
. * Merge treatment status from original randomization
. 
. * Original dataset
. clear
{txt}
{com}. use "$d4/Merged/r_Baseline_Merged_Str.dta"
{txt}( )

{com}. recast str99 idx // idx is str99 in Baseline_Merged
{txt}
{com}. 
. keep idx treat r_treat strata
{txt}
{com}. 
. save "$d3/treat.dta", replace
{txt}file /Users/scottmiller/Dropbox (UFL)/LSIL/Pre-Analysis Plan/Stata Files/PAP Data/LSIL-DATA_scott/VCC baseline clean/treat.dta saved

{com}. 
. merge 1:1 idx using "$d3/Baseline_Merged.dta"
{res}
{txt}{col 5}Result{col 38}# of obs.
{col 5}{hline 41}
{col 5}not matched{col 30}{res}               2
{txt}{col 9}from master{col 30}{res}               0{txt}  (_merge==1)
{col 9}from using{col 30}{res}               2{txt}  (_merge==2)

{col 5}matched{col 30}{res}             106{txt}  (_merge==3)
{col 5}{hline 41}

{com}. drop if _merge == 2 // co-ops dropped in original treatment status
{txt}(2 observations deleted)

{com}. drop if district == "Banke"
{txt}(14 observations deleted)

{com}. 
. save "$d3/r_Baseline_Merged_Str.dta", replace
{txt}file /Users/scottmiller/Dropbox (UFL)/LSIL/Pre-Analysis Plan/Stata Files/PAP Data/LSIL-DATA_scott/VCC baseline clean/r_Baseline_Merged_Str.dta saved

{com}. 
.  
. 
{txt}end of do-file

{com}. do "/var/folders/_d/jk4yrpt11pbc34dyw8cg5kjm0000gn/T//SD01875.000000"
{txt}
{com}. clear all
{res}{txt}
{com}. set more off, perm
{txt}({cmd:set more} preference recorded)

{com}. 
. *log
. cap log close
{smcl}
{com}{sf}{ul off}