{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}/Users/scottmiller/Dropbox (UFL)/LSIL/Pre-Analysis Plan/PAP Master Replication/Stata Files/lsilPAP5.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res}11 Jun 2019, 12:32:13
{txt}
{com}. 
. 
. 
. cd "$d2"
{res}/Users/scottmiller/Dropbox (UFL)/LSIL/Pre-Analysis Plan/PAP Master Replication/Output
{txt}
{com}. 
. ** HH level dataset
. ********************************************* 
. clear
{txt}
{com}. use "$d3/r_HH_Merged_Ind.dta"
{txt}
{com}. encode idx, gen(idx_n)
{txt}
{com}. 
. 
. * Communication
. 
. *** Strata dummies - No interaction
. gl hh_comm bCOM3 index_dTRN
{txt}
{com}. 
. local listsize : list sizeof global(hh_comm)
{txt}
{com}. tokenize $hh_comm
{txt}
{com}. 
. forv i = 1/`listsize' {c -(}
{txt}  2{com}. 
.         reg ``i'' r_treat i.str, cluster(idx)
{txt}  3{com}.         
.         quietly {c -(}
{txt}  4{com}.                 ereturn list
{txt}  5{com}.                 scalar t_a = invttail(`e(df_r)',0.025) // alpha t-value
{txt}  6{com}.                 scalar t_b = invttail(`e(df_r)',0.2) // beta t-value
{txt}  7{com}.                 scalar mde_``i'' = (t_a + t_b)*_se[r_treat]
{txt}  8{com}.                 
.         * Calculate MDE as % of mean & # of standard deviations
.                 sum ``i''
{txt}  9{com}.                 scalar mean_``i'' = mde_``i'' / r(mean) // % of treatment mean
{txt} 10{com}.                 scalar sd_``i'' = mde_``i'' / r(sd)  // # of treatment sd's
{txt} 11{com}. 
.         * matrix for table
.                 matrix mat_`i' = (mde_``i'',mean_``i'',sd_``i'')
{txt} 12{com}.                 {c )-}
{txt} 13{com}. {c )-}

{txt}Linear regression                               Number of obs     = {res}     2,448
                                                {txt}F(24, 91)         =  {res}    16.96
                                                {txt}Prob > F          = {res}    0.0000
                                                {txt}R-squared         = {res}    0.1366
                                                {txt}Root MSE          =    {res}  .4231

{txt}{ralign 78:(Std. Err. adjusted for {res:92} clusters in idx)}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}       bCOM3{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}r_treat {c |}{col 14}{res}{space 2} .0309829{col 26}{space 2} .0478771{col 37}{space 1}    0.65{col 46}{space 3}0.519{col 54}{space 4}-.0641191{col 67}{space 3}  .126085
{txt}{space 12} {c |}
{space 6}strata {c |}
{space 8}112  {c |}{col 14}{res}{space 2} .0103276{col 26}{space 2} .0200977{col 37}{space 1}    0.51{col 46}{space 3}0.609{col 54}{space 4}-.0295939{col 67}{space 3} .0502492
{txt}{space 8}121  {c |}{col 14}{res}{space 2} .4218305{col 26}{space 2} .2571337{col 37}{space 1}    1.64{col 46}{space 3}0.104{col 54}{space 4}-.0889341{col 67}{space 3}  .932595
{txt}{space 8}122  {c |}{col 14}{res}{space 2} .5020655{col 26}{space 2} .0958493{col 37}{space 1}    5.24{col 46}{space 3}0.000{col 54}{space 4} .3116727{col 67}{space 3} .6924584
{txt}{space 8}211  {c |}{col 14}{res}{space 2} .0242165{col 26}{space 2} .0251742{col 37}{space 1}    0.96{col 46}{space 3}0.339{col 54}{space 4}-.0257889{col 67}{space 3} .0742219
{txt}{space 8}212  {c |}{col 14}{res}{space 2} .1700499{col 26}{space 2} .0813361{col 37}{space 1}    2.09{col 46}{space 3}0.039{col 54}{space 4} .0084857{col 67}{space 3}  .331614
{txt}{space 8}221  {c |}{col 14}{res}{space 2} .3384972{col 26}{space 2} .1698464{col 37}{space 1}    1.99{col 46}{space 3}0.049{col 54}{space 4} .0011182{col 67}{space 3} .6758761
{txt}{space 8}222  {c |}{col 14}{res}{space 2} .2864138{col 26}{space 2} .1229089{col 37}{space 1}    2.33{col 46}{space 3}0.022{col 54}{space 4} .0422704{col 67}{space 3} .5305572
{txt}{space 8}311  {c |}{col 14}{res}{space 2} .4722222{col 26}{space 2} .1015845{col 37}{space 1}    4.65{col 46}{space 3}0.000{col 54}{space 4} .2704371{col 67}{space 3} .6740073
{txt}{space 8}312  {c |}{col 14}{res}{space 2} .1640848{col 26}{space 2} .1206307{col 37}{space 1}    1.36{col 46}{space 3}0.177{col 54}{space 4}-.0755332{col 67}{space 3} .4037027
{txt}{space 8}321  {c |}{col 14}{res}{space 2} .5572472{col 26}{space 2} .0417503{col 37}{space 1}   13.35{col 46}{space 3}0.000{col 54}{space 4} .4743153{col 67}{space 3}  .640179
{txt}{space 8}322  {c |}{col 14}{res}{space 2} .4609598{col 26}{space 2} .0790959{col 37}{space 1}    5.83{col 46}{space 3}0.000{col 54}{space 4} .3038455{col 67}{space 3}  .618074
{txt}{space 8}411  {c |}{col 14}{res}{space 2} .1509972{col 26}{space 2} .1006999{col 37}{space 1}    1.50{col 46}{space 3}0.137{col 54}{space 4}-.0490309{col 67}{space 3} .3510252
{txt}{space 8}412  {c |}{col 14}{res}{space 2} .4843305{col 26}{space 2} .1968403{col 37}{space 1}    2.46{col 46}{space 3}0.016{col 54}{space 4} .0933313{col 67}{space 3} .8753296
{txt}{space 8}421  {c |}{col 14}{res}{space 2} .5155805{col 26}{space 2} .0675509{col 37}{space 1}    7.63{col 46}{space 3}0.000{col 54}{space 4}  .381399{col 67}{space 3}  .649762
{txt}{space 8}422  {c |}{col 14}{res}{space 2} .3332621{col 26}{space 2} .0777066{col 37}{space 1}    4.29{col 46}{space 3}0.000{col 54}{space 4} .1789076{col 67}{space 3} .4876166
{txt}{space 8}511  {c |}{col 14}{res}{space 2} .0155805{col 26}{space 2} .0141697{col 37}{space 1}    1.10{col 46}{space 3}0.274{col 54}{space 4}-.0125659{col 67}{space 3} .0437269
{txt}{space 8}512  {c |}{col 14}{res}{space 2} .3489138{col 26}{space 2} .1832027{col 37}{space 1}    1.90{col 46}{space 3}0.060{col 54}{space 4}-.0149959{col 67}{space 3} .7128235
{txt}{space 8}521  {c |}{col 14}{res}{space 2} .3072472{col 26}{space 2} .1626975{col 37}{space 1}    1.89{col 46}{space 3}0.062{col 54}{space 4}-.0159314{col 67}{space 3} .6304258
{txt}{space 8}522  {c |}{col 14}{res}{space 2} .2343305{col 26}{space 2} .0602562{col 37}{space 1}    3.89{col 46}{space 3}0.000{col 54}{space 4} .1146389{col 67}{space 3}  .354022
{txt}{space 8}611  {c |}{col 14}{res}{space 2} .4739138{col 26}{space 2} .0929541{col 37}{space 1}    5.10{col 46}{space 3}0.000{col 54}{space 4} .2892718{col 67}{space 3} .6585558
{txt}{space 8}612  {c |}{col 14}{res}{space 2} .2239138{col 26}{space 2}  .118525{col 37}{space 1}    1.89{col 46}{space 3}0.062{col 54}{space 4}-.0115215{col 67}{space 3} .4593492
{txt}{space 8}621  {c |}{col 14}{res}{space 2} .1853989{col 26}{space 2} .1623837{col 37}{space 1}    1.14{col 46}{space 3}0.257{col 54}{space 4}-.1371563{col 67}{space 3} .5079541
{txt}{space 8}622  {c |}{col 14}{res}{space 2} .1603989{col 26}{space 2} .1144462{col 37}{space 1}    1.40{col 46}{space 3}0.164{col 54}{space 4}-.0669345{col 67}{space 3} .3877322
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2}-.0206553{col 26}{space 2} .0330967{col 37}{space 1}   -0.62{col 46}{space 3}0.534{col 54}{space 4}-.0863977{col 67}{space 3} .0450872
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}Linear regression                               Number of obs     = {res}     1,647
                                                {txt}{help j_robustsingular:F(23, 89) }        =  {res}        .
                                                {txt}Prob > F          = {res}         .
                                                {txt}R-squared         = {res}    0.2389
                                                {txt}Root MSE          =    {res} .91951

{txt}{ralign 78:(Std. Err. adjusted for {res:90} clusters in idx)}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}  index_dTRN{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}r_treat {c |}{col 14}{res}{space 2} .0248035{col 26}{space 2} .1374547{col 37}{space 1}    0.18{col 46}{space 3}0.857{col 54}{space 4}-.2483161{col 67}{space 3} .2979231
{txt}{space 12} {c |}
{space 6}strata {c |}
{space 8}112  {c |}{col 14}{res}{space 2} 1.315881{col 26}{space 2}  .345356{col 37}{space 1}    3.81{col 46}{space 3}0.000{col 54}{space 4} .6296663{col 67}{space 3} 2.002096
{txt}{space 8}121  {c |}{col 14}{res}{space 2} .7379763{col 26}{space 2} .2195565{col 37}{space 1}    3.36{col 46}{space 3}0.001{col 54}{space 4} .3017222{col 67}{space 3}  1.17423
{txt}{space 8}122  {c |}{col 14}{res}{space 2} 1.241659{col 26}{space 2} .2543815{col 37}{space 1}    4.88{col 46}{space 3}0.000{col 54}{space 4} .7362081{col 67}{space 3} 1.747109
{txt}{space 8}211  {c |}{col 14}{res}{space 2}  .477569{col 26}{space 2} .3677318{col 37}{space 1}    1.30{col 46}{space 3}0.197{col 54}{space 4}-.2531062{col 67}{space 3} 1.208244
{txt}{space 8}212  {c |}{col 14}{res}{space 2}-.1754155{col 26}{space 2} .4960211{col 37}{space 1}   -0.35{col 46}{space 3}0.724{col 54}{space 4}-1.160999{col 67}{space 3} .8101678
{txt}{space 8}221  {c |}{col 14}{res}{space 2}  .213569{col 26}{space 2} .4497064{col 37}{space 1}    0.47{col 46}{space 3}0.636{col 54}{space 4} -.679988{col 67}{space 3} 1.107126
{txt}{space 8}222  {c |}{col 14}{res}{space 2} .9114405{col 26}{space 2} .3411273{col 37}{space 1}    2.67{col 46}{space 3}0.009{col 54}{space 4} .2336279{col 67}{space 3} 1.589253
{txt}{space 8}311  {c |}{col 14}{res}{space 2} 1.223203{col 26}{space 2} .2493808{col 37}{space 1}    4.90{col 46}{space 3}0.000{col 54}{space 4} .7276882{col 67}{space 3} 1.718717
{txt}{space 8}312  {c |}{col 14}{res}{space 2} .7313541{col 26}{space 2}  .253466{col 37}{space 1}    2.89{col 46}{space 3}0.005{col 54}{space 4} .2277225{col 67}{space 3} 1.234986
{txt}{space 8}321  {c |}{col 14}{res}{space 2} .9602566{col 26}{space 2} .3028466{col 37}{space 1}    3.17{col 46}{space 3}0.002{col 54}{space 4} .3585069{col 67}{space 3} 1.562006
{txt}{space 8}322  {c |}{col 14}{res}{space 2} .0740268{col 26}{space 2} .4256004{col 37}{space 1}    0.17{col 46}{space 3}0.862{col 54}{space 4}-.7716322{col 67}{space 3} .9196857
{txt}{space 8}411  {c |}{col 14}{res}{space 2} .6405597{col 26}{space 2} .2523789{col 37}{space 1}    2.54{col 46}{space 3}0.013{col 54}{space 4} .1390881{col 67}{space 3} 1.142031
{txt}{space 8}412  {c |}{col 14}{res}{space 2} 1.074989{col 26}{space 2} .2387187{col 37}{space 1}    4.50{col 46}{space 3}0.000{col 54}{space 4} .6006602{col 67}{space 3} 1.549318
{txt}{space 8}421  {c |}{col 14}{res}{space 2} 1.134946{col 26}{space 2} .2100194{col 37}{space 1}    5.40{col 46}{space 3}0.000{col 54}{space 4} .7176423{col 67}{space 3}  1.55225
{txt}{space 8}422  {c |}{col 14}{res}{space 2} 1.520696{col 26}{space 2} .2994363{col 37}{space 1}    5.08{col 46}{space 3}0.000{col 54}{space 4} .9257221{col 67}{space 3} 2.115669
{txt}{space 8}511  {c |}{col 14}{res}{space 2} 1.015641{col 26}{space 2} .3061675{col 37}{space 1}    3.32{col 46}{space 3}0.001{col 54}{space 4} .4072927{col 67}{space 3} 1.623989
{txt}{space 8}512  {c |}{col 14}{res}{space 2} 1.338764{col 26}{space 2} .2905471{col 37}{space 1}    4.61{col 46}{space 3}0.000{col 54}{space 4}  .761453{col 67}{space 3} 1.916075
{txt}{space 8}521  {c |}{col 14}{res}{space 2} .9642754{col 26}{space 2} .3315079{col 37}{space 1}    2.91{col 46}{space 3}0.005{col 54}{space 4} .3055763{col 67}{space 3} 1.622975
{txt}{space 8}522  {c |}{col 14}{res}{space 2} .8139162{col 26}{space 2} .4414715{col 37}{space 1}    1.84{col 46}{space 3}0.069{col 54}{space 4}-.0632782{col 67}{space 3} 1.691111
{txt}{space 8}611  {c |}{col 14}{res}{space 2} 1.014165{col 26}{space 2} .2605923{col 37}{space 1}    3.89{col 46}{space 3}0.000{col 54}{space 4} .4963731{col 67}{space 3} 1.531956
{txt}{space 8}612  {c |}{col 14}{res}{space 2} 1.082117{col 26}{space 2} .3785619{col 37}{space 1}    2.86{col 46}{space 3}0.005{col 54}{space 4} .3299222{col 67}{space 3} 1.834311
{txt}{space 8}621  {c |}{col 14}{res}{space 2} .0063508{col 26}{space 2} .3539191{col 37}{space 1}    0.02{col 46}{space 3}0.986{col 54}{space 4} -.696879{col 67}{space 3} .7095806
{txt}{space 8}622  {c |}{col 14}{res}{space 2} .1374408{col 26}{space 2} .3056065{col 37}{space 1}    0.45{col 46}{space 3}0.654{col 54}{space 4}-.4697929{col 67}{space 3} .7446745
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2}-.4242025{col 26}{space 2} .2195565{col 37}{space 1}   -1.93{col 46}{space 3}0.057{col 54}{space 4}-.8604566{col 67}{space 3} .0120516
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. matrix A = mat_1
{txt}
{com}. forv i = 2/`listsize' {c -(} // appends into single matrix
{txt}  2{com}.         matrix A = A \ mat_`i'
{txt}  3{com}. {c )-}
{txt}
{com}. 
. 
. * Strata table
. frmttable using MDE_1.doc, statmat(A) sdec(4) title("Communication") ///
> ctitle("","MDE","% of mean","# of sd's.") ///
> rtitle("HH received sale info"\"Transparency index") replace
{res}
{txt}{center:Communication}
{txt}{center:{hline 56}}
{center:{txt}{lalign 23:}{txt}{center 8:MDE}{txt}{center 11:% of mean}{txt}{center 12:# of sd's.}}
{txt}{center:{hline 56}}
{center:{txt}{lalign 23:HH received sale info}{res}{center 8:0.1356}{res}{center 11:0.4701}{res}{center 12:0.2992}}
{center:{txt}{lalign 23:Transparency index}{res}{center 8:0.3894}{res}{center 11:1.2478}{res}{center 12:0.3722}}
{txt}{center:{hline 56}}


{com}. 
. 
. * Goat Sales
. 
. ** HH vars
. gl hh_goatsales co_opgoatno_w LS8_w
{txt}
{com}. 
. local listsize : list sizeof global(hh_goatsales)
{txt}
{com}. tokenize $hh_goatsales
{txt}
{com}. 
. forv i = 1/`listsize' {c -(}
{txt}  2{com}. 
.         reg ``i'' r_treat i.str, cluster(idx)
{txt}  3{com}.         
.         quietly {c -(}
{txt}  4{com}.                 ereturn list
{txt}  5{com}.                 scalar t_a = invttail(`e(df_r)',0.025) // alpha t-value
{txt}  6{com}.                 scalar t_b = invttail(`e(df_r)',0.2) // beta t-value
{txt}  7{com}.                 scalar mde_``i'' = (t_a + t_b)*_se[r_treat]
{txt}  8{com}.                 
.         * Calculate MDE as % of mean & # of standard deviations
.                 sum ``i''
{txt}  9{com}.                 scalar mean_``i'' = mde_``i'' / r(mean) // % of treatment mean
{txt} 10{com}.                 scalar sd_``i'' = mde_``i'' / r(sd)  // # of treatment sd's
{txt} 11{com}. 
.         * matrix for table
.                 matrix mat_`i' = (mde_``i'',mean_``i'',sd_``i'')
{txt} 12{com}.                 {c )-}
{txt} 13{com}. {c )-}

{txt}Linear regression                               Number of obs     = {res}     2,448
                                                {txt}F(24, 91)         =  {res}     6.04
                                                {txt}Prob > F          = {res}    0.0000
                                                {txt}R-squared         = {res}    0.0500
                                                {txt}Root MSE          =    {res}  .7366

{txt}{ralign 78:(Std. Err. adjusted for {res:92} clusters in idx)}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}co_opgoatn~w{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}r_treat {c |}{col 14}{res}{space 2} .0242839{col 26}{space 2} .0602844{col 37}{space 1}    0.40{col 46}{space 3}0.688{col 54}{space 4}-.0954637{col 67}{space 3} .1440315
{txt}{space 12} {c |}
{space 6}strata {c |}
{space 8}112  {c |}{col 14}{res}{space 2} .0080946{col 26}{space 2} .0222592{col 37}{space 1}    0.36{col 46}{space 3}0.717{col 54}{space 4}-.0361206{col 67}{space 3} .0523098
{txt}{space 8}121  {c |}{col 14}{res}{space 2}  .170714{col 26}{space 2} .1110669{col 37}{space 1}    1.54{col 46}{space 3}0.128{col 54}{space 4}-.0499068{col 67}{space 3} .3913348
{txt}{space 8}122  {c |}{col 14}{res}{space 2} .0849523{col 26}{space 2}  .045593{col 37}{space 1}    1.86{col 46}{space 3}0.066{col 54}{space 4}-.0056127{col 67}{space 3} .1755172
{txt}{space 8}211  {c |}{col 14}{res}{space 2} .0080946{col 26}{space 2} .0222592{col 37}{space 1}    0.36{col 46}{space 3}0.717{col 54}{space 4}-.0361206{col 67}{space 3} .0523098
{txt}{space 8}212  {c |}{col 14}{res}{space 2}  .091428{col 26}{space 2} .0268749{col 37}{space 1}    3.40{col 46}{space 3}0.001{col 54}{space 4} .0380444{col 67}{space 3} .1448116
{txt}{space 8}221  {c |}{col 14}{res}{space 2} .1186306{col 26}{space 2} .0811361{col 37}{space 1}    1.46{col 46}{space 3}0.147{col 54}{space 4}-.0425362{col 67}{space 3} .2797975
{txt}{space 8}222  {c |}{col 14}{res}{space 2} .1186306{col 26}{space 2} .0595213{col 37}{space 1}    1.99{col 46}{space 3}0.049{col 54}{space 4} .0003988{col 67}{space 3} .2368625
{txt}{space 8}311  {c |}{col 14}{res}{space 2} .4444444{col 26}{space 2} .2442951{col 37}{space 1}    1.82{col 46}{space 3}0.072{col 54}{space 4}-.0408178{col 67}{space 3} .9297067
{txt}{space 8}312  {c |}{col 14}{res}{space 2} .1854763{col 26}{space 2} .0499969{col 37}{space 1}    3.71{col 46}{space 3}0.000{col 54}{space 4} .0861637{col 67}{space 3}  .284789
{txt}{space 8}321  {c |}{col 14}{res}{space 2} .4415473{col 26}{space 2} .0819749{col 37}{space 1}    5.39{col 46}{space 3}0.000{col 54}{space 4} .2787142{col 67}{space 3} .6043804
{txt}{space 8}322  {c |}{col 14}{res}{space 2} .2011013{col 26}{space 2}  .078619{col 37}{space 1}    2.56{col 46}{space 3}0.012{col 54}{space 4} .0449343{col 67}{space 3} .3572683
{txt}{space 8}411  {c |}{col 14}{res}{space 2} .2748806{col 26}{space 2} .1339627{col 37}{space 1}    2.05{col 46}{space 3}0.043{col 54}{space 4} .0087802{col 67}{space 3} .5409811
{txt}{space 8}412  {c |}{col 14}{res}{space 2}  .295714{col 26}{space 2}  .150658{col 37}{space 1}    1.96{col 46}{space 3}0.053{col 54}{space 4}-.0035496{col 67}{space 3} .5949776
{txt}{space 8}421  {c |}{col 14}{res}{space 2} .2540473{col 26}{space 2} .0849221{col 37}{space 1}    2.99{col 46}{space 3}0.004{col 54}{space 4} .0853601{col 67}{space 3} .4227346
{txt}{space 8}422  {c |}{col 14}{res}{space 2} .0981424{col 26}{space 2} .0343321{col 37}{space 1}    2.86{col 46}{space 3}0.005{col 54}{space 4}  .029946{col 67}{space 3} .1663388
{txt}{space 8}511  {c |}{col 14}{res}{space 2} .0665473{col 26}{space 2} .0377738{col 37}{space 1}    1.76{col 46}{space 3}0.081{col 54}{space 4}-.0084856{col 67}{space 3} .1415803
{txt}{space 8}512  {c |}{col 14}{res}{space 2} .6915473{col 26}{space 2} .3726642{col 37}{space 1}    1.86{col 46}{space 3}0.067{col 54}{space 4}-.0487044{col 67}{space 3} 1.431799
{txt}{space 8}521  {c |}{col 14}{res}{space 2} .1498806{col 26}{space 2} .0795381{col 37}{space 1}    1.88{col 46}{space 3}0.063{col 54}{space 4}-.0081121{col 67}{space 3} .3078734
{txt}{space 8}522  {c |}{col 14}{res}{space 2} .1429362{col 26}{space 2} .0357321{col 37}{space 1}    4.00{col 46}{space 3}0.000{col 54}{space 4} .0719587{col 67}{space 3} .2139137
{txt}{space 8}611  {c |}{col 14}{res}{space 2} .3061306{col 26}{space 2} .1261651{col 37}{space 1}    2.43{col 46}{space 3}0.017{col 54}{space 4} .0555191{col 67}{space 3} .5567422
{txt}{space 8}612  {c |}{col 14}{res}{space 2} .4415473{col 26}{space 2} .2037325{col 37}{space 1}    2.17{col 46}{space 3}0.033{col 54}{space 4} .0368577{col 67}{space 3}  .846237
{txt}{space 8}621  {c |}{col 14}{res}{space 2} .3599523{col 26}{space 2} .3312206{col 37}{space 1}    1.09{col 46}{space 3}0.280{col 54}{space 4}-.2979767{col 67}{space 3} 1.017881
{txt}{space 8}622  {c |}{col 14}{res}{space 2} .4766189{col 26}{space 2} .2549845{col 37}{space 1}    1.87{col 46}{space 3}0.065{col 54}{space 4}-.0298765{col 67}{space 3} .9831143
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2}-.0161893{col 26}{space 2}  .040771{col 37}{space 1}   -0.40{col 46}{space 3}0.692{col 54}{space 4}-.0971759{col 67}{space 3} .0647974
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}Linear regression                               Number of obs     = {res}     2,448
                                                {txt}F(24, 91)         =  {res}     4.77
                                                {txt}Prob > F          = {res}    0.0000
                                                {txt}R-squared         = {res}    0.0466
                                                {txt}Root MSE          =    {res} 1.5477

{txt}{ralign 78:(Std. Err. adjusted for {res:92} clusters in idx)}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}       LS8_w{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}r_treat {c |}{col 14}{res}{space 2} .0134846{col 26}{space 2} .0825672{col 37}{space 1}    0.16{col 46}{space 3}0.871{col 54}{space 4}-.1505249{col 67}{space 3} .1774941
{txt}{space 12} {c |}
{space 6}strata {c |}
{space 8}112  {c |}{col 14}{res}{space 2} .1850504{col 26}{space 2} .1984782{col 37}{space 1}    0.93{col 46}{space 3}0.354{col 54}{space 4} -.209202{col 67}{space 3} .5793029
{txt}{space 8}121  {c |}{col 14}{res}{space 2} .2661363{col 26}{space 2} .2686512{col 37}{space 1}    0.99{col 46}{space 3}0.324{col 54}{space 4}-.2675062{col 67}{space 3} .7997789
{txt}{space 8}122  {c |}{col 14}{res}{space 2} .0731212{col 26}{space 2} .1529792{col 37}{space 1}    0.48{col 46}{space 3}0.634{col 54}{space 4}-.2307532{col 67}{space 3} .3769956
{txt}{space 8}211  {c |}{col 14}{res}{space 2} .4628282{col 26}{space 2} .2646563{col 37}{space 1}    1.75{col 46}{space 3}0.084{col 54}{space 4} -.062879{col 67}{space 3} .9885354
{txt}{space 8}212  {c |}{col 14}{res}{space 2} .3794949{col 26}{space 2} .1427087{col 37}{space 1}    2.66{col 46}{space 3}0.009{col 54}{space 4} .0960216{col 67}{space 3} .6629682
{txt}{space 8}221  {c |}{col 14}{res}{space 2} .1723863{col 26}{space 2} .1828871{col 37}{space 1}    0.94{col 46}{space 3}0.348{col 54}{space 4}-.1908964{col 67}{space 3}  .535669
{txt}{space 8}222  {c |}{col 14}{res}{space 2} .3286363{col 26}{space 2} .1389695{col 37}{space 1}    2.36{col 46}{space 3}0.020{col 54}{space 4} .0525905{col 67}{space 3} .6046821
{txt}{space 8}311  {c |}{col 14}{res}{space 2} .6666667{col 26}{space 2} .2773863{col 37}{space 1}    2.40{col 46}{space 3}0.018{col 54}{space 4} .1156728{col 67}{space 3}  1.21766
{txt}{space 8}312  {c |}{col 14}{res}{space 2} .6898485{col 26}{space 2} .4644604{col 37}{space 1}    1.49{col 46}{space 3}0.141{col 54}{space 4} -.232745{col 67}{space 3} 1.612442
{txt}{space 8}321  {c |}{col 14}{res}{space 2} 1.516136{col 26}{space 2} .2215841{col 37}{space 1}    6.84{col 46}{space 3}0.000{col 54}{space 4} 1.075987{col 67}{space 3} 1.956286
{txt}{space 8}322  {c |}{col 14}{res}{space 2} .8148485{col 26}{space 2} .2306817{col 37}{space 1}    3.53{col 46}{space 3}0.001{col 54}{space 4} .3566276{col 67}{space 3} 1.273069
{txt}{space 8}411  {c |}{col 14}{res}{space 2} .4536363{col 26}{space 2} .1460826{col 37}{space 1}    3.11{col 46}{space 3}0.003{col 54}{space 4} .1634611{col 67}{space 3} .7438116
{txt}{space 8}412  {c |}{col 14}{res}{space 2}  .276553{col 26}{space 2} .1715595{col 37}{space 1}    1.61{col 46}{space 3}0.110{col 54}{space 4}-.0642289{col 67}{space 3} .6173349
{txt}{space 8}421  {c |}{col 14}{res}{space 2}  .276553{col 26}{space 2}  .186819{col 37}{space 1}    1.48{col 46}{space 3}0.142{col 54}{space 4}  -.09454{col 67}{space 3}  .647646
{txt}{space 8}422  {c |}{col 14}{res}{space 2} .4924848{col 26}{space 2} .2503132{col 37}{space 1}    1.97{col 46}{space 3}0.052{col 54}{space 4}-.0047316{col 67}{space 3} .9897012
{txt}{space 8}511  {c |}{col 14}{res}{space 2} .1932197{col 26}{space 2} .1984379{col 37}{space 1}    0.97{col 46}{space 3}0.333{col 54}{space 4}-.2009529{col 67}{space 3} .5873922
{txt}{space 8}512  {c |}{col 14}{res}{space 2} 1.203636{col 26}{space 2} .1926108{col 37}{space 1}    6.25{col 46}{space 3}0.000{col 54}{space 4} .8210387{col 67}{space 3} 1.586234
{txt}{space 8}521  {c |}{col 14}{res}{space 2} .3807197{col 26}{space 2} .2405533{col 37}{space 1}    1.58{col 46}{space 3}0.117{col 54}{space 4}-.0971099{col 67}{space 3} .8585492
{txt}{space 8}522  {c |}{col 14}{res}{space 2} .5647474{col 26}{space 2} .1937055{col 37}{space 1}    2.92{col 46}{space 3}0.004{col 54}{space 4} .1799752{col 67}{space 3} .9495197
{txt}{space 8}611  {c |}{col 14}{res}{space 2} .4432197{col 26}{space 2} .2187545{col 37}{space 1}    2.03{col 46}{space 3}0.046{col 54}{space 4} .0086907{col 67}{space 3} .8777486
{txt}{space 8}612  {c |}{col 14}{res}{space 2} .7661363{col 26}{space 2} .2045561{col 37}{space 1}    3.75{col 46}{space 3}0.000{col 54}{space 4} .3598107{col 67}{space 3} 1.172462
{txt}{space 8}621  {c |}{col 14}{res}{space 2} .6147879{col 26}{space 2} .3309202{col 37}{space 1}    1.86{col 46}{space 3}0.066{col 54}{space 4}-.0425444{col 67}{space 3}  1.27212
{txt}{space 8}622  {c |}{col 14}{res}{space 2} .8981212{col 26}{space 2} .2140601{col 37}{space 1}    4.20{col 46}{space 3}0.000{col 54}{space 4} .4729171{col 67}{space 3} 1.323325
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} .5604547{col 26}{space 2} .1284389{col 37}{space 1}    4.36{col 46}{space 3}0.000{col 54}{space 4} .3053266{col 67}{space 3} .8155827
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. matrix A = mat_1
{txt}
{com}. forv i = 2/`listsize' {c -(} // appends into single matrix
{txt}  2{com}.         matrix A = A \ mat_`i'
{txt}  3{com}. {c )-}
{txt}
{com}. 
. * Table
. frmttable using MDE_1.doc, statmat(A) sdec(4) coljust(l;c;l;l) title("Goat Sales") ///
> ctitle("","MDE","% of mean","# of sd's.") ///
> rtitle("Goats Sold through Cooperative"\"Total Goats Sold") ///
> note("Currency measured in USD") addtable replace
{res}
{txt}{center:Goat Sales}
{txt}{center:{hline 65}}
{center:{txt}{lalign 32:}{txt}{center 8:MDE}{txt}{center 11:% of mean}{txt}{center 12:# of sd's.}}
{txt}{center:{hline 65}}
{center:{txt}{lalign 32:Goats Sold through Cooperative}{res}{center 8:0.1707}{res}{center 11:0.7613}{res}{center 12:0.2270}}
{center:{txt}{lalign 32:Total Goats Sold}{res}{center 8:0.2338}{res}{center 11:0.2134}{res}{center 12:0.1482}}
{txt}{center:{hline 65}}
{txt}{center:Currency measured in USD}


{com}. 
. 
. 
. * Goat Prices
. 
. ** HH vars
. gl hh_goatprice rev_goat_w rev_co_opgoat_w
{txt}
{com}. 
. local listsize : list sizeof global(hh_goatprice)
{txt}
{com}. tokenize $hh_goatprice
{txt}
{com}. 
. forv i = 1/`listsize' {c -(}
{txt}  2{com}. 
.         reg ``i'' r_treat i.str, cluster(idx)
{txt}  3{com}.         
.         quietly {c -(}
{txt}  4{com}.                 ereturn list
{txt}  5{com}.                 scalar t_a = invttail(`e(df_r)',0.025) // alpha t-value
{txt}  6{com}.                 scalar t_b = invttail(`e(df_r)',0.2) // beta t-value
{txt}  7{com}.                 scalar mde_``i'' = (t_a + t_b)*_se[r_treat]
{txt}  8{com}.                 
.         * Calculate MDE as % of mean & # of standard deviations
.                 sum ``i''
{txt}  9{com}.                 scalar mean_``i'' = mde_``i'' / r(mean) // % of treatment mean
{txt} 10{com}.                 scalar sd_``i'' = mde_``i'' / r(sd)  // # of treatment sd's
{txt} 11{com}. 
.         * matrix for table
.                 matrix mat_`i' = (mde_``i'',mean_``i'',sd_``i'')
{txt} 12{com}.                 {c )-}
{txt} 13{com}. {c )-}

{txt}Linear regression                               Number of obs     = {res}     2,448
                                                {txt}F(24, 91)         =  {res}     4.66
                                                {txt}Prob > F          = {res}    0.0000
                                                {txt}R-squared         = {res}    0.0377
                                                {txt}Root MSE          =    {res} 49.136

{txt}{ralign 78:(Std. Err. adjusted for {res:92} clusters in idx)}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}  rev_goat_w{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}r_treat {c |}{col 14}{res}{space 2} .6162208{col 26}{space 2} 2.515016{col 37}{space 1}    0.25{col 46}{space 3}0.807{col 54}{space 4} -4.37955{col 67}{space 3} 5.611991
{txt}{space 12} {c |}
{space 6}strata {c |}
{space 8}112  {c |}{col 14}{res}{space 2} 19.28697{col 26}{space 2} 7.463848{col 37}{space 1}    2.58{col 46}{space 3}0.011{col 54}{space 4} 4.460953{col 67}{space 3} 34.11299
{txt}{space 8}121  {c |}{col 14}{res}{space 2} 10.92967{col 26}{space 2} 7.219122{col 37}{space 1}    1.51{col 46}{space 3}0.133{col 54}{space 4}-3.410229{col 67}{space 3} 25.26957
{txt}{space 8}122  {c |}{col 14}{res}{space 2} 1.244294{col 26}{space 2} 5.763846{col 37}{space 1}    0.22{col 46}{space 3}0.830{col 54}{space 4}-10.20488{col 67}{space 3} 12.69347
{txt}{space 8}211  {c |}{col 14}{res}{space 2} 18.63273{col 26}{space 2} 10.21537{col 37}{space 1}    1.82{col 46}{space 3}0.071{col 54}{space 4}-1.658837{col 67}{space 3}  38.9243
{txt}{space 8}212  {c |}{col 14}{res}{space 2} 30.45655{col 26}{space 2} 11.18483{col 37}{space 1}    2.72{col 46}{space 3}0.008{col 54}{space 4}  8.23927{col 67}{space 3} 52.67384
{txt}{space 8}221  {c |}{col 14}{res}{space 2} 8.439589{col 26}{space 2} 8.047421{col 37}{space 1}    1.05{col 46}{space 3}0.297{col 54}{space 4}-7.545623{col 67}{space 3}  24.4248
{txt}{space 8}222  {c |}{col 14}{res}{space 2}  12.1514{col 26}{space 2} 5.481022{col 37}{space 1}    2.22{col 46}{space 3}0.029{col 54}{space 4} 1.264025{col 67}{space 3} 23.03878
{txt}{space 8}311  {c |}{col 14}{res}{space 2} 30.12946{col 26}{space 2} 11.90192{col 37}{space 1}    2.53{col 46}{space 3}0.013{col 54}{space 4}  6.48776{col 67}{space 3} 53.77116
{txt}{space 8}312  {c |}{col 14}{res}{space 2} 16.81933{col 26}{space 2} 5.368636{col 37}{space 1}    3.13{col 46}{space 3}0.002{col 54}{space 4}  6.15519{col 67}{space 3} 27.48346
{txt}{space 8}321  {c |}{col 14}{res}{space 2} 30.75729{col 26}{space 2}  8.46459{col 37}{space 1}    3.63{col 46}{space 3}0.000{col 54}{space 4} 13.94343{col 67}{space 3} 47.57116
{txt}{space 8}322  {c |}{col 14}{res}{space 2} 20.07633{col 26}{space 2} 6.269709{col 37}{space 1}    3.20{col 46}{space 3}0.002{col 54}{space 4}  7.62232{col 67}{space 3} 32.53033
{txt}{space 8}411  {c |}{col 14}{res}{space 2} 12.25369{col 26}{space 2}  7.90717{col 37}{space 1}    1.55{col 46}{space 3}0.125{col 54}{space 4}-3.452928{col 67}{space 3} 27.96031
{txt}{space 8}412  {c |}{col 14}{res}{space 2} 13.76541{col 26}{space 2} 9.742546{col 37}{space 1}    1.41{col 46}{space 3}0.161{col 54}{space 4}-5.586959{col 67}{space 3} 33.11778
{txt}{space 8}421  {c |}{col 14}{res}{space 2} 9.547796{col 26}{space 2}   8.8714{col 37}{space 1}    1.08{col 46}{space 3}0.285{col 54}{space 4} -8.07415{col 67}{space 3} 27.16974
{txt}{space 8}422  {c |}{col 14}{res}{space 2} 9.177909{col 26}{space 2} 8.248131{col 37}{space 1}    1.11{col 46}{space 3}0.269{col 54}{space 4} -7.20599{col 67}{space 3} 25.56181
{txt}{space 8}511  {c |}{col 14}{res}{space 2} 3.560256{col 26}{space 2} 6.562873{col 37}{space 1}    0.54{col 46}{space 3}0.589{col 54}{space 4}-9.476084{col 67}{space 3}  16.5966
{txt}{space 8}512  {c |}{col 14}{res}{space 2} 34.52416{col 26}{space 2} 7.696245{col 37}{space 1}    4.49{col 46}{space 3}0.000{col 54}{space 4} 19.23651{col 67}{space 3}  49.8118
{txt}{space 8}521  {c |}{col 14}{res}{space 2} 16.01113{col 26}{space 2}  6.09829{col 37}{space 1}    2.63{col 46}{space 3}0.010{col 54}{space 4} 3.897623{col 67}{space 3} 28.12463
{txt}{space 8}522  {c |}{col 14}{res}{space 2} 15.31009{col 26}{space 2} 7.106941{col 37}{space 1}    2.15{col 46}{space 3}0.034{col 54}{space 4} 1.193023{col 67}{space 3} 29.42716
{txt}{space 8}611  {c |}{col 14}{res}{space 2} 6.057354{col 26}{space 2} 6.497585{col 37}{space 1}    0.93{col 46}{space 3}0.354{col 54}{space 4}  -6.8493{col 67}{space 3} 18.96401
{txt}{space 8}612  {c |}{col 14}{res}{space 2} 26.90718{col 26}{space 2} 5.954309{col 37}{space 1}    4.52{col 46}{space 3}0.000{col 54}{space 4} 15.07968{col 67}{space 3} 38.73469
{txt}{space 8}621  {c |}{col 14}{res}{space 2} 9.622114{col 26}{space 2} 9.363543{col 37}{space 1}    1.03{col 46}{space 3}0.307{col 54}{space 4}-8.977414{col 67}{space 3} 28.22164
{txt}{space 8}622  {c |}{col 14}{res}{space 2} 29.57049{col 26}{space 2} 6.949827{col 37}{space 1}    4.25{col 46}{space 3}0.000{col 54}{space 4} 15.76551{col 67}{space 3} 43.37547
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} 25.37273{col 26}{space 2} 5.521453{col 37}{space 1}    4.60{col 46}{space 3}0.000{col 54}{space 4} 14.40504{col 67}{space 3} 36.34042
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}Linear regression                               Number of obs     = {res}     2,448
                                                {txt}F(24, 91)         =  {res}    10.19
                                                {txt}Prob > F          = {res}    0.0000
                                                {txt}R-squared         = {res}    0.0471
                                                {txt}Root MSE          =    {res} 28.624

{txt}{ralign 78:(Std. Err. adjusted for {res:92} clusters in idx)}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}rev_co_opg~w{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}r_treat {c |}{col 14}{res}{space 2} 1.002147{col 26}{space 2} 2.345702{col 37}{space 1}    0.43{col 46}{space 3}0.670{col 54}{space 4}-3.657303{col 67}{space 3} 5.661597
{txt}{space 12} {c |}
{space 6}strata {c |}
{space 8}112  {c |}{col 14}{res}{space 2}  .334049{col 26}{space 2} .8760649{col 37}{space 1}    0.38{col 46}{space 3}0.704{col 54}{space 4}-1.406146{col 67}{space 3} 2.074244
{txt}{space 8}121  {c |}{col 14}{res}{space 2} 12.64628{col 26}{space 2} 8.571758{col 37}{space 1}    1.48{col 46}{space 3}0.144{col 54}{space 4}-4.380461{col 67}{space 3} 29.67303
{txt}{space 8}122  {c |}{col 14}{res}{space 2} 5.074147{col 26}{space 2} 2.306286{col 37}{space 1}    2.20{col 46}{space 3}0.030{col 54}{space 4} .4929926{col 67}{space 3} 9.655302
{txt}{space 8}211  {c |}{col 14}{res}{space 2}  .334049{col 26}{space 2} .8760649{col 37}{space 1}    0.38{col 46}{space 3}0.704{col 54}{space 4}-1.406146{col 67}{space 3} 2.074244
{txt}{space 8}212  {c |}{col 14}{res}{space 2} 7.310455{col 26}{space 2} 1.772647{col 37}{space 1}    4.12{col 46}{space 3}0.000{col 54}{space 4}  3.78931{col 67}{space 3}  10.8316
{txt}{space 8}221  {c |}{col 14}{res}{space 2} 5.705799{col 26}{space 2} 3.668791{col 37}{space 1}    1.56{col 46}{space 3}0.123{col 54}{space 4}-1.581804{col 67}{space 3}  12.9934
{txt}{space 8}222  {c |}{col 14}{res}{space 2} 4.181578{col 26}{space 2} 2.094892{col 37}{space 1}    2.00{col 46}{space 3}0.049{col 54}{space 4} .0203328{col 67}{space 3} 8.342822
{txt}{space 8}311  {c |}{col 14}{res}{space 2} 20.94916{col 26}{space 2} 9.904518{col 37}{space 1}    2.12{col 46}{space 3}0.037{col 54}{space 4} 1.275047{col 67}{space 3} 40.62327
{txt}{space 8}312  {c |}{col 14}{res}{space 2} 7.001175{col 26}{space 2} 1.380976{col 37}{space 1}    5.07{col 46}{space 3}0.000{col 54}{space 4} 4.258036{col 67}{space 3} 9.744314
{txt}{space 8}321  {c |}{col 14}{res}{space 2} 15.78479{col 26}{space 2} 1.541232{col 37}{space 1}   10.24{col 46}{space 3}0.000{col 54}{space 4} 12.72332{col 67}{space 3} 18.84626
{txt}{space 8}322  {c |}{col 14}{res}{space 2} 8.684175{col 26}{space 2} 2.306336{col 37}{space 1}    3.77{col 46}{space 3}0.000{col 54}{space 4} 4.102923{col 67}{space 3} 13.26543
{txt}{space 8}411  {c |}{col 14}{res}{space 2}  13.3464{col 26}{space 2} 8.705156{col 37}{space 1}    1.53{col 46}{space 3}0.129{col 54}{space 4}-3.945324{col 67}{space 3} 30.63812
{txt}{space 8}412  {c |}{col 14}{res}{space 2} 13.01682{col 26}{space 2} 8.313246{col 37}{space 1}    1.57{col 46}{space 3}0.121{col 54}{space 4} -3.49642{col 67}{space 3} 29.53006
{txt}{space 8}421  {c |}{col 14}{res}{space 2} 11.26585{col 26}{space 2} 3.514903{col 37}{space 1}    3.21{col 46}{space 3}0.002{col 54}{space 4} 4.283929{col 67}{space 3} 18.24778
{txt}{space 8}422  {c |}{col 14}{res}{space 2} 3.993489{col 26}{space 2} 1.202928{col 37}{space 1}    3.32{col 46}{space 3}0.001{col 54}{space 4}  1.60402{col 67}{space 3} 6.382959
{txt}{space 8}511  {c |}{col 14}{res}{space 2}  2.71679{col 26}{space 2} 1.293769{col 37}{space 1}    2.10{col 46}{space 3}0.039{col 54}{space 4} .1468767{col 67}{space 3} 5.286704
{txt}{space 8}512  {c |}{col 14}{res}{space 2}  26.5574{col 26}{space 2} 14.09426{col 37}{space 1}    1.88{col 46}{space 3}0.063{col 54}{space 4}-1.439124{col 67}{space 3} 54.55392
{txt}{space 8}521  {c |}{col 14}{res}{space 2} 9.307337{col 26}{space 2} 4.657343{col 37}{space 1}    2.00{col 46}{space 3}0.049{col 54}{space 4} .0560971{col 67}{space 3} 18.55858
{txt}{space 8}522  {c |}{col 14}{res}{space 2} 6.608899{col 26}{space 2} 2.061836{col 37}{space 1}    3.21{col 46}{space 3}0.002{col 54}{space 4} 2.513315{col 67}{space 3} 10.70448
{txt}{space 8}611  {c |}{col 14}{res}{space 2}  11.6139{col 26}{space 2} 3.385342{col 37}{space 1}    3.43{col 46}{space 3}0.001{col 54}{space 4} 4.889333{col 67}{space 3} 18.33847
{txt}{space 8}612  {c |}{col 14}{res}{space 2} 21.85765{col 26}{space 2} 10.13254{col 37}{space 1}    2.16{col 46}{space 3}0.034{col 54}{space 4} 1.730596{col 67}{space 3}  41.9847
{txt}{space 8}621  {c |}{col 14}{res}{space 2} 11.43711{col 26}{space 2} 10.43411{col 37}{space 1}    1.10{col 46}{space 3}0.276{col 54}{space 4}-9.288975{col 67}{space 3} 32.16319
{txt}{space 8}622  {c |}{col 14}{res}{space 2} 12.70305{col 26}{space 2} 6.739913{col 37}{space 1}    1.88{col 46}{space 3}0.063{col 54}{space 4}-.6849588{col 67}{space 3} 26.09106
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2}-.6680979{col 26}{space 2} 1.589227{col 37}{space 1}   -0.42{col 46}{space 3}0.675{col 54}{space 4}-3.824901{col 67}{space 3} 2.488706
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. matrix A = mat_1
{txt}
{com}. forv i = 2/`listsize' {c -(} // appends into single matrix
{txt}  2{com}.         matrix A = A \ mat_`i'
{txt}  3{com}. {c )-}
{txt}
{com}. 
. * Table
. frmttable using MDE_1.doc, statmat(A) sdec(4) coljust(l;c;l;l) title("Goat Price") ///
> ctitle("","MDE","% of mean","# of sd's.") ///
> rtitle("Revenue per Goat"\"Revenue per Cooperative Goat") ///
> note("Currency measured in USD") addtable replace
{res}
{txt}{center:Goat Price}
{txt}{center:{hline 63}}
{center:{txt}{lalign 30:}{txt}{center 8:MDE}{txt}{center 11:% of mean}{txt}{center 12:# of sd's.}}
{txt}{center:{hline 63}}
{center:{txt}{lalign 30:Revenue per Goat}{res}{center 8:7.1224}{res}{center 11:0.1692}{res}{center 12:0.1429}}
{center:{txt}{lalign 30:Revenue per Cooperative Goat}{res}{center 8:6.6429}{res}{center 11:0.7025}{res}{center 12:0.2277}}
{txt}{center:{hline 63}}
{txt}{center:Currency measured in USD}


{com}. 
. 
. 
. 
. * Net Goat Income
. 
. ** HH vars
. gl hh_income rev_goat_w LS8_w net_goat_income_w
{txt}
{com}. 
. local listsize : list sizeof global(hh_income)
{txt}
{com}. tokenize $hh_income
{txt}
{com}. 
. forv i = 1/`listsize' {c -(}
{txt}  2{com}. 
.         reg ``i'' r_treat i.str, cluster(idx)
{txt}  3{com}.         
.         quietly {c -(}
{txt}  4{com}.                 ereturn list
{txt}  5{com}.                 scalar t_a = invttail(`e(df_r)',0.025) // alpha t-value
{txt}  6{com}.                 scalar t_b = invttail(`e(df_r)',0.2) // beta t-value
{txt}  7{com}.                 scalar mde_``i'' = (t_a + t_b)*_se[r_treat]
{txt}  8{com}.                 
.         * Calculate MDE as % of mean & # of standard deviations
.                 sum ``i''
{txt}  9{com}.                 scalar mean_``i'' = mde_``i'' / r(mean) // % of treatment mean
{txt} 10{com}.                 scalar sd_``i'' = mde_``i'' / r(sd)  // # of treatment sd's
{txt} 11{com}. 
.         * matrix for table
.                 matrix mat_`i' = (mde_``i'',mean_``i'',sd_``i'')
{txt} 12{com}.                 {c )-}
{txt} 13{com}. {c )-}

{txt}Linear regression                               Number of obs     = {res}     2,448
                                                {txt}F(24, 91)         =  {res}     4.66
                                                {txt}Prob > F          = {res}    0.0000
                                                {txt}R-squared         = {res}    0.0377
                                                {txt}Root MSE          =    {res} 49.136

{txt}{ralign 78:(Std. Err. adjusted for {res:92} clusters in idx)}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}  rev_goat_w{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}r_treat {c |}{col 14}{res}{space 2} .6162208{col 26}{space 2} 2.515016{col 37}{space 1}    0.25{col 46}{space 3}0.807{col 54}{space 4} -4.37955{col 67}{space 3} 5.611991
{txt}{space 12} {c |}
{space 6}strata {c |}
{space 8}112  {c |}{col 14}{res}{space 2} 19.28697{col 26}{space 2} 7.463848{col 37}{space 1}    2.58{col 46}{space 3}0.011{col 54}{space 4} 4.460953{col 67}{space 3} 34.11299
{txt}{space 8}121  {c |}{col 14}{res}{space 2} 10.92967{col 26}{space 2} 7.219122{col 37}{space 1}    1.51{col 46}{space 3}0.133{col 54}{space 4}-3.410229{col 67}{space 3} 25.26957
{txt}{space 8}122  {c |}{col 14}{res}{space 2} 1.244294{col 26}{space 2} 5.763846{col 37}{space 1}    0.22{col 46}{space 3}0.830{col 54}{space 4}-10.20488{col 67}{space 3} 12.69347
{txt}{space 8}211  {c |}{col 14}{res}{space 2} 18.63273{col 26}{space 2} 10.21537{col 37}{space 1}    1.82{col 46}{space 3}0.071{col 54}{space 4}-1.658837{col 67}{space 3}  38.9243
{txt}{space 8}212  {c |}{col 14}{res}{space 2} 30.45655{col 26}{space 2} 11.18483{col 37}{space 1}    2.72{col 46}{space 3}0.008{col 54}{space 4}  8.23927{col 67}{space 3} 52.67384
{txt}{space 8}221  {c |}{col 14}{res}{space 2} 8.439589{col 26}{space 2} 8.047421{col 37}{space 1}    1.05{col 46}{space 3}0.297{col 54}{space 4}-7.545623{col 67}{space 3}  24.4248
{txt}{space 8}222  {c |}{col 14}{res}{space 2}  12.1514{col 26}{space 2} 5.481022{col 37}{space 1}    2.22{col 46}{space 3}0.029{col 54}{space 4} 1.264025{col 67}{space 3} 23.03878
{txt}{space 8}311  {c |}{col 14}{res}{space 2} 30.12946{col 26}{space 2} 11.90192{col 37}{space 1}    2.53{col 46}{space 3}0.013{col 54}{space 4}  6.48776{col 67}{space 3} 53.77116
{txt}{space 8}312  {c |}{col 14}{res}{space 2} 16.81933{col 26}{space 2} 5.368636{col 37}{space 1}    3.13{col 46}{space 3}0.002{col 54}{space 4}  6.15519{col 67}{space 3} 27.48346
{txt}{space 8}321  {c |}{col 14}{res}{space 2} 30.75729{col 26}{space 2}  8.46459{col 37}{space 1}    3.63{col 46}{space 3}0.000{col 54}{space 4} 13.94343{col 67}{space 3} 47.57116
{txt}{space 8}322  {c |}{col 14}{res}{space 2} 20.07633{col 26}{space 2} 6.269709{col 37}{space 1}    3.20{col 46}{space 3}0.002{col 54}{space 4}  7.62232{col 67}{space 3} 32.53033
{txt}{space 8}411  {c |}{col 14}{res}{space 2} 12.25369{col 26}{space 2}  7.90717{col 37}{space 1}    1.55{col 46}{space 3}0.125{col 54}{space 4}-3.452928{col 67}{space 3} 27.96031
{txt}{space 8}412  {c |}{col 14}{res}{space 2} 13.76541{col 26}{space 2} 9.742546{col 37}{space 1}    1.41{col 46}{space 3}0.161{col 54}{space 4}-5.586959{col 67}{space 3} 33.11778
{txt}{space 8}421  {c |}{col 14}{res}{space 2} 9.547796{col 26}{space 2}   8.8714{col 37}{space 1}    1.08{col 46}{space 3}0.285{col 54}{space 4} -8.07415{col 67}{space 3} 27.16974
{txt}{space 8}422  {c |}{col 14}{res}{space 2} 9.177909{col 26}{space 2} 8.248131{col 37}{space 1}    1.11{col 46}{space 3}0.269{col 54}{space 4} -7.20599{col 67}{space 3} 25.56181
{txt}{space 8}511  {c |}{col 14}{res}{space 2} 3.560256{col 26}{space 2} 6.562873{col 37}{space 1}    0.54{col 46}{space 3}0.589{col 54}{space 4}-9.476084{col 67}{space 3}  16.5966
{txt}{space 8}512  {c |}{col 14}{res}{space 2} 34.52416{col 26}{space 2} 7.696245{col 37}{space 1}    4.49{col 46}{space 3}0.000{col 54}{space 4} 19.23651{col 67}{space 3}  49.8118
{txt}{space 8}521  {c |}{col 14}{res}{space 2} 16.01113{col 26}{space 2}  6.09829{col 37}{space 1}    2.63{col 46}{space 3}0.010{col 54}{space 4} 3.897623{col 67}{space 3} 28.12463
{txt}{space 8}522  {c |}{col 14}{res}{space 2} 15.31009{col 26}{space 2} 7.106941{col 37}{space 1}    2.15{col 46}{space 3}0.034{col 54}{space 4} 1.193023{col 67}{space 3} 29.42716
{txt}{space 8}611  {c |}{col 14}{res}{space 2} 6.057354{col 26}{space 2} 6.497585{col 37}{space 1}    0.93{col 46}{space 3}0.354{col 54}{space 4}  -6.8493{col 67}{space 3} 18.96401
{txt}{space 8}612  {c |}{col 14}{res}{space 2} 26.90718{col 26}{space 2} 5.954309{col 37}{space 1}    4.52{col 46}{space 3}0.000{col 54}{space 4} 15.07968{col 67}{space 3} 38.73469
{txt}{space 8}621  {c |}{col 14}{res}{space 2} 9.622114{col 26}{space 2} 9.363543{col 37}{space 1}    1.03{col 46}{space 3}0.307{col 54}{space 4}-8.977414{col 67}{space 3} 28.22164
{txt}{space 8}622  {c |}{col 14}{res}{space 2} 29.57049{col 26}{space 2} 6.949827{col 37}{space 1}    4.25{col 46}{space 3}0.000{col 54}{space 4} 15.76551{col 67}{space 3} 43.37547
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} 25.37273{col 26}{space 2} 5.521453{col 37}{space 1}    4.60{col 46}{space 3}0.000{col 54}{space 4} 14.40504{col 67}{space 3} 36.34042
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}Linear regression                               Number of obs     = {res}     2,448
                                                {txt}F(24, 91)         =  {res}     4.77
                                                {txt}Prob > F          = {res}    0.0000
                                                {txt}R-squared         = {res}    0.0466
                                                {txt}Root MSE          =    {res} 1.5477

{txt}{ralign 78:(Std. Err. adjusted for {res:92} clusters in idx)}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}       LS8_w{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}r_treat {c |}{col 14}{res}{space 2} .0134846{col 26}{space 2} .0825672{col 37}{space 1}    0.16{col 46}{space 3}0.871{col 54}{space 4}-.1505249{col 67}{space 3} .1774941
{txt}{space 12} {c |}
{space 6}strata {c |}
{space 8}112  {c |}{col 14}{res}{space 2} .1850504{col 26}{space 2} .1984782{col 37}{space 1}    0.93{col 46}{space 3}0.354{col 54}{space 4} -.209202{col 67}{space 3} .5793029
{txt}{space 8}121  {c |}{col 14}{res}{space 2} .2661363{col 26}{space 2} .2686512{col 37}{space 1}    0.99{col 46}{space 3}0.324{col 54}{space 4}-.2675062{col 67}{space 3} .7997789
{txt}{space 8}122  {c |}{col 14}{res}{space 2} .0731212{col 26}{space 2} .1529792{col 37}{space 1}    0.48{col 46}{space 3}0.634{col 54}{space 4}-.2307532{col 67}{space 3} .3769956
{txt}{space 8}211  {c |}{col 14}{res}{space 2} .4628282{col 26}{space 2} .2646563{col 37}{space 1}    1.75{col 46}{space 3}0.084{col 54}{space 4} -.062879{col 67}{space 3} .9885354
{txt}{space 8}212  {c |}{col 14}{res}{space 2} .3794949{col 26}{space 2} .1427087{col 37}{space 1}    2.66{col 46}{space 3}0.009{col 54}{space 4} .0960216{col 67}{space 3} .6629682
{txt}{space 8}221  {c |}{col 14}{res}{space 2} .1723863{col 26}{space 2} .1828871{col 37}{space 1}    0.94{col 46}{space 3}0.348{col 54}{space 4}-.1908964{col 67}{space 3}  .535669
{txt}{space 8}222  {c |}{col 14}{res}{space 2} .3286363{col 26}{space 2} .1389695{col 37}{space 1}    2.36{col 46}{space 3}0.020{col 54}{space 4} .0525905{col 67}{space 3} .6046821
{txt}{space 8}311  {c |}{col 14}{res}{space 2} .6666667{col 26}{space 2} .2773863{col 37}{space 1}    2.40{col 46}{space 3}0.018{col 54}{space 4} .1156728{col 67}{space 3}  1.21766
{txt}{space 8}312  {c |}{col 14}{res}{space 2} .6898485{col 26}{space 2} .4644604{col 37}{space 1}    1.49{col 46}{space 3}0.141{col 54}{space 4} -.232745{col 67}{space 3} 1.612442
{txt}{space 8}321  {c |}{col 14}{res}{space 2} 1.516136{col 26}{space 2} .2215841{col 37}{space 1}    6.84{col 46}{space 3}0.000{col 54}{space 4} 1.075987{col 67}{space 3} 1.956286
{txt}{space 8}322  {c |}{col 14}{res}{space 2} .8148485{col 26}{space 2} .2306817{col 37}{space 1}    3.53{col 46}{space 3}0.001{col 54}{space 4} .3566276{col 67}{space 3} 1.273069
{txt}{space 8}411  {c |}{col 14}{res}{space 2} .4536363{col 26}{space 2} .1460826{col 37}{space 1}    3.11{col 46}{space 3}0.003{col 54}{space 4} .1634611{col 67}{space 3} .7438116
{txt}{space 8}412  {c |}{col 14}{res}{space 2}  .276553{col 26}{space 2} .1715595{col 37}{space 1}    1.61{col 46}{space 3}0.110{col 54}{space 4}-.0642289{col 67}{space 3} .6173349
{txt}{space 8}421  {c |}{col 14}{res}{space 2}  .276553{col 26}{space 2}  .186819{col 37}{space 1}    1.48{col 46}{space 3}0.142{col 54}{space 4}  -.09454{col 67}{space 3}  .647646
{txt}{space 8}422  {c |}{col 14}{res}{space 2} .4924848{col 26}{space 2} .2503132{col 37}{space 1}    1.97{col 46}{space 3}0.052{col 54}{space 4}-.0047316{col 67}{space 3} .9897012
{txt}{space 8}511  {c |}{col 14}{res}{space 2} .1932197{col 26}{space 2} .1984379{col 37}{space 1}    0.97{col 46}{space 3}0.333{col 54}{space 4}-.2009529{col 67}{space 3} .5873922
{txt}{space 8}512  {c |}{col 14}{res}{space 2} 1.203636{col 26}{space 2} .1926108{col 37}{space 1}    6.25{col 46}{space 3}0.000{col 54}{space 4} .8210387{col 67}{space 3} 1.586234
{txt}{space 8}521  {c |}{col 14}{res}{space 2} .3807197{col 26}{space 2} .2405533{col 37}{space 1}    1.58{col 46}{space 3}0.117{col 54}{space 4}-.0971099{col 67}{space 3} .8585492
{txt}{space 8}522  {c |}{col 14}{res}{space 2} .5647474{col 26}{space 2} .1937055{col 37}{space 1}    2.92{col 46}{space 3}0.004{col 54}{space 4} .1799752{col 67}{space 3} .9495197
{txt}{space 8}611  {c |}{col 14}{res}{space 2} .4432197{col 26}{space 2} .2187545{col 37}{space 1}    2.03{col 46}{space 3}0.046{col 54}{space 4} .0086907{col 67}{space 3} .8777486
{txt}{space 8}612  {c |}{col 14}{res}{space 2} .7661363{col 26}{space 2} .2045561{col 37}{space 1}    3.75{col 46}{space 3}0.000{col 54}{space 4} .3598107{col 67}{space 3} 1.172462
{txt}{space 8}621  {c |}{col 14}{res}{space 2} .6147879{col 26}{space 2} .3309202{col 37}{space 1}    1.86{col 46}{space 3}0.066{col 54}{space 4}-.0425444{col 67}{space 3}  1.27212
{txt}{space 8}622  {c |}{col 14}{res}{space 2} .8981212{col 26}{space 2} .2140601{col 37}{space 1}    4.20{col 46}{space 3}0.000{col 54}{space 4} .4729171{col 67}{space 3} 1.323325
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} .5604547{col 26}{space 2} .1284389{col 37}{space 1}    4.36{col 46}{space 3}0.000{col 54}{space 4} .3053266{col 67}{space 3} .8155827
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}Linear regression                               Number of obs     = {res}     2,448
                                                {txt}F(24, 91)         =  {res}     6.92
                                                {txt}Prob > F          = {res}    0.0000
                                                {txt}R-squared         = {res}    0.0519
                                                {txt}Root MSE          =    {res} 135.84

{txt}{ralign 78:(Std. Err. adjusted for {res:92} clusters in idx)}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}net_goat_i~w{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}r_treat {c |}{col 14}{res}{space 2}-1.021545{col 26}{space 2} 7.206944{col 37}{space 1}   -0.14{col 46}{space 3}0.888{col 54}{space 4}-15.33725{col 67}{space 3} 13.29416
{txt}{space 12} {c |}
{space 6}strata {c |}
{space 8}112  {c |}{col 14}{res}{space 2} 20.20157{col 26}{space 2} 16.95289{col 37}{space 1}    1.19{col 46}{space 3}0.237{col 54}{space 4}-13.47326{col 67}{space 3}  53.8764
{txt}{space 8}121  {c |}{col 14}{res}{space 2} 37.14676{col 26}{space 2} 26.40174{col 37}{space 1}    1.41{col 46}{space 3}0.163{col 54}{space 4}-15.29705{col 67}{space 3} 89.59057
{txt}{space 8}122  {c |}{col 14}{res}{space 2}-.9881425{col 26}{space 2} 14.11642{col 37}{space 1}   -0.07{col 46}{space 3}0.944{col 54}{space 4}-29.02867{col 67}{space 3} 27.05239
{txt}{space 8}211  {c |}{col 14}{res}{space 2} 60.07836{col 26}{space 2}  21.5317{col 37}{space 1}    2.79{col 46}{space 3}0.006{col 54}{space 4} 17.30827{col 67}{space 3} 102.8484
{txt}{space 8}212  {c |}{col 14}{res}{space 2} 53.83036{col 26}{space 2} 18.15682{col 37}{space 1}    2.96{col 46}{space 3}0.004{col 54}{space 4} 17.76406{col 67}{space 3} 89.89666
{txt}{space 8}221  {c |}{col 14}{res}{space 2} 20.43688{col 26}{space 2}  12.9773{col 37}{space 1}    1.57{col 46}{space 3}0.119{col 54}{space 4}-5.340927{col 67}{space 3} 46.21468
{txt}{space 8}222  {c |}{col 14}{res}{space 2} 35.15158{col 26}{space 2} 14.10685{col 37}{space 1}    2.49{col 46}{space 3}0.015{col 54}{space 4} 7.130048{col 67}{space 3} 63.17311
{txt}{space 8}311  {c |}{col 14}{res}{space 2} 65.18476{col 26}{space 2} 32.71979{col 37}{space 1}    1.99{col 46}{space 3}0.049{col 54}{space 4} .1909272{col 67}{space 3} 130.1786
{txt}{space 8}312  {c |}{col 14}{res}{space 2} 60.23639{col 26}{space 2} 22.05149{col 37}{space 1}    2.73{col 46}{space 3}0.008{col 54}{space 4} 16.43383{col 67}{space 3}  104.039
{txt}{space 8}321  {c |}{col 14}{res}{space 2} 138.1911{col 26}{space 2} 19.08137{col 37}{space 1}    7.24{col 46}{space 3}0.000{col 54}{space 4} 100.2883{col 67}{space 3} 176.0939
{txt}{space 8}322  {c |}{col 14}{res}{space 2} 57.71226{col 26}{space 2} 28.00851{col 37}{space 1}    2.06{col 46}{space 3}0.042{col 54}{space 4} 2.076786{col 67}{space 3} 113.3477
{txt}{space 8}411  {c |}{col 14}{res}{space 2} 34.85615{col 26}{space 2} 14.18837{col 37}{space 1}    2.46{col 46}{space 3}0.016{col 54}{space 4} 6.672696{col 67}{space 3}  63.0396
{txt}{space 8}412  {c |}{col 14}{res}{space 2}  33.9139{col 26}{space 2} 15.81799{col 37}{space 1}    2.14{col 46}{space 3}0.035{col 54}{space 4} 2.493393{col 67}{space 3}  65.3344
{txt}{space 8}421  {c |}{col 14}{res}{space 2} 25.69205{col 26}{space 2} 13.86278{col 37}{space 1}    1.85{col 46}{space 3}0.067{col 54}{space 4}-1.844659{col 67}{space 3} 53.22876
{txt}{space 8}422  {c |}{col 14}{res}{space 2} 21.19236{col 26}{space 2}  17.8754{col 37}{space 1}    1.19{col 46}{space 3}0.239{col 54}{space 4}-14.31493{col 67}{space 3} 56.69964
{txt}{space 8}511  {c |}{col 14}{res}{space 2} 5.474289{col 26}{space 2}   16.344{col 37}{space 1}    0.33{col 46}{space 3}0.738{col 54}{space 4}-26.99105{col 67}{space 3} 37.93963
{txt}{space 8}512  {c |}{col 14}{res}{space 2} 93.60069{col 26}{space 2} 16.11561{col 37}{space 1}    5.81{col 46}{space 3}0.000{col 54}{space 4} 61.58901{col 67}{space 3} 125.6124
{txt}{space 8}521  {c |}{col 14}{res}{space 2} 34.09065{col 26}{space 2} 15.90349{col 37}{space 1}    2.14{col 46}{space 3}0.035{col 54}{space 4} 2.500333{col 67}{space 3} 65.68097
{txt}{space 8}522  {c |}{col 14}{res}{space 2} 50.49966{col 26}{space 2} 15.49951{col 37}{space 1}    3.26{col 46}{space 3}0.002{col 54}{space 4} 19.71179{col 67}{space 3} 81.28754
{txt}{space 8}611  {c |}{col 14}{res}{space 2} 29.39362{col 26}{space 2} 22.31631{col 37}{space 1}    1.32{col 46}{space 3}0.191{col 54}{space 4}-14.93499{col 67}{space 3} 73.72223
{txt}{space 8}612  {c |}{col 14}{res}{space 2} 73.72241{col 26}{space 2} 18.01044{col 37}{space 1}    4.09{col 46}{space 3}0.000{col 54}{space 4}  37.9469{col 67}{space 3} 109.4979
{txt}{space 8}621  {c |}{col 14}{res}{space 2} 40.90882{col 26}{space 2} 24.93846{col 37}{space 1}    1.64{col 46}{space 3}0.104{col 54}{space 4}-8.628373{col 67}{space 3} 90.44602
{txt}{space 8}622  {c |}{col 14}{res}{space 2} 100.7568{col 26}{space 2} 19.45899{col 37}{space 1}    5.18{col 46}{space 3}0.000{col 54}{space 4} 62.10391{col 67}{space 3} 139.4097
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2}  13.1509{col 26}{space 2} 13.07891{col 37}{space 1}    1.01{col 46}{space 3}0.317{col 54}{space 4}-12.82873{col 67}{space 3} 39.13054
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. matrix A = mat_1
{txt}
{com}. forv i = 2/`listsize' {c -(} // appends into single matrix
{txt}  2{com}.         matrix A = A \ mat_`i'
{txt}  3{com}. {c )-}
{txt}
{com}. 
. * Table
. frmttable using MDE_1.doc, statmat(A) sdec(4) coljust(l;c;l;l) title("Goat Income") ///
> ctitle("","MDE","% of mean","# of sd's.") ///
> rtitle("Revenue per Goat"\"Goats Sold"\"Net Goat Income") ///
> note("Currency measured in USD") addtable replace
{res}
{txt}{center:Goat Income}
{txt}{center:{hline 52}}
{center:{txt}{lalign 18:}{txt}{center 9:MDE}{txt}{center 11:% of mean}{txt}{center 12:# of sd's.}}
{txt}{center:{hline 52}}
{center:{txt}{lalign 18:Revenue per Goat}{res}{center 9:7.1224}{res}{center 11:0.1692}{res}{center 12:0.1429}}
{center:{txt}{lalign 18:Goats Sold}{res}{center 9:0.2338}{res}{center 11:0.2134}{res}{center 12:0.1482}}
{center:{txt}{lalign 18:Net Goat Income}{res}{center 9:20.4098}{res}{center 11:0.3451}{res}{center 12:0.1470}}
{txt}{center:{hline 52}}
{txt}{center:Currency measured in USD}


{com}. 
. 
. ** Co-op level dataset
. ********************************************* 
. clear
{txt}
{com}. use "$d3/r_CO_Merged_Ind.dta"
{txt}( )

{com}. 
. 
. * Planning and Goals
. 
. ** Co-op vars
. gl co_PNG PNG2 PNG3_w expected_rev_w
{txt}
{com}. 
. *** Strata dummies - No interaction
. ** Co-op vars
. local listsize : list sizeof global(co_PNG)
{txt}
{com}. tokenize $co_PNG
{txt}
{com}. 
. forv i = 1/`listsize' {c -(}
{txt}  2{com}. 
.         reg ``i'' r_treat i.strata, robust
{txt}  3{com}.         
.         quietly {c -(}
{txt}  4{com}.                 ereturn list
{txt}  5{com}.                 scalar t_a = invttail(`e(df_r)',0.025) // alpha t-value
{txt}  6{com}.                 scalar t_b = invttail(`e(df_r)',0.2) // beta t-value
{txt}  7{com}.                 scalar mde_``i'' = (t_a + t_b)*_se[r_treat]
{txt}  8{com}.                 
.         * Calculate MDE as % of mean & # of standard deviations
.                 sum ``i''
{txt}  9{com}.                 scalar mean_``i'' = mde_``i'' / r(mean) // % of treatment mean
{txt} 10{com}.                 scalar sd_``i'' = mde_``i'' / r(sd)  // # of treatment sd's
{txt} 11{com}. 
.         * matrix for table
.                 matrix mat_`i' = (mde_``i'',mean_``i'',sd_``i'')
{txt} 12{com}.                 {c )-}
{txt} 13{com}. {c )-}

{txt}Linear regression                               Number of obs     = {res}        92
                                                {txt}F(24, 67)         =  {res}     1.61
                                                {txt}Prob > F          = {res}    0.0647
                                                {txt}R-squared         = {res}    0.2815
                                                {txt}Root MSE          =    {res} .97038

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}        PNG2{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}r_treat {c |}{col 14}{res}{space 2}-.0971599{col 26}{space 2} .1996216{col 37}{space 1}   -0.49{col 46}{space 3}0.628{col 54}{space 4}-.4956063{col 67}{space 3} .3012864
{txt}{space 12} {c |}
{space 6}strata {c |}
{space 8}112  {c |}{col 14}{res}{space 2} .3009467{col 26}{space 2} .4485256{col 37}{space 1}    0.67{col 46}{space 3}0.505{col 54}{space 4}-.5943141{col 67}{space 3} 1.196207
{txt}{space 8}121  {c |}{col 14}{res}{space 2} .6504733{col 26}{space 2} .2947463{col 37}{space 1}    2.21{col 46}{space 3}0.031{col 54}{space 4} .0621573{col 67}{space 3} 1.238789
{txt}{space 8}122  {c |}{col 14}{res}{space 2} 1.460189{col 26}{space 2} .6906751{col 37}{space 1}    2.11{col 46}{space 3}0.038{col 54}{space 4} .0815962{col 67}{space 3} 2.838783
{txt}{space 8}211  {c |}{col 14}{res}{space 2} .3009467{col 26}{space 2}  .418572{col 37}{space 1}    0.72{col 46}{space 3}0.475{col 54}{space 4}-.5345265{col 67}{space 3}  1.13642
{txt}{space 8}212  {c |}{col 14}{res}{space 2} .4004733{col 26}{space 2} .3786494{col 37}{space 1}    1.06{col 46}{space 3}0.294{col 54}{space 4} -.355314{col 67}{space 3} 1.156261
{txt}{space 8}221  {c |}{col 14}{res}{space 2} .6504733{col 26}{space 2} .2933687{col 37}{space 1}    2.22{col 46}{space 3}0.030{col 54}{space 4} .0649069{col 67}{space 3}  1.23604
{txt}{space 8}222  {c |}{col 14}{res}{space 2} 1.150473{col 26}{space 2} .5672036{col 37}{space 1}    2.03{col 46}{space 3}0.047{col 54}{space 4} .0183303{col 67}{space 3} 2.282616
{txt}{space 8}311  {c |}{col 14}{res}{space 2}        1{col 26}{space 2} .4421144{col 37}{space 1}    2.26{col 46}{space 3}0.027{col 54}{space 4} .1175359{col 67}{space 3} 1.882464
{txt}{space 8}312  {c |}{col 14}{res}{space 2}       .5{col 26}{space 2} .3230421{col 37}{space 1}    1.55{col 46}{space 3}0.126{col 54}{space 4}-.1447947{col 67}{space 3} 1.144795
{txt}{space 8}321  {c |}{col 14}{res}{space 2} .9676134{col 26}{space 2} .4646657{col 37}{space 1}    2.08{col 46}{space 3}0.041{col 54}{space 4} .0401366{col 67}{space 3}  1.89509
{txt}{space 8}322  {c |}{col 14}{res}{space 2}  1.56714{col 26}{space 2}  .760073{col 37}{space 1}    2.06{col 46}{space 3}0.043{col 54}{space 4}  .050028{col 67}{space 3} 3.084252
{txt}{space 8}411  {c |}{col 14}{res}{space 2} .1504733{col 26}{space 2} .4342382{col 37}{space 1}    0.35{col 46}{space 3}0.730{col 54}{space 4}-.7162697{col 67}{space 3} 1.017216
{txt}{space 8}412  {c |}{col 14}{res}{space 2} .6504733{col 26}{space 2} .7576617{col 37}{space 1}    0.86{col 46}{space 3}0.394{col 54}{space 4}-.8618258{col 67}{space 3} 2.162772
{txt}{space 8}421  {c |}{col 14}{res}{space 2} 2.150473{col 26}{space 2} .5761792{col 37}{space 1}    3.73{col 46}{space 3}0.000{col 54}{space 4} 1.000415{col 67}{space 3} 3.300532
{txt}{space 8}422  {c |}{col 14}{res}{space 2} .8407573{col 26}{space 2} .3757982{col 37}{space 1}    2.24{col 46}{space 3}0.029{col 54}{space 4}  .090661{col 67}{space 3} 1.590854
{txt}{space 8}511  {c |}{col 14}{res}{space 2} .9004733{col 26}{space 2} .7228956{col 37}{space 1}    1.25{col 46}{space 3}0.217{col 54}{space 4}-.5424322{col 67}{space 3} 2.343379
{txt}{space 8}512  {c |}{col 14}{res}{space 2} .1504733{col 26}{space 2} .3939662{col 37}{space 1}    0.38{col 46}{space 3}0.704{col 54}{space 4}-.6358866{col 67}{space 3} .9368333
{txt}{space 8}521  {c |}{col 14}{res}{space 2} 1.150473{col 26}{space 2} .5672036{col 37}{space 1}    2.03{col 46}{space 3}0.047{col 54}{space 4} .0183303{col 67}{space 3} 2.282616
{txt}{space 8}522  {c |}{col 14}{res}{space 2} 1.640757{col 26}{space 2}  .843552{col 37}{space 1}    1.95{col 46}{space 3}0.056{col 54}{space 4}-.0429795{col 67}{space 3} 3.324494
{txt}{space 8}611  {c |}{col 14}{res}{space 2} .9004733{col 26}{space 2} .4000651{col 37}{space 1}    2.25{col 46}{space 3}0.028{col 54}{space 4} .1019401{col 67}{space 3} 1.699007
{txt}{space 8}612  {c |}{col 14}{res}{space 2} 1.150473{col 26}{space 2} .6044302{col 37}{space 1}    1.90{col 46}{space 3}0.061{col 54}{space 4}-.0559744{col 67}{space 3} 2.356921
{txt}{space 8}621  {c |}{col 14}{res}{space 2} .9838067{col 26}{space 2} .6793205{col 37}{space 1}    1.45{col 46}{space 3}0.152{col 54}{space 4}-.3721228{col 67}{space 3} 2.339736
{txt}{space 8}622  {c |}{col 14}{res}{space 2} 1.060189{col 26}{space 2} .5196394{col 37}{space 1}    2.04{col 46}{space 3}0.045{col 54}{space 4} .0229848{col 67}{space 3} 2.097394
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} .3981066{col 26}{space 2} .3249255{col 37}{space 1}    1.23{col 46}{space 3}0.225{col 54}{space 4}-.2504474{col 67}{space 3} 1.046661
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}Linear regression                               Number of obs     = {res}        92
                                                {txt}F(24, 67)         =  {res}     4.15
                                                {txt}Prob > F          = {res}    0.0000
                                                {txt}R-squared         = {res}    0.4125
                                                {txt}Root MSE          =    {res} 321.31

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}      PNG3_w{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}r_treat {c |}{col 14}{res}{space 2} 11.73767{col 26}{space 2} 60.01568{col 37}{space 1}    0.20{col 46}{space 3}0.846{col 54}{space 4}-108.0541{col 67}{space 3} 131.5295
{txt}{space 12} {c |}
{space 6}strata {c |}
{space 8}112  {c |}{col 14}{res}{space 2} 24.91256{col 26}{space 2} 41.71942{col 37}{space 1}    0.60{col 46}{space 3}0.552{col 54}{space 4}-58.35976{col 67}{space 3} 108.1849
{txt}{space 8}121  {c |}{col 14}{res}{space 2} 81.95628{col 26}{space 2} 20.16061{col 37}{space 1}    4.07{col 46}{space 3}0.000{col 54}{space 4} 41.71553{col 67}{space 3}  122.197
{txt}{space 8}122  {c |}{col 14}{res}{space 2} 95.78251{col 26}{space 2} 25.28164{col 37}{space 1}    3.79{col 46}{space 3}0.000{col 54}{space 4} 45.32014{col 67}{space 3} 146.2449
{txt}{space 8}211  {c |}{col 14}{res}{space 2} 92.24589{col 26}{space 2}  76.7601{col 37}{space 1}    1.20{col 46}{space 3}0.234{col 54}{space 4}-60.96792{col 67}{space 3} 245.4597
{txt}{space 8}212  {c |}{col 14}{res}{space 2} 12.37294{col 26}{space 2} 34.94044{col 37}{space 1}    0.35{col 46}{space 3}0.724{col 54}{space 4}-57.36848{col 67}{space 3} 82.11436
{txt}{space 8}221  {c |}{col 14}{res}{space 2} 142.5813{col 26}{space 2} 69.72386{col 37}{space 1}    2.04{col 46}{space 3}0.045{col 54}{space 4} 3.411866{col 67}{space 3} 281.7507
{txt}{space 8}222  {c |}{col 14}{res}{space 2} 244.4563{col 26}{space 2} 179.8512{col 37}{space 1}    1.36{col 46}{space 3}0.179{col 54}{space 4}-114.5282{col 67}{space 3} 603.4408
{txt}{space 8}311  {c |}{col 14}{res}{space 2}      705{col 26}{space 2} 363.0113{col 37}{space 1}    1.94{col 46}{space 3}0.056{col 54}{space 4}-19.57349{col 67}{space 3} 1429.573
{txt}{space 8}312  {c |}{col 14}{res}{space 2} 1075.833{col 26}{space 2} 659.2375{col 37}{space 1}    1.63{col 46}{space 3}0.107{col 54}{space 4}-240.0103{col 67}{space 3} 2391.677
{txt}{space 8}321  {c |}{col 14}{res}{space 2} 618.9126{col 26}{space 2} 320.6307{col 37}{space 1}    1.93{col 46}{space 3}0.058{col 54}{space 4}-21.06902{col 67}{space 3} 1258.894
{txt}{space 8}322  {c |}{col 14}{res}{space 2} 356.9563{col 26}{space 2}  74.9689{col 37}{space 1}    4.76{col 46}{space 3}0.000{col 54}{space 4} 207.3177{col 67}{space 3} 506.5948
{txt}{space 8}411  {c |}{col 14}{res}{space 2} 256.9563{col 26}{space 2} 207.4639{col 37}{space 1}    1.24{col 46}{space 3}0.220{col 54}{space 4}-157.1434{col 67}{space 3} 671.0559
{txt}{space 8}412  {c |}{col 14}{res}{space 2} 54.20628{col 26}{space 2} 22.21824{col 37}{space 1}    2.44{col 46}{space 3}0.017{col 54}{space 4} 9.858493{col 67}{space 3} 98.55406
{txt}{space 8}421  {c |}{col 14}{res}{space 2} 254.4563{col 26}{space 2} 123.1673{col 37}{space 1}    2.07{col 46}{space 3}0.043{col 54}{space 4} 8.613284{col 67}{space 3} 500.2993
{txt}{space 8}422  {c |}{col 14}{res}{space 2}   131.13{col 26}{space 2} 68.83496{col 37}{space 1}    1.90{col 46}{space 3}0.061{col 54}{space 4}-6.265117{col 67}{space 3} 268.5252
{txt}{space 8}511  {c |}{col 14}{res}{space 2} 31.95628{col 26}{space 2} 78.40055{col 37}{space 1}    0.41{col 46}{space 3}0.685{col 54}{space 4}-124.5319{col 67}{space 3} 188.4444
{txt}{space 8}512  {c |}{col 14}{res}{space 2} 119.4563{col 26}{space 2} 122.4172{col 37}{space 1}    0.98{col 46}{space 3}0.333{col 54}{space 4}-124.8895{col 67}{space 3} 363.8021
{txt}{space 8}521  {c |}{col 14}{res}{space 2} 189.2063{col 26}{space 2} 76.03673{col 37}{space 1}    2.49{col 46}{space 3}0.015{col 54}{space 4} 37.43633{col 67}{space 3} 340.9762
{txt}{space 8}522  {c |}{col 14}{res}{space 2}   196.13{col 26}{space 2} 84.93986{col 37}{space 1}    2.31{col 46}{space 3}0.024{col 54}{space 4} 26.58938{col 67}{space 3} 365.6707
{txt}{space 8}611  {c |}{col 14}{res}{space 2} 91.20628{col 26}{space 2} 43.11408{col 37}{space 1}    2.12{col 46}{space 3}0.038{col 54}{space 4} 5.150205{col 67}{space 3} 177.2624
{txt}{space 8}612  {c |}{col 14}{res}{space 2} 94.45628{col 26}{space 2} 67.37743{col 37}{space 1}    1.40{col 46}{space 3}0.166{col 54}{space 4}-40.02963{col 67}{space 3} 228.9422
{txt}{space 8}621  {c |}{col 14}{res}{space 2} 423.6229{col 26}{space 2} 187.7431{col 37}{space 1}    2.26{col 46}{space 3}0.027{col 54}{space 4} 48.88621{col 67}{space 3} 798.3597
{txt}{space 8}622  {c |}{col 14}{res}{space 2} 375.7825{col 26}{space 2} 124.0278{col 37}{space 1}    3.03{col 46}{space 3}0.003{col 54}{space 4}  128.222{col 67}{space 3} 623.3431
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} 37.17489{col 26}{space 2} 40.70465{col 37}{space 1}    0.91{col 46}{space 3}0.364{col 54}{space 4}-44.07193{col 67}{space 3} 118.4217
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}Linear regression                               Number of obs     = {res}        92
                                                {txt}F(24, 67)         =  {res}     1.89
                                                {txt}Prob > F          = {res}    0.0222
                                                {txt}R-squared         = {res}    0.2769
                                                {txt}Root MSE          =    {res} 2117.8

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}expected_r~w{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}r_treat {c |}{col 14}{res}{space 2}-226.8428{col 26}{space 2} 425.1149{col 37}{space 1}   -0.53{col 46}{space 3}0.595{col 54}{space 4}-1075.376{col 67}{space 3} 621.6901
{txt}{space 12} {c |}
{space 6}strata {c |}
{space 8}112  {c |}{col 14}{res}{space 2} 749.3857{col 26}{space 2} 975.8497{col 37}{space 1}    0.77{col 46}{space 3}0.445{col 54}{space 4}-1198.418{col 67}{space 3}  2697.19
{txt}{space 8}121  {c |}{col 14}{res}{space 2}-854.5571{col 26}{space 2} 569.3464{col 37}{space 1}   -1.50{col 46}{space 3}0.138{col 54}{space 4}-1990.977{col 67}{space 3} 281.8631
{txt}{space 8}122  {c |}{col 14}{res}{space 2} 3861.717{col 26}{space 2} 3077.965{col 37}{space 1}    1.25{col 46}{space 3}0.214{col 54}{space 4}-2281.927{col 67}{space 3} 10005.36
{txt}{space 8}211  {c |}{col 14}{res}{space 2}-867.6143{col 26}{space 2} 531.9286{col 37}{space 1}   -1.63{col 46}{space 3}0.108{col 54}{space 4}-1929.348{col 67}{space 3} 194.1198
{txt}{space 8}212  {c |}{col 14}{res}{space 2}-711.7505{col 26}{space 2} 539.2918{col 37}{space 1}   -1.32{col 46}{space 3}0.191{col 54}{space 4}-1788.181{col 67}{space 3} 364.6805
{txt}{space 8}221  {c |}{col 14}{res}{space 2} 364.3804{col 26}{space 2} 1284.659{col 37}{space 1}    0.28{col 46}{space 3}0.778{col 54}{space 4} -2199.81{col 67}{space 3}  2928.57
{txt}{space 8}222  {c |}{col 14}{res}{space 2} 246.8179{col 26}{space 2}  1015.76{col 37}{space 1}    0.24{col 46}{space 3}0.809{col 54}{space 4}-1780.648{col 67}{space 3} 2274.283
{txt}{space 8}311  {c |}{col 14}{res}{space 2}      363{col 26}{space 2} 687.0963{col 37}{space 1}    0.53{col 46}{space 3}0.599{col 54}{space 4} -1008.45{col 67}{space 3}  1734.45
{txt}{space 8}312  {c |}{col 14}{res}{space 2}   -927.3{col 26}{space 2} 524.5734{col 37}{space 1}   -1.77{col 46}{space 3}0.082{col 54}{space 4}-1974.353{col 67}{space 3} 119.7528
{txt}{space 8}321  {c |}{col 14}{res}{space 2}-696.0143{col 26}{space 2} 572.8374{col 37}{space 1}   -1.22{col 46}{space 3}0.229{col 54}{space 4}-1839.403{col 67}{space 3}  447.374
{txt}{space 8}322  {c |}{col 14}{res}{space 2}-402.8288{col 26}{space 2} 557.8982{col 37}{space 1}   -0.72{col 46}{space 3}0.473{col 54}{space 4}-1516.398{col 67}{space 3} 710.7406
{txt}{space 8}411  {c |}{col 14}{res}{space 2}-755.5571{col 26}{space 2} 578.4952{col 37}{space 1}   -1.31{col 46}{space 3}0.196{col 54}{space 4}-1910.238{col 67}{space 3} 399.1241
{txt}{space 8}412  {c |}{col 14}{res}{space 2} 828.9329{col 26}{space 2} 1741.729{col 37}{space 1}    0.48{col 46}{space 3}0.636{col 54}{space 4}-2647.574{col 67}{space 3} 4305.439
{txt}{space 8}421  {c |}{col 14}{res}{space 2} 1137.818{col 26}{space 2} 1959.451{col 37}{space 1}    0.58{col 46}{space 3}0.563{col 54}{space 4}-2773.262{col 67}{space 3} 5048.898
{txt}{space 8}422  {c |}{col 14}{res}{space 2} 204.8286{col 26}{space 2} 806.0875{col 37}{space 1}    0.25{col 46}{space 3}0.800{col 54}{space 4}-1404.129{col 67}{space 3} 1813.786
{txt}{space 8}511  {c |}{col 14}{res}{space 2}-990.6821{col 26}{space 2} 520.2396{col 37}{space 1}   -1.90{col 46}{space 3}0.061{col 54}{space 4}-2029.085{col 67}{space 3} 47.72041
{txt}{space 8}512  {c |}{col 14}{res}{space 2}-408.8121{col 26}{space 2} 781.1985{col 37}{space 1}   -0.52{col 46}{space 3}0.602{col 54}{space 4}-1968.091{col 67}{space 3} 1150.467
{txt}{space 8}521  {c |}{col 14}{res}{space 2}-750.3621{col 26}{space 2} 539.5874{col 37}{space 1}   -1.39{col 46}{space 3}0.169{col 54}{space 4}-1827.383{col 67}{space 3} 326.6589
{txt}{space 8}522  {c |}{col 14}{res}{space 2}-708.9414{col 26}{space 2} 546.1148{col 37}{space 1}   -1.30{col 46}{space 3}0.199{col 54}{space 4}-1798.991{col 67}{space 3} 381.1084
{txt}{space 8}611  {c |}{col 14}{res}{space 2} 481.9429{col 26}{space 2} 1001.688{col 37}{space 1}    0.48{col 46}{space 3}0.632{col 54}{space 4}-1517.434{col 67}{space 3}  2481.32
{txt}{space 8}612  {c |}{col 14}{res}{space 2}-895.3946{col 26}{space 2} 527.2445{col 37}{space 1}   -1.70{col 46}{space 3}0.094{col 54}{space 4}-1947.779{col 67}{space 3} 156.9898
{txt}{space 8}621  {c |}{col 14}{res}{space 2}-763.7271{col 26}{space 2} 559.8701{col 37}{space 1}   -1.36{col 46}{space 3}0.177{col 54}{space 4}-1881.233{col 67}{space 3} 353.7784
{txt}{space 8}622  {c |}{col 14}{res}{space 2}-387.1668{col 26}{space 2} 685.8619{col 37}{space 1}   -0.56{col 46}{space 3}0.574{col 54}{space 4}-1756.153{col 67}{space 3} 981.8193
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} 1141.229{col 26}{space 2} 582.9031{col 37}{space 1}    1.96{col 46}{space 3}0.054{col 54}{space 4}-22.25098{col 67}{space 3} 2304.708
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. matrix A = mat_1
{txt}
{com}. forv i = 2/`listsize' {c -(} // appends into single matrix
{txt}  2{com}.         matrix A = A \ mat_`i'
{txt}  3{com}. {c )-}
{txt}
{com}. 
. * Table
. frmttable using MDE_1.doc, statmat(A) sdec(4) title("Planning and Goals") ///
> ctitle("","MDE","% of mean","# of sd's.") ///
> rtitle("Planning Time Horizon"\"Expected Goats Sold"\"Expected Rev.") addtable replace
{res}
{txt}{center:Planning and Goals}
{txt}{center:{hline 60}}
{center:{txt}{lalign 23:}{txt}{center 12:MDE}{txt}{center 11:% of mean}{txt}{center 12:# of sd's.}}
{txt}{center:{hline 60}}
{center:{txt}{lalign 23:Planning Time Horizon}{res}{center 12:0.5675}{res}{center 11:0.4521}{res}{center 12:0.5778}}
{center:{txt}{lalign 23:Expected Goats Sold}{res}{center 12:170.6262}{res}{center 11:0.6341}{res}{center 12:0.4744}}
{center:{txt}{lalign 23:Expected Rev.}{res}{center 12:1,208.6133}{res}{center 11:1.1945}{res}{center 12:0.5656}}
{txt}{center:{hline 60}}


{com}. 
. 
. 
. 
{txt}end of do-file

{com}. do "/var/folders/_d/jk4yrpt11pbc34dyw8cg5kjm0000gn/T//SD04596.000000"
{txt}
{com}. 
. /*******************************************************************************
> lsilPAP6.d0             
>                                         
> - Generates summary statistic tables
>         
> *******************************************************************************/
. 
. 
. clear
{txt}
{com}. set more off, perm
{txt}({cmd:set more} preference recorded)

{com}. cd "$d2"
{res}/Users/scottmiller/Dropbox (UFL)/LSIL/Pre-Analysis Plan/PAP Master Replication/Output
{txt}
{com}. 
. 
. ** Co-op level dataset
. ********************************************* 
. clear
{txt}
{com}. use "$d3/r_CO_Merged_Ind.dta"
{txt}( )

{com}. 
. 
. ** Co-op variables **
. 
. gl co_summ MAN3 revenue costs net_rev rev_member net_rev_member goatrev ///
>                 PNG2 PNG3_w expected_rev_w ICTassets Otherassets
{txt}
{com}. 
. local listsize : list sizeof global(co_summ)
{txt}
{com}. tokenize $co_summ
{txt}
{com}. 
. forv i = 1/`listsize' {c -(}
{txt}  2{com}.                 
.         quietly {c -(}
{txt}  3{com}.                 sum ``i''
{txt}  4{com}.                 return list
{txt}  5{com}.                 scalar N_``i'' = r(N) // N
{txt}  6{com}.                 scalar mean_``i'' = r(mean) // mean
{txt}  7{com}.                 scalar sd_``i'' = r(sd)  // sd
{txt}  8{com}.                 scalar min_``i'' = r(min)  // sd
{txt}  9{com}.                 scalar max_``i'' = r(max)  // sd
{txt} 10{com}.                 
.         * matrix for table
.                 matrix mat_`i' = (N_``i'',mean_``i'',sd_``i'',min_``i'',max_``i'')
{txt} 11{com}.                 {c )-}
{txt} 12{com}. {c )-}
{txt}
{com}. matrix A = mat_1
{txt}
{com}. forv i = 2/`listsize' {c -(} // appends into single matrix
{txt}  2{com}.         matrix A = A \ mat_`i'
{txt}  3{com}. {c )-}
{txt}
{com}. 
. * Table
. frmttable using CO_summary.tex, tex statmat(A) sdec(2) coljust(l;c;l;l) title("Cooperative Indicators - Summmary Statistics") ///
> ctitle("","N","Mean","sd","Min","Max") ///
> rtitle("Members (count)"\"Revenue (USD)"\"Costs (USD)"\"Net revenue (USD)"\"Revenue per member (USD)"\"Net revenue per member (USD)"\"Goat revenue (USD)"\"Planning time horizon (years)"\"Expected goats sold (count)"\"Expected revenue (USD)"\"Number of ICT assets (count)"\"Number of non-ICT assets (count)")replace
{res}
{txt}{center:Cooperative Indicators - Summmary Statistics}
{txt}{center:{hline 85}}
{center:{txt}{lalign 34:}{txt}{center 7:N}{txt}{center 10:Mean}{txt}{center 10:sd}{txt}{center 11:Min}{txt}{center 11:Max}}
{txt}{center:{hline 85}}
{center:{txt}{lalign 34:Members (count)}{res}{center 7:92.00}{res}{center 10:553.36}{res}{center 10:376.42}{res}{center 11:11.00}{res}{center 11:2,600.00}}
{center:{txt}{lalign 34:Revenue (USD)}{res}{center 7:92.00}{res}{center 10:3,775.21}{res}{center 10:8,014.47}{res}{center 11:0.00}{res}{center 11:65,709.51}}
{center:{txt}{lalign 34:Costs (USD)}{res}{center 7:92.00}{res}{center 10:377.52}{res}{center 10:1,639.07}{res}{center 11:0.00}{res}{center 11:10,964.25}}
{center:{txt}{lalign 34:Net revenue (USD)}{res}{center 7:90.00}{res}{center 10:3,473.19}{res}{center 10:8,245.85}{res}{center 11:-7,935.00}{res}{center 11:65,554.27}}
{center:{txt}{lalign 34:Revenue per member (USD)}{res}{center 7:92.00}{res}{center 10:7.20}{res}{center 10:10.55}{res}{center 11:0.00}{res}{center 11:63.53}}
{center:{txt}{lalign 34:Net revenue per member (USD)}{res}{center 7:90.00}{res}{center 10:6.80}{res}{center 10:10.95}{res}{center 11:-13.22}{res}{center 11:63.53}}
{center:{txt}{lalign 34:Goat revenue (USD)}{res}{center 7:90.00}{res}{center 10:111.86}{res}{center 10:203.73}{res}{center 11:0.00}{res}{center 11:1,029.40}}
{center:{txt}{lalign 34:Planning time horizon (years)}{res}{center 7:92.00}{res}{center 10:1.26}{res}{center 10:0.98}{res}{center 11:0.00}{res}{center 11:5.00}}
{center:{txt}{lalign 34:Expected goats sold (count)}{res}{center 7:92.00}{res}{center 10:269.09}{res}{center 10:359.69}{res}{center 11:0.00}{res}{center 11:2,500.00}}
{center:{txt}{lalign 34:Expected revenue (USD)}{res}{center 7:92.00}{res}{center 10:1,011.83}{res}{center 10:2,136.93}{res}{center 11:0.00}{res}{center 11:14,850.00}}
{center:{txt}{lalign 34:Number of ICT assets (count)}{res}{center 7:92.00}{res}{center 10:0.57}{res}{center 10:0.74}{res}{center 11:0.00}{res}{center 11:3.00}}
{center:{txt}{lalign 34:Number of non-ICT assets (count)}{res}{center 7:92.00}{res}{center 10:2.79}{res}{center 10:2.47}{res}{center 11:0.00}{res}{center 11:15.00}}
{txt}{center:{hline 85}}


{com}.  
. 
. 
. ** HH level dataset
. ********************************************* 
. clear
{txt}
{com}. use "$d3/r_HH_Merged_Ind.dta"
{txt}
{com}. 
. 
. ** HH indicators **
. 
. gl hh_summ dirt_floor nfloors index_mgt index_emp HHR4 HHR14 MEM11 ///
>                         bCOM3 co_opgoatno_w LS8_w ///
>                         rev_goat_w rev_co_opgoat_w ///
>                         net_goat_income_w index_dTRN ///
>         
{txt}
{com}. 
. local listsize : list sizeof global(hh_summ)
{txt}
{com}. tokenize $hh_summ
{txt}
{com}. 
. forv i = 1/`listsize' {c -(}
{txt}  2{com}.                 
.         quietly {c -(}
{txt}  3{com}.                 sum ``i''
{txt}  4{com}.                 return list
{txt}  5{com}.                 scalar N_``i'' = r(N) // N
{txt}  6{com}.                 scalar mean_``i'' = r(mean) // mean
{txt}  7{com}.                 scalar sd_``i'' = r(sd)  // sd
{txt}  8{com}.                 scalar min_``i'' = r(min)  // sd
{txt}  9{com}.                 scalar max_``i'' = r(max)  // sd
{txt} 10{com}.                 
.         * matrix for table
.                 matrix mat_`i' = (N_``i'',mean_``i'',sd_``i'',min_``i'',max_``i'')
{txt} 11{com}.                 {c )-}
{txt} 12{com}. {c )-}
{txt}
{com}. matrix A = mat_1
{txt}
{com}. forv i = 2/`listsize' {c -(} // appends into single matrix
{txt}  2{com}.         matrix A = A \ mat_`i'
{txt}  3{com}. {c )-}
{txt}
{com}. 
. * Table
. frmttable using HH_summary.tex, tex statmat(A) sdec(2) coljust(l;c;l;l) title("Household Indicators - Summmary Statistics") ///
> ctitle("","N","Mean","sd","Min","Max") ///
> rtitle("Household has dirt floors (0/1)"\"Household has more than one floor (0/1)"\"Goat management index"\"Goat empowerment index"\"Age (years)"\"Literacy (0/1)"\"Number of SHG meetings attended (count)"\"Received Sale Information (0/1)"\"Goats sold through cooperative (count)"\"Total goats sold (count)"\"Revenue per goat (USD)"\"Revenue per goat through cooperative (USD)"\"Net goat income (USD)"\"Transparency discrepancy index") replace
{res}
{txt}{center:Household Indicators - Summmary Statistics}
{txt}{center:{hline 88}}
{center:{txt}{lalign 44:}{txt}{center 10:N}{txt}{center 7:Mean}{txt}{center 8:sd}{txt}{center 9:Min}{txt}{center 8:Max}}
{txt}{center:{hline 88}}
{center:{txt}{lalign 44:Household has dirt floors (0/1)}{res}{center 10:2,448.00}{res}{center 7:0.56}{res}{center 8:0.50}{res}{center 9:0.00}{res}{center 8:1.00}}
{center:{txt}{lalign 44:Household has more than one floor (0/1)}{res}{center 10:2,448.00}{res}{center 7:0.58}{res}{center 8:0.49}{res}{center 9:0.00}{res}{center 8:1.00}}
{center:{txt}{lalign 44:Goat management index}{res}{center 10:2,448.00}{res}{center 7:6.41}{res}{center 8:1.49}{res}{center 9:0.00}{res}{center 8:10.00}}
{center:{txt}{lalign 44:Goat empowerment index}{res}{center 10:2,448.00}{res}{center 7:8.77}{res}{center 8:5.03}{res}{center 9:0.00}{res}{center 8:12.00}}
{center:{txt}{lalign 44:Age (years)}{res}{center 10:2,448.00}{res}{center 7:42.82}{res}{center 8:11.72}{res}{center 9:6.00}{res}{center 8:83.00}}
{center:{txt}{lalign 44:Literacy (0/1)}{res}{center 10:2,446.00}{res}{center 7:0.79}{res}{center 8:0.36}{res}{center 9:0.00}{res}{center 8:1.00}}
{center:{txt}{lalign 44:Number of SHG meetings attended (count)}{res}{center 10:2,448.00}{res}{center 7:1.84}{res}{center 8:2.49}{res}{center 9:0.00}{res}{center 8:24.00}}
{center:{txt}{lalign 44:Received Sale Information (0/1)}{res}{center 10:2,448.00}{res}{center 7:0.29}{res}{center 8:0.45}{res}{center 9:0.00}{res}{center 8:1.00}}
{center:{txt}{lalign 44:Goats sold through cooperative (count)}{res}{center 10:2,448.00}{res}{center 7:0.22}{res}{center 8:0.75}{res}{center 9:0.00}{res}{center 8:5.00}}
{center:{txt}{lalign 44:Total goats sold (count)}{res}{center 10:2,448.00}{res}{center 7:1.10}{res}{center 8:1.58}{res}{center 9:0.00}{res}{center 8:9.00}}
{center:{txt}{lalign 44:Revenue per goat (USD)}{res}{center 10:2,448.00}{res}{center 7:42.10}{res}{center 8:49.84}{res}{center 9:0.00}{res}{center 8:193.05}}
{center:{txt}{lalign 44:Revenue per goat through cooperative (USD)}{res}{center 10:2,448.00}{res}{center 7:9.46}{res}{center 8:29.18}{res}{center 9:0.00}{res}{center 8:134.64}}
{center:{txt}{lalign 44:Net goat income (USD)}{res}{center 10:2,448.00}{res}{center 7:59.15}{res}{center 8:138.82}{res}{center 9:-276.21}{res}{center 8:696.96}}
{center:{txt}{lalign 44:Transparency discrepancy index}{res}{center 10:1,647.00}{res}{center 7:0.31}{res}{center 8:1.05}{res}{center 9:-1.14}{res}{center 8:2.11}}
{txt}{center:{hline 88}}


{com}.  
. 
. 
{txt}end of do-file

{com}. do "/var/folders/_d/jk4yrpt11pbc34dyw8cg5kjm0000gn/T//SD04596.000000"
{txt}
{com}. 
. /*******************************************************************************
> lsilPAP7.d0             
>                                         
> - Generates balance tables
>         
> *******************************************************************************/
. 
. 
. * Balance tables after dropping Banke district
. clear 
{txt}
{com}. use "$d3/r_CO_Merged_Ind.dta"
{txt}( )

{com}. 
. 
. foreach v of varlist COMM8b COMM8d {c -(}
{txt}  2{com}.         qui tab `v', g(`v'_)
{txt}  3{com}. {c )-}
{txt}
{com}. 
. local j 1
{txt}
{com}. foreach i in seriously somewhat "doesn't" {c -(}
{txt}  2{com}.         lab var COMM8b_`j' "Mobile network `i' limits communication"
{txt}  3{com}.         local ++j
{txt}  4{com}. {c )-}
{txt}
{com}. 
. local j 1
{txt}
{com}. foreach i in seriously somewhat "doesn't" {c -(}
{txt}  2{com}.         lab var COMM8d_`j' "Distance between members `i' limits communication"
{txt}  3{com}.         local ++j
{txt}  4{com}. {c )-}
{txt}
{com}. 
. 
. foreach v of varlist COMM8b_1 COMM8d_1 {c -(}
{txt}  2{com}.         cap destring `v', replace
{txt}  3{com}. {c )-}
{txt}
{com}. 
. 
. ** Winsorize PNG3
. * -----------------------------------------------
. * treatment
. sum PNG3 if r_treat == 1, d

     {txt}PNG3 Over the next 6 months, how many goats do you
                expect to be sold through the
{hline 61}
      Percentiles      Smallest
 1%    {res}        0              0
{txt} 5%    {res}        0              0
{txt}10%    {res}        0              0       {txt}Obs         {res}         46
{txt}25%    {res}       70              0       {txt}Sum of Wgt. {res}         46

{txt}50%    {res} 158.3333                      {txt}Mean          {res} 287.8841
                        {txt}Largest       Std. Dev.     {res} 433.1713
{txt}75%    {res}      350            800
{txt}90%    {res}      530            900       {txt}Variance      {res} 187637.4
{txt}95%    {res}      900           1500       {txt}Skewness      {res} 3.514736
{txt}99%    {res}     2500           2500       {txt}Kurtosis      {res} 17.03185
{txt}
{com}. scalar t_99 = r(p99)
{txt}
{com}. 
. replace PNG3 = t_99 if PNG3 > t_99 & !missing(PNG3) & r_treat == 1
{txt}(0 real changes made)

{com}. 
. sum PNG3 if r_treat == 1, d

     {txt}PNG3 Over the next 6 months, how many goats do you
                expect to be sold through the
{hline 61}
      Percentiles      Smallest
 1%    {res}        0              0
{txt} 5%    {res}        0              0
{txt}10%    {res}        0              0       {txt}Obs         {res}         46
{txt}25%    {res}       70              0       {txt}Sum of Wgt. {res}         46

{txt}50%    {res} 158.3333                      {txt}Mean          {res} 287.8841
                        {txt}Largest       Std. Dev.     {res} 433.1713
{txt}75%    {res}      350            800
{txt}90%    {res}      530            900       {txt}Variance      {res} 187637.4
{txt}95%    {res}      900           1500       {txt}Skewness      {res} 3.514736
{txt}99%    {res}     2500           2500       {txt}Kurtosis      {res} 17.03185
{txt}
{com}. scalar t_1= r(p1)
{txt}
{com}. 
. replace PNG3 = t_1 if PNG3 < t_1 & !missing(PNG3) & r_treat == 1
{txt}(0 real changes made)

{com}. 
. 
. *control
. sum PNG3 if r_treat == 0, d

     {txt}PNG3 Over the next 6 months, how many goats do you
                expect to be sold through the
{hline 61}
      Percentiles      Smallest
 1%    {res}        0              0
{txt} 5%    {res}        0              0
{txt}10%    {res}       15              0       {txt}Obs         {res}         46
{txt}25%    {res}       90              0       {txt}Sum of Wgt. {res}         46

{txt}50%    {res}      150                      {txt}Mean          {res} 250.2971
                        {txt}Largest       Std. Dev.     {res} 270.6903
{txt}75%    {res}      400            500
{txt}90%    {res}      500            800       {txt}Variance      {res} 73273.23
{txt}95%    {res}      800           1000       {txt}Skewness      {res}  1.92486
{txt}99%    {res}     1300           1300       {txt}Kurtosis      {res} 7.132633
{txt}
{com}. scalar c_99 = r(p99)
{txt}
{com}. 
. replace PNG3 = c_99 if PNG3 > c_99 & !missing(PNG3) & r_treat == 0
{txt}(0 real changes made)

{com}. 
. sum PNG3 if r_treat == 0, d

     {txt}PNG3 Over the next 6 months, how many goats do you
                expect to be sold through the
{hline 61}
      Percentiles      Smallest
 1%    {res}        0              0
{txt} 5%    {res}        0              0
{txt}10%    {res}       15              0       {txt}Obs         {res}         46
{txt}25%    {res}       90              0       {txt}Sum of Wgt. {res}         46

{txt}50%    {res}      150                      {txt}Mean          {res} 250.2971
                        {txt}Largest       Std. Dev.     {res} 270.6903
{txt}75%    {res}      400            500
{txt}90%    {res}      500            800       {txt}Variance      {res} 73273.23
{txt}95%    {res}      800           1000       {txt}Skewness      {res}  1.92486
{txt}99%    {res}     1300           1300       {txt}Kurtosis      {res} 7.132633
{txt}
{com}. scalar t_1= r(p1)
{txt}
{com}. 
. replace PNG3 = t_1 if PNG3 < t_1 & !missing(PNG3) & r_treat == 0
{txt}(0 real changes made)

{com}. * -----------------------------------------------
. 
. 
. ** Winsorize expected_rev
. * -----------------------------------------------
. * treatment
. sum expected_rev if r_treat == 1, d

                        {txt}expected_rev
{hline 61}
      Percentiles      Smallest
 1%    {res}        0              0
{txt} 5%    {res}        0              0
{txt}10%    {res}        0              0       {txt}Obs         {res}         46
{txt}25%    {res}    .9801              0       {txt}Sum of Wgt. {res}         46

{txt}50%    {res}    247.5                      {txt}Mean          {res} 944.3766
                        {txt}Largest       Std. Dev.     {res} 2318.663
{txt}75%    {res} 717.9133           2970
{txt}90%    {res}   2227.5         3207.6       {txt}Variance      {res}  5376200
{txt}95%    {res}   3207.6         4702.5       {txt}Skewness      {res} 4.953379
{txt}99%    {res}    14850          14850       {txt}Kurtosis      {res} 29.59339
{txt}
{com}. scalar t_99 = r(p99)
{txt}
{com}. 
. replace expected_rev = t_99 if expected_rev > t_99 & !missing(expected_rev) & r_treat == 1
{txt}(0 real changes made)

{com}. 
. sum expected_rev if r_treat == 1, d

                        {txt}expected_rev
{hline 61}
      Percentiles      Smallest
 1%    {res}        0              0
{txt} 5%    {res}        0              0
{txt}10%    {res}        0              0       {txt}Obs         {res}         46
{txt}25%    {res}    .9801              0       {txt}Sum of Wgt. {res}         46

{txt}50%    {res}    247.5                      {txt}Mean          {res} 944.3766
                        {txt}Largest       Std. Dev.     {res} 2318.663
{txt}75%    {res} 717.9133           2970
{txt}90%    {res}   2227.5         3207.6       {txt}Variance      {res}  5376200
{txt}95%    {res}   3207.6         4702.5       {txt}Skewness      {res} 4.953379
{txt}99%    {res}    14850          14850       {txt}Kurtosis      {res} 29.59339
{txt}
{com}. scalar t_1= r(p1)
{txt}
{com}. 
. replace expected_rev = t_1 if expected_rev < t_1 & !missing(expected_rev) & r_treat == 1
{txt}(0 real changes made)

{com}. 
. 
. *control
. sum expected_rev if r_treat == 0, d

                        {txt}expected_rev
{hline 61}
      Percentiles      Smallest
 1%    {res}        0              0
{txt} 5%    {res}        0              0
{txt}10%    {res}        0              0       {txt}Obs         {res}         46
{txt}25%    {res}       99              0       {txt}Sum of Wgt. {res}         46

{txt}50%    {res}      396                      {txt}Mean          {res} 1079.293
                        {txt}Largest       Std. Dev.     {res}  1961.87
{txt}75%    {res}      594           3960
{txt}90%    {res}     2970           6930       {txt}Variance      {res}  3848935
{txt}95%    {res}     6930           7920       {txt}Skewness      {res} 2.557149
{txt}99%    {res}     7920           7920       {txt}Kurtosis      {res} 8.704253
{txt}
{com}. scalar c_99 = r(p99)
{txt}
{com}. 
. replace expected_rev = c_99 if expected_rev > c_99 & !missing(expected_rev) & r_treat == 0
{txt}(0 real changes made)

{com}. 
. sum expected_rev if r_treat == 0, d

                        {txt}expected_rev
{hline 61}
      Percentiles      Smallest
 1%    {res}        0              0
{txt} 5%    {res}        0              0
{txt}10%    {res}        0              0       {txt}Obs         {res}         46
{txt}25%    {res}       99              0       {txt}Sum of Wgt. {res}         46

{txt}50%    {res}      396                      {txt}Mean          {res} 1079.293
                        {txt}Largest       Std. Dev.     {res}  1961.87
{txt}75%    {res}      594           3960
{txt}90%    {res}     2970           6930       {txt}Variance      {res}  3848935
{txt}95%    {res}     6930           7920       {txt}Skewness      {res} 2.557149
{txt}99%    {res}     7920           7920       {txt}Kurtosis      {res} 8.704253
{txt}
{com}. scalar t_1= r(p1)
{txt}
{com}. 
. replace expected_rev = t_1 if expected_rev < t_1 & !missing(expected_rev) & r_treat == 0
{txt}(0 real changes made)

{com}. * -----------------------------------------------
. 
. 
. 
. lab var PNG2 "Planning time horizon (years)"
{txt}
{com}. lab var PNG3 "Expected goats sold over next 6 months (count)"
{txt}
{com}. lab var expected_rev "Expected tevenue over next 6 months (USD)"
{txt}
{com}. 
. lab var CO_TRN1 "Mandate is made available to members (0/1)"
{txt}
{com}. lab var CO_TRN2 "Annual report is made available to members (0/1)"
{txt}
{com}. lab var CO_TRN3 "Annual budget is made available to members (0/1)"
{txt}
{com}. lab var CO_TRN4 "Financial report is made available to members (0/1)"
{txt}
{com}. lab var CO_TRN5 "Meeting minutes are made available to members (0/1)"
{txt}
{com}. lab var CO_TRN6 "Election results are made available to members (0/1)"
{txt}
{com}. lab var CO_TRN7 "Sale records are made available to members (0/1)"
{txt}
{com}. 
. lab var MAN3 "Members (count)"
{txt}
{com}. lab var revenue "Cooperative revenue (USD)"
{txt}
{com}. lab var ICTassets "Total number of ICT assets (count)"
{txt}
{com}. lab var Otherassets "Total number of non-ICT assets (count)"
{txt}
{com}. 
. 
. *iebaltable
. 
. iebaltab revenue PNG2 PNG3 expected_rev ///
>                 CO_TRN1 CO_TRN2 CO_TRN3 CO_TRN4 CO_TRN5 ///
>                 CO_TRN6 CO_TRN7 ///
>                 COMM8b_1 COMM8d_1 ///
>                 MAN3 ICTassets Otherassets, rowvarlabels grpvar(treat) ///
>                 savetex("$d2/iebaltab1_nobanke_PAP.tex") replace
{res}{phang}Balance table saved to: {browse "/Users/scottmiller/Dropbox (UFL)/LSIL/Pre-Analysis Plan/PAP Master Replication/Output/iebaltab1_nobanke_PAP.tex":/Users/scottmiller/Dropbox (UFL)/LSIL/Pre-Analysis Plan/PAP Master Replication/Output/iebaltab1_nobanke_PAP.tex} 
{txt}
{smcl}
{com}. 
. 
. * ------------------------------------------------
.                 
.                 
.                 
. * Household Data                
. clear
{txt}
{com}. use "$d3/r_HH_Merged_Ind.dta"
{txt}
{com}. 
. 
. 
. ** Winsorize LS8 with true treatment status
. * -----------------------------------------------
. * treatment
. sum LS8 if r_treat == 1, d

         {txt}LS8 How many goats were sold in that sale?
{hline 61}
      Percentiles      Smallest
 1%    {res}        0              0
{txt} 5%    {res}        0              0
{txt}10%    {res}        0              0       {txt}Obs         {res}      1,296
{txt}25%    {res}        0              0       {txt}Sum of Wgt. {res}      1,296

{txt}50%    {res}        0                      {txt}Mean          {res} 1.151235
                        {txt}Largest       Std. Dev.     {res} 1.833274
{txt}75%    {res}        2             15
{txt}90%    {res}        3             15       {txt}Variance      {res} 3.360894
{txt}95%    {res}        4             16       {txt}Skewness      {res} 3.427894
{txt}99%    {res}        9             18       {txt}Kurtosis      {res} 22.10022
{txt}
{com}. scalar t_99 = r(p99)
{txt}
{com}. 
. replace LS8 = t_99 if LS8 > t_99 & !missing(LS8) & r_treat == 1
{txt}(11 real changes made)

{com}. 
. sum LS8 if r_treat == 1, d

         {txt}LS8 How many goats were sold in that sale?
{hline 61}
      Percentiles      Smallest
 1%    {res}        0              0
{txt} 5%    {res}        0              0
{txt}10%    {res}        0              0       {txt}Obs         {res}      1,296
{txt}25%    {res}        0              0       {txt}Sum of Wgt. {res}      1,296

{txt}50%    {res}        0                      {txt}Mean          {res} 1.118827
                        {txt}Largest       Std. Dev.     {res} 1.629767
{txt}75%    {res}        2              9
{txt}90%    {res}        3              9       {txt}Variance      {res} 2.656139
{txt}95%    {res}        4              9       {txt}Skewness      {res} 2.182047
{txt}99%    {res}        9              9       {txt}Kurtosis      {res} 9.012592
{txt}
{com}. scalar t_1= r(p1)
{txt}
{com}. 
. replace LS8 = t_1 if LS8 < t_1 & !missing(LS8) & r_treat == 1
{txt}(0 real changes made)

{com}. 
. 
. *control
. sum LS8 if r_treat == 0, d

         {txt}LS8 How many goats were sold in that sale?
{hline 61}
      Percentiles      Smallest
 1%    {res}        0              0
{txt} 5%    {res}        0              0
{txt}10%    {res}        0              0       {txt}Obs         {res}      1,152
{txt}25%    {res}        0              0       {txt}Sum of Wgt. {res}      1,152

{txt}50%    {res}        0                      {txt}Mean          {res}    1.125
                        {txt}Largest       Std. Dev.     {res} 1.919763
{txt}75%    {res}        2             19
{txt}90%    {res}        3             20       {txt}Variance      {res} 3.685491
{txt}95%    {res}        4             20       {txt}Skewness      {res} 4.977948
{txt}99%    {res}        8             24       {txt}Kurtosis      {res} 45.17393
{txt}
{com}. scalar c_99 = r(p99)
{txt}
{com}. 
. replace LS8 = c_99 if LS8 > c_99 & !missing(LS8) & r_treat == 0
{txt}(10 real changes made)

{com}. 
. sum LS8 if r_treat == 0, d

         {txt}LS8 How many goats were sold in that sale?
{hline 61}
      Percentiles      Smallest
 1%    {res}        0              0
{txt} 5%    {res}        0              0
{txt}10%    {res}        0              0       {txt}Obs         {res}      1,152
{txt}25%    {res}        0              0       {txt}Sum of Wgt. {res}      1,152

{txt}50%    {res}        0                      {txt}Mean          {res} 1.069444
                        {txt}Largest       Std. Dev.     {res}  1.51633
{txt}75%    {res}        2              8
{txt}90%    {res}        3              8       {txt}Variance      {res} 2.299257
{txt}95%    {res}        4              8       {txt}Skewness      {res} 2.015454
{txt}99%    {res}        8              8       {txt}Kurtosis      {res} 7.985062
{txt}
{com}. scalar t_1= r(p1)
{txt}
{com}. 
. replace LS8 = t_1 if LS8 < t_1 & !missing(LS8) & r_treat == 0
{txt}(0 real changes made)

{com}. * -----------------------------------------------
. 
. 
. ** Winsorize co_opgoatno
. * -----------------------------------------------
. * treatment
. sum co_opgoatno if r_treat == 1, d

               {txt}Total goats sold through co-op
{hline 61}
      Percentiles      Smallest
 1%    {res}        0              0
{txt} 5%    {res}        0              0
{txt}10%    {res}        0              0       {txt}Obs         {res}      1,296
{txt}25%    {res}        0              0       {txt}Sum of Wgt. {res}      1,296

{txt}50%    {res}        0                      {txt}Mean          {res} .2739198
                        {txt}Largest       Std. Dev.     {res} 1.050743
{txt}75%    {res}        0             10
{txt}90%    {res}        1             10       {txt}Variance      {res} 1.104061
{txt}95%    {res}        2             12       {txt}Skewness      {res} 6.767831
{txt}99%    {res}        5             15       {txt}Kurtosis      {res} 66.37082
{txt}
{com}. scalar t_99 = r(p99)
{txt}
{com}. 
. replace co_opgoatno = t_99 if co_opgoatno > t_99 & !missing(co_opgoatno) & r_treat == 1
{txt}(9 real changes made)

{com}. 
. sum co_opgoatno if r_treat == 1, d

               {txt}Total goats sold through co-op
{hline 61}
      Percentiles      Smallest
 1%    {res}        0              0
{txt} 5%    {res}        0              0
{txt}10%    {res}        0              0       {txt}Obs         {res}      1,296
{txt}25%    {res}        0              0       {txt}Sum of Wgt. {res}      1,296

{txt}50%    {res}        0                      {txt}Mean          {res} .2438272
                        {txt}Largest       Std. Dev.     {res} .7971719
{txt}75%    {res}        0              5
{txt}90%    {res}        1              5       {txt}Variance      {res} .6354831
{txt}95%    {res}        2              5       {txt}Skewness      {res} 3.862942
{txt}99%    {res}        5              5       {txt}Kurtosis      {res} 18.85913
{txt}
{com}. scalar t_1= r(p1)
{txt}
{com}. 
. replace co_opgoatno = t_1 if co_opgoatno < t_1 & !missing(co_opgoatno) & r_treat == 1
{txt}(0 real changes made)

{com}. 
. 
. *control
. sum co_opgoatno if r_treat == 0, d

               {txt}Total goats sold through co-op
{hline 61}
      Percentiles      Smallest
 1%    {res}        0              0
{txt} 5%    {res}        0              0
{txt}10%    {res}        0              0       {txt}Obs         {res}      1,152
{txt}25%    {res}        0              0       {txt}Sum of Wgt. {res}      1,152

{txt}50%    {res}        0                      {txt}Mean          {res} .2126736
                        {txt}Largest       Std. Dev.     {res} .7702635
{txt}75%    {res}        0              5
{txt}90%    {res}        0              6       {txt}Variance      {res} .5933058
{txt}95%    {res}        2              7       {txt}Skewness      {res} 4.728621
{txt}99%    {res}        4              8       {txt}Kurtosis      {res} 30.15783
{txt}
{com}. scalar c_99 = r(p99)
{txt}
{com}. 
. replace co_opgoatno = c_99 if co_opgoatno > c_99 & !missing(co_opgoatno) & r_treat == 0
{txt}(6 real changes made)

{com}. 
. sum co_opgoatno if r_treat == 0, d

               {txt}Total goats sold through co-op
{hline 61}
      Percentiles      Smallest
 1%    {res}        0              0
{txt} 5%    {res}        0              0
{txt}10%    {res}        0              0       {txt}Obs         {res}      1,152
{txt}25%    {res}        0              0       {txt}Sum of Wgt. {res}      1,152

{txt}50%    {res}        0                      {txt}Mean          {res} .2022569
                        {txt}Largest       Std. Dev.     {res} .6974411
{txt}75%    {res}        0              4
{txt}90%    {res}        0              4       {txt}Variance      {res} .4864241
{txt}95%    {res}        2              4       {txt}Skewness      {res} 3.898835
{txt}99%    {res}        4              4       {txt}Kurtosis      {res} 18.40689
{txt}
{com}. scalar t_1= r(p1)
{txt}
{com}. 
. replace co_opgoatno = t_1 if co_opgoatno < t_1 & !missing(co_opgoatno) & r_treat == 0
{txt}(0 real changes made)

{com}. * -----------------------------------------------
. 
. 
. ** Winsorize rev_goat with true treatment status
. * -----------------------------------------------
. * treatment
. sum rev_goat if treat == 1, d

                          {txt}rev_goat
{hline 61}
      Percentiles      Smallest
 1%    {res}        0              0
{txt} 5%    {res}        0              0
{txt}10%    {res}        0              0       {txt}Obs         {res}      1,248
{txt}25%    {res}        0              0       {txt}Sum of Wgt. {res}      1,248

{txt}50%    {res}    2.475                      {txt}Mean          {res} 44.36152
                        {txt}Largest       Std. Dev.     {res} 69.97556
{txt}75%    {res} 81.05212          247.5
{txt}90%    {res}    118.8          247.5       {txt}Variance      {res} 4896.579
{txt}95%    {res}      132          247.5       {txt}Skewness      {res} 11.88981
{txt}99%    {res}    178.2       1748.297       {txt}Kurtosis      {res} 282.9779
{txt}
{com}. scalar t_99 = r(p99)
{txt}
{com}. 
. replace rev_goat = t_99 if rev_goat > t_99 & !missing(rev_goat) & treat == 1
{txt}(12 real changes made)

{com}. 
. sum rev_goat if treat == 1, d

                          {txt}rev_goat
{hline 61}
      Percentiles      Smallest
 1%    {res}        0              0
{txt} 5%    {res}        0              0
{txt}10%    {res}        0              0       {txt}Obs         {res}      1,248
{txt}25%    {res}        0              0       {txt}Sum of Wgt. {res}      1,248

{txt}50%    {res}    2.475                      {txt}Mean          {res}  42.7859
                        {txt}Largest       Std. Dev.     {res} 49.77929
{txt}75%    {res} 81.05212          178.2
{txt}90%    {res}    118.8          178.2       {txt}Variance      {res} 2477.978
{txt}95%    {res}      132          178.2       {txt}Skewness      {res} .7596182
{txt}99%    {res}    178.2          178.2       {txt}Kurtosis      {res} 2.393749
{txt}
{com}. scalar t_1= r(p1)
{txt}
{com}. 
. replace rev_goat = t_1 if rev_goat < t_1 & !missing(rev_goat) & treat == 1
{txt}(0 real changes made)

{com}. 
. 
. *control
. sum rev_goat if treat == 0, d

                          {txt}rev_goat
{hline 61}
      Percentiles      Smallest
 1%    {res}        0              0
{txt} 5%    {res}        0              0
{txt}10%    {res}        0              0       {txt}Obs         {res}      1,200
{txt}25%    {res}        0              0       {txt}Sum of Wgt. {res}      1,200

{txt}50%    {res}        0                      {txt}Mean          {res} 41.66257
                        {txt}Largest       Std. Dev.     {res} 50.87696
{txt}75%    {res}     79.2          237.6
{txt}90%    {res}   117.48          237.6       {txt}Variance      {res} 2588.465
{txt}95%    {res}    138.6          247.5       {txt}Skewness      {res} .9972224
{txt}99%    {res}   179.85          257.4       {txt}Kurtosis      {res} 3.320916
{txt}
{com}. scalar c_99 = r(p99)
{txt}
{com}. 
. replace rev_goat = c_99 if rev_goat > c_99 & !missing(rev_goat) & treat == 0
{txt}(12 real changes made)

{com}. 
. sum rev_goat if treat == 0, d

                          {txt}rev_goat
{hline 61}
      Percentiles      Smallest
 1%    {res}        0              0
{txt} 5%    {res}        0              0
{txt}10%    {res}        0              0       {txt}Obs         {res}      1,200
{txt}25%    {res}        0              0       {txt}Sum of Wgt. {res}      1,200

{txt}50%    {res}        0                      {txt}Mean          {res} 41.28307
                        {txt}Largest       Std. Dev.     {res} 49.63457
{txt}75%    {res}     79.2         179.85
{txt}90%    {res}   117.48         179.85       {txt}Variance      {res}  2463.59
{txt}95%    {res}    138.6         179.85       {txt}Skewness      {res} .8423338
{txt}99%    {res}  179.025         179.85       {txt}Kurtosis      {res} 2.538168
{txt}
{com}. scalar t_1= r(p1)
{txt}
{com}. 
. replace rev_goat = t_1 if rev_goat < t_1 & !missing(rev_goat) & treat == 0
{txt}(0 real changes made)

{com}. 
. * -----------------------------------------------
. 
. ** Winsorize rev_co_opgoat
. * -----------------------------------------------
. * treatment
. sum rev_co_opgoat if r_treat == 1, d

                        {txt}rev_co_opgoat
{hline 61}
      Percentiles      Smallest
 1%    {res}        0              0
{txt} 5%    {res}        0              0
{txt}10%    {res}        0              0       {txt}Obs         {res}      1,296
{txt}25%    {res}        0              0       {txt}Sum of Wgt. {res}      1,296

{txt}50%    {res}        0                      {txt}Mean          {res} 10.34669
                        {txt}Largest       Std. Dev.     {res} 31.23076
{txt}75%    {res}        0         163.35
{txt}90%    {res}     49.5       169.7355       {txt}Variance      {res} 975.3604
{txt}95%    {res}       99          171.6       {txt}Skewness      {res} 3.027535
{txt}99%    {res}      132         173.25       {txt}Kurtosis      {res}  11.1785
{txt}
{com}. scalar t_99 = r(p99)
{txt}
{com}. 
. replace rev_co_opgoat = t_99 if rev_co_opgoat > t_99 & !missing(rev_co_opgoat) & r_treat == 1
{txt}(11 real changes made)

{com}. 
. sum rev_co_opgoat if r_treat == 1, d

                        {txt}rev_co_opgoat
{hline 61}
      Percentiles      Smallest
 1%    {res}        0              0
{txt} 5%    {res}        0              0
{txt}10%    {res}        0              0       {txt}Obs         {res}      1,296
{txt}25%    {res}        0              0       {txt}Sum of Wgt. {res}      1,296

{txt}50%    {res}        0                      {txt}Mean          {res} 10.13233
                        {txt}Largest       Std. Dev.     {res} 30.27671
{txt}75%    {res}        0            132
{txt}90%    {res}     49.5            132       {txt}Variance      {res}  916.679
{txt}95%    {res}       99            132       {txt}Skewness      {res} 2.908345
{txt}99%    {res}      132            132       {txt}Kurtosis      {res}  10.0833
{txt}
{com}. scalar t_1= r(p1)
{txt}
{com}. 
. replace rev_co_opgoat = t_1 if rev_co_opgoat < t_1 & !missing(rev_co_opgoat) & r_treat == 1
{txt}(0 real changes made)

{com}. 
. 
. *control
. sum rev_co_opgoat if r_treat == 0, d

                        {txt}rev_co_opgoat
{hline 61}
      Percentiles      Smallest
 1%    {res}        0              0
{txt} 5%    {res}        0              0
{txt}10%    {res}        0              0       {txt}Obs         {res}      1,152
{txt}25%    {res}        0              0       {txt}Sum of Wgt. {res}      1,152

{txt}50%    {res}        0                      {txt}Mean          {res} 8.907887
                        {txt}Largest       Std. Dev.     {res} 29.02898
{txt}75%    {res}        0         156.42
{txt}90%    {res}        0         173.25       {txt}Variance      {res} 842.6815
{txt}95%    {res}     85.8         173.25       {txt}Skewness      {res}  3.42351
{txt}99%    {res}   134.64        232.452       {txt}Kurtosis      {res} 14.77929
{txt}
{com}. scalar c_99 = r(p99)
{txt}
{com}. 
. replace rev_co_opgoat = c_99 if rev_co_opgoat > c_99 & !missing(rev_co_opgoat) & r_treat == 0
{txt}(11 real changes made)

{com}. 
. sum rev_co_opgoat if r_treat == 0, d

                        {txt}rev_co_opgoat
{hline 61}
      Percentiles      Smallest
 1%    {res}        0              0
{txt} 5%    {res}        0              0
{txt}10%    {res}        0              0       {txt}Obs         {res}      1,152
{txt}25%    {res}        0              0       {txt}Sum of Wgt. {res}      1,152

{txt}50%    {res}        0                      {txt}Mean          {res} 8.696223
                        {txt}Largest       Std. Dev.     {res} 27.88577
{txt}75%    {res}        0         134.64
{txt}90%    {res}        0         134.64       {txt}Variance      {res} 777.6163
{txt}95%    {res}     85.8         134.64       {txt}Skewness      {res} 3.174078
{txt}99%    {res}   134.64         134.64       {txt}Kurtosis      {res} 11.90937
{txt}
{com}. scalar t_1= r(p1)
{txt}
{com}. 
. replace rev_co_opgoat = t_1 if rev_co_opgoat < t_1 & !missing(rev_co_opgoat) & r_treat == 0
{txt}(0 real changes made)

{com}. * -----------------------------------------------
. 
. ** Winsorize net goat income
. * -----------------------------------------------
. * treatment
. sum net_goat_income if treat == 1, d

                       {txt}net_goat_income
{hline 61}
      Percentiles      Smallest
 1%    {res}  -201.96       -9867.33
{txt} 5%    {res}   -88.11        -7474.5
{txt}10%    {res}    -49.5       -1236.51       {txt}Obs         {res}      1,248
{txt}25%    {res} -13.1472       -1090.98       {txt}Sum of Wgt. {res}      1,248

{txt}50%    {res}        0                      {txt}Mean          {res} 51.65879
                        {txt}Largest       Std. Dev.     {res} 397.5832
{txt}75%    {res}   116.82        1146.42
{txt}90%    {res}    237.6        1398.87       {txt}Variance      {res} 158072.4
{txt}95%    {res}  345.015        1836.45       {txt}Skewness      {res}-17.56965
{txt}99%    {res}   748.44        2182.95       {txt}Kurtosis      {res} 415.5162
{txt}
{com}. scalar t_99 = r(p99)
{txt}
{com}. 
. replace net_goat_income = t_99 if net_goat_income > t_99 & !missing(net_goat_income) & treat == 1
{txt}(12 real changes made)

{com}. 
. sum net_goat_income if treat == 1, d

                       {txt}net_goat_income
{hline 61}
      Percentiles      Smallest
 1%    {res}  -201.96       -9867.33
{txt} 5%    {res}   -88.11        -7474.5
{txt}10%    {res}    -49.5       -1236.51       {txt}Obs         {res}      1,248
{txt}25%    {res} -13.1472       -1090.98       {txt}Sum of Wgt. {res}      1,248

{txt}50%    {res}        0                      {txt}Mean          {res} 47.57252
                        {txt}Largest       Std. Dev.     {res} 385.9894
{txt}75%    {res}   116.82         748.44
{txt}90%    {res}    237.6         748.44       {txt}Variance      {res} 148987.8
{txt}95%    {res}  345.015         748.44       {txt}Skewness      {res}-19.46058
{txt}99%    {res}   748.44         748.44       {txt}Kurtosis      {res} 465.5326
{txt}
{com}. scalar t_1= r(p1)
{txt}
{com}. 
. replace net_goat_income = t_1 if net_goat_income < t_1 & !missing(net_goat_income) & treat == 1
{txt}(12 real changes made)

{com}. 
. *control
. sum net_goat_income if treat == 0, d

                       {txt}net_goat_income
{hline 61}
      Percentiles      Smallest
 1%    {res} -245.025        -945.45
{txt} 5%    {res}-80.19495         -643.5
{txt}10%    {res}   -44.55        -500.94       {txt}Obs         {res}      1,200
{txt}25%    {res}     -9.9        -373.23       {txt}Sum of Wgt. {res}      1,200

{txt}50%    {res}        0                      {txt}Mean          {res} 55.54974
                        {txt}Largest       Std. Dev.     {res} 146.1224
{txt}75%    {res}   101.97        839.421
{txt}90%    {res} 217.8743            990       {txt}Variance      {res} 21351.76
{txt}95%    {res}   309.87       1016.235       {txt}Skewness      {res} 1.936469
{txt}99%    {res}   549.45         1425.6       {txt}Kurtosis      {res} 17.23695
{txt}
{com}. scalar c_99 = r(p99)
{txt}
{com}. 
. replace net_goat_income = c_99 if net_goat_income > c_99 & !missing(net_goat_income) & treat == 0
{txt}(12 real changes made)

{com}. 
. sum net_goat_income if treat == 0, d

                       {txt}net_goat_income
{hline 61}
      Percentiles      Smallest
 1%    {res} -245.025        -945.45
{txt} 5%    {res}-80.19495         -643.5
{txt}10%    {res}   -44.55        -500.94       {txt}Obs         {res}      1,200
{txt}25%    {res}     -9.9        -373.23       {txt}Sum of Wgt. {res}      1,200

{txt}50%    {res}        0                      {txt}Mean          {res} 52.90355
                        {txt}Largest       Std. Dev.     {res}  132.342
{txt}75%    {res}   101.97         549.45
{txt}90%    {res} 217.8743         549.45       {txt}Variance      {res}  17514.4
{txt}95%    {res}   309.87         549.45       {txt}Skewness      {res}  .721983
{txt}99%    {res}  545.985         549.45       {txt}Kurtosis      {res} 8.883673
{txt}
{com}. scalar t_1= r(p1)
{txt}
{com}. 
. replace net_goat_income = t_1 if net_goat_income < t_1 & !missing(net_goat_income) & treat == 0
{txt}(12 real changes made)

{com}. * -----------------------------------------------
. 
. 
. 
. * ---------------------------------------------------------
. ** Replace Missing values with zero 
. * LS9 , 
. replace LS9 = 0 if LS9 ==.
{txt}(0 real changes made)

{com}. replace co_opsalevalue = 0 if co_opsalevalue ==.
{txt}(1,172 real changes made)

{com}. * ---------------------------------------------------------
. 
. 
. destring MGT4, replace
{txt}MGT4 already numeric; no {res}replace
{txt}
{com}. 
. lab var bCOM3 "Received sale information (0/1)"
{txt}
{com}. lab var index_dTRN "Transparency discrepancy index (continuous)"
{txt}
{com}. lab var co_opgoatno "Goats sold through cooperative (count)"
{txt}
{com}. lab var LS8 "Goats sold (count)"
{txt}
{com}. lab var rev_goat "Revenue per goat sold (USD)"
{txt}
{com}. lab var rev_co_opgoat "Revenue per cooperative goat sold (USD)"
{txt}
{com}. lab var net_goat_income "Net Goat Income (USD)"
{txt}
{com}. lab var LS9 "Goat revenue (USD)"
{txt}
{com}. lab var co_opsalevalue "Goat revenue through cooperative (USD)"
{txt}
{com}. lab var HHR4 "Age (years)"
{txt}
{com}. lab var HHR14 "Literacy (0/1)"
{txt}
{com}. lab var MEM11 "SHG Meetings Attended in Past 6 Months (count)"
{txt}
{com}. lab var HH_TRN1 "Co-op makes its mandate available to its members (0/1)"
{txt}
{com}. lab var HH_TRN2 "Co-op makes its annual report available to its members (0/1)"
{txt}
{com}. lab var HH_TRN3 "Co-op makes its annual budget available to its members (0/1)"
{txt}
{com}. lab var HH_TRN4 "Co-op makes its financial report available to its members (0/1)"
{txt}
{com}. lab var HH_TRN5 "Co-op makes its meeting minutes available to its members (0/1)"
{txt}
{com}. lab var HH_TRN6 "Co-op makes its election results available to its members (0/1)"
{txt}
{com}. lab var HH_TRN7 "Co-op makes its sale records available to its members (0/1)"
{txt}
{com}. lab var dirt_floor "Household has dirt floors (0/1)"
{txt}
{com}. lab var nfloors "Household has more than one floor (0/1)"
{txt}
{com}. lab var index_mgt "Goat management index (count)"
{txt}
{com}. lab var index_emp "Goat empowerment index (count)"
{txt}
{com}. 
. 
. 
. *iebaltable
. 
. iebaltab bCOM3 index_dTRN co_opgoatno LS8 ///
>                 rev_goat rev_co_opgoat net_goat_income ///
>                 LS9  co_opsalevalue ///
>                 HH_TRN1 HH_TRN2 HH_TRN3 HH_TRN4 HH_TRN5 ///
>                 HH_TRN6 HH_TRN7 ///
>                 HHR4 HHR14 MEM11  ///
>                 dirt_floor nfloors index_mgt index_emp, rowvarlabels ///
>                 grpvar(treat) vce(cluster idx)  ///
>                 savetex("$d2/iebaltab2_nobanke_PAP.tex") replace
{res}{phang}Balance table saved to: {browse "/Users/scottmiller/Dropbox (UFL)/LSIL/Pre-Analysis Plan/PAP Master Replication/Output/iebaltab2_nobanke_PAP.tex":/Users/scottmiller/Dropbox (UFL)/LSIL/Pre-Analysis Plan/PAP Master Replication/Output/iebaltab2_nobanke_PAP.tex} 
{txt}
{smcl}
{com}.                 
.                 
.                 
.                 
.                 
.                 
. 
{txt}end of do-file

{com}. 